NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* TASKS_STOP @Bit 0 : Stop the AUXPLL */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Pos (0UL)     /*!< Position of TASKS_STOP field.                                        */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << AUXPLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.      */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)   /*!< Min enumerator value of TASKS_STOP field.                            */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)   /*!< Max enumerator value of TASKS_STOP field.                            */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                       */


/* AUXPLL_TASKS_NEWFINEFREQ: Change fine frequency */
  #define AUXPLL_TASKS_NEWFINEFREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_NEWFINEFREQ register.                   */

/* TASKS_NEWFINEFREQ @Bit 0 : Change fine frequency */
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Pos (0UL) /*!< Position of TASKS_NEWFINEFREQ field.                       */
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Msk (0x1UL << AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Pos) /*!< Bit mask
                                                                            of TASKS_NEWFINEFREQ field.*/
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_NEWFINEFREQ field.         */
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_NEWFINEFREQ field.         */
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Trigger (0x1UL) /*!< Trigger task                                         */


/* AUXPLL_TASKS_NEWBASEFREQ: Change base frequency */
  #define AUXPLL_TASKS_NEWBASEFREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_NEWBASEFREQ register.                   */

/* TASKS_NEWBASEFREQ @Bit 0 : Change base frequency */
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Pos (0UL) /*!< Position of TASKS_NEWBASEFREQ field.                       */
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Msk (0x1UL << AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Pos) /*!< Bit mask
                                                                            of TASKS_NEWBASEFREQ field.*/
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_NEWBASEFREQ field.         */
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_NEWBASEFREQ field.         */
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Trigger (0x1UL) /*!< Trigger task                                         */


/* AUXPLL_TASKS_FREQINCSTART: Start automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQINCSTART register.                 */

/* TASKS_FREQINCSTART @Bit 0 : Start automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Pos (0UL) /*!< Position of TASKS_FREQINCSTART field.                    */
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Msk (0x1UL << AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Pos) /*!< Bit
                                                                            mask of TASKS_FREQINCSTART field.*/
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQINCSTART field.      */
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQINCSTART field.      */
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Trigger (0x1UL) /*!< Trigger task                                       */


/* AUXPLL_TASKS_FREQINCSTOP: Stop automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQINCSTOP register.                   */

/* TASKS_FREQINCSTOP @Bit 0 : Stop automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Pos (0UL) /*!< Position of TASKS_FREQINCSTOP field.                       */
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Msk (0x1UL << AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Pos) /*!< Bit mask
                                                                            of TASKS_FREQINCSTOP field.*/
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQINCSTOP field.         */
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQINCSTOP field.         */
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Trigger (0x1UL) /*!< Trigger task                                         */


/* AUXPLL_EVENTS_STARTED: AUXPLL started */
  #define AUXPLL_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                         */

/* EVENTS_STARTED @Bit 0 : AUXPLL started */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                  */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                  */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                          */


/* AUXPLL_EVENTS_STOPPED: AUXPLL stopped */
  #define AUXPLL_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                         */

/* EVENTS_STOPPED @Bit 0 : AUXPLL stopped */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                  */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                  */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                          */


/* AUXPLL_EVENTS_LOCKED: AUXPLL locked */
  #define AUXPLL_EVENTS_LOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOCKED register.                           */

/* EVENTS_LOCKED @Bit 0 : AUXPLL locked */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Pos (0UL) /*!< Position of EVENTS_LOCKED field.                                   */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Msk (0x1UL << AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Pos) /*!< Bit mask of
                                                                            EVENTS_LOCKED field.*/
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOCKED field.                     */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOCKED field.                     */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Generated (0x1UL) /*!< Event generated                                            */


/* AUXPLL_INTEN: Enable or disable interrupt */
  #define AUXPLL_INTEN_ResetValue (0x00000000UL)     /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define AUXPLL_INTEN_STARTED_Pos (0UL)             /*!< Position of STARTED field.                                           */
  #define AUXPLL_INTEN_STARTED_Msk (0x1UL << AUXPLL_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                         */
  #define AUXPLL_INTEN_STARTED_Min (0x0UL)           /*!< Min enumerator value of STARTED field.                               */
  #define AUXPLL_INTEN_STARTED_Max (0x1UL)           /*!< Max enumerator value of STARTED field.                               */
  #define AUXPLL_INTEN_STARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define AUXPLL_INTEN_STARTED_Enabled (0x1UL)       /*!< Enable                                                               */

