NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* AXONS_ENABLE: Enable AXONS. */
  #define AXONS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* EN @Bit 0 : Enable */
  #define AXONS_ENABLE_EN_Pos (0UL)                  /*!< Position of EN field.                                                */
  #define AXONS_ENABLE_EN_Msk (0x1UL << AXONS_ENABLE_EN_Pos) /*!< Bit mask of EN field.                                        */
  #define AXONS_ENABLE_EN_Min (0x0UL)                /*!< Min enumerator value of EN field.                                    */
  #define AXONS_ENABLE_EN_Max (0x1UL)                /*!< Max enumerator value of EN field.                                    */
  #define AXONS_ENABLE_EN_Disabled (0x0UL)           /*!< AXONS disabled (powered off).                                        */
  #define AXONS_ENABLE_EN_Enabled (0x1UL)            /*!< AXONS enabled.                                                       */


/* AXONS_STATUS: Status */
  #define AXONS_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* READY @Bit 0 : AXONS ready */
  #define AXONS_STATUS_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define AXONS_STATUS_READY_Msk (0x1UL << AXONS_STATUS_READY_Pos) /*!< Bit mask of READY field.                               */
  #define AXONS_STATUS_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define AXONS_STATUS_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define AXONS_STATUS_READY_NotReady (0x0UL)        /*!< AXONS is not yet accessible                                          */
  #define AXONS_STATUS_READY_Ready (0x1UL)           /*!< AXONS is accessible                                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         BELLBOARD                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct BELLBOARD ===================================================== */
/**
  * @brief BELLBOARD APB registers
  */
  typedef struct {                                   /*!< BELLBOARD Structure                                                  */
    __OM uint32_t TASKS_TRIGGER[4];                  /*!< (@ 0x00000000) Task TRIGGER[n]                                       */
    __IM uint32_t RESERVED[60];
    __IOM uint32_t EVENTS_TRIGGERED[4];              /*!< (@ 0x00000100) Event TRIGGERED[n]                                    */
    __IM uint32_t RESERVED1[124];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
  } NRF_BELLBOARD_Type;                              /*!< Size = 832 (0x340)                                                   */

/* BELLBOARD_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_MaxCount (4UL)     /*!< Max size of TASKS_TRIGGER[4] array.                                  */
  #define BELLBOARD_TASKS_TRIGGER_MaxIndex (3UL)     /*!< Max index of TASKS_TRIGGER[4] array.                                 */
  #define BELLBOARD_TASKS_TRIGGER_MinIndex (0UL)     /*!< Min index of TASKS_TRIGGER[4] array.                                 */
  #define BELLBOARD_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[4] register.                     */

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL) /*!< Position of TASKS_TRIGGER field.                                */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                              */


