NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* STATE @Bit 16 : PLL state (Running between START task and STOPPED event) */
  #define CLOCK_PLL24M_STAT_STATE_Pos (16UL)         /*!< Position of STATE field.                                             */
  #define CLOCK_PLL24M_STAT_STATE_Msk (0x1UL << CLOCK_PLL24M_STAT_STATE_Pos) /*!< Bit mask of STATE field.                     */
  #define CLOCK_PLL24M_STAT_STATE_Min (0x0UL)        /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_PLL24M_STAT_STATE_Max (0x1UL)        /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_PLL24M_STAT_STATE_NotRunning (0x0UL) /*!< PLL24M is not running                                                */
  #define CLOCK_PLL24M_STAT_STATE_Running (0x1UL)    /*!< PLL24M is running                                                    */



/* =================================================== Struct CLOCK_AUXPLL =================================================== */
/**
  * @brief AUXPLL [CLOCK_AUXPLL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  RUN;                               /*!< (@ 0x00000008) Indicates that AUXPLLSTART task was triggered         */
  __IM  uint32_t  STAT;                              /*!< (@ 0x0000000C) Which AUXPLL settings were selected when triggering
                                                                         START task*/
} NRF_CLOCK_AUXPLL_Type;                             /*!< Size = 16 (0x010)                                                    */

/* CLOCK_AUXPLL_RUN: Indicates that AUXPLLSTART task was triggered */
  #define CLOCK_AUXPLL_RUN_ResetValue (0x00000000UL) /*!< Reset value of RUN register.                                         */

/* STATUS @Bit 0 : AUXPLLSTART task triggered or not */
  #define CLOCK_AUXPLL_RUN_STATUS_Pos (0UL)          /*!< Position of STATUS field.                                            */
  #define CLOCK_AUXPLL_RUN_STATUS_Msk (0x1UL << CLOCK_AUXPLL_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.                    */
  #define CLOCK_AUXPLL_RUN_STATUS_Min (0x0UL)        /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_AUXPLL_RUN_STATUS_Max (0x1UL)        /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_AUXPLL_RUN_STATUS_NotTriggered (0x0UL) /*!< Task not triggered                                                 */
  #define CLOCK_AUXPLL_RUN_STATUS_Triggered (0x1UL)  /*!< Task triggered                                                       */


/* CLOCK_AUXPLL_STAT: Which AUXPLL settings were selected when triggering START task */
  #define CLOCK_AUXPLL_STAT_ResetValue (0x00000000UL) /*!< Reset value of STAT register.                                       */

/* STATE @Bit 16 : AUXPLL state (Running between START task and STOPPED event) */
  #define CLOCK_AUXPLL_STAT_STATE_Pos (16UL)         /*!< Position of STATE field.                                             */
  #define CLOCK_AUXPLL_STAT_STATE_Msk (0x1UL << CLOCK_AUXPLL_STAT_STATE_Pos) /*!< Bit mask of STATE field.                     */
  #define CLOCK_AUXPLL_STAT_STATE_Min (0x0UL)        /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_AUXPLL_STAT_STATE_Max (0x1UL)        /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_AUXPLL_STAT_STATE_NotRunning (0x0UL) /*!< AUXPLL is not running                                                */
  #define CLOCK_AUXPLL_STAT_STATE_Running (0x1UL)    /*!< AUXPLL is running                                                    */


/* ====================================================== Struct CLOCK ======================================================= */
/**
  * @brief Clock management
  */
  typedef struct {                                   /*!< CLOCK Structure                                                      */
    __OM uint32_t TASKS_XOSTART;                     /*!< (@ 0x00000000) Start crystal oscillator (HFXO)                       */
    __OM uint32_t TASKS_XOSTOP;                      /*!< (@ 0x00000004) Stop crystal oscillator (HFXO)                        */
    __OM uint32_t TASKS_PLLSTART;                    /*!< (@ 0x00000008) Start PLL and keep it running, regardless of the
                                                                         automatic clock requests*/
    __OM uint32_t TASKS_PLLSTOP;                     /*!< (@ 0x0000000C) Stop PLL                                              */
    __OM uint32_t TASKS_LFCLKSTART;                  /*!< (@ 0x00000010) Start LFCLK source as selected in LFCLK.SRC           */
    __OM uint32_t TASKS_LFCLKSTOP;                   /*!< (@ 0x00000014) Stop LFCLK source                                     */
    __IM uint32_t RESERVED[3];
    __OM uint32_t TASKS_XO24MSTART;                  /*!< (@ 0x00000024) Request HFXO to provide a crystal clock for PCLK24M   */
    __OM uint32_t TASKS_XO24MSTOP;                   /*!< (@ 0x00000028) Stop request HFXO for PCLK24M. When all requests for
                                                                         HFXO are stopped, HFXO will also stop.*/
    __IM uint32_t RESERVED1[5];
    __OM uint32_t TASKS_AUXPLLSTART;                 /*!< (@ 0x00000040) Start AUXPLL audio / USB clock source                 */
    __OM uint32_t TASKS_AUXPLLSTOP;                  /*!< (@ 0x00000044) Stop AUXPLL audio / USB clock source                  */
    __IM uint32_t RESERVED2[14];
    __IOM uint32_t SUBSCRIBE_XOSTART;                /*!< (@ 0x00000080) Subscribe configuration for task XOSTART              */
    __IOM uint32_t SUBSCRIBE_XOSTOP;                 /*!< (@ 0x00000084) Subscribe configuration for task XOSTOP               */
    __IOM uint32_t SUBSCRIBE_PLLSTART;               /*!< (@ 0x00000088) Subscribe configuration for task PLLSTART             */
    __IOM uint32_t SUBSCRIBE_PLLSTOP;                /*!< (@ 0x0000008C) Subscribe configuration for task PLLSTOP              */
    __IOM uint32_t SUBSCRIBE_LFCLKSTART;             /*!< (@ 0x00000090) Subscribe configuration for task LFCLKSTART           */
    __IOM uint32_t SUBSCRIBE_LFCLKSTOP;              /*!< (@ 0x00000094) Subscribe configuration for task LFCLKSTOP            */
    __IM uint32_t RESERVED3[3];
    __IOM uint32_t SUBSCRIBE_XO24MSTART;             /*!< (@ 0x000000A4) Subscribe configuration for task XO24MSTART           */
    __IOM uint32_t SUBSCRIBE_XO24MSTOP;              /*!< (@ 0x000000A8) Subscribe configuration for task XO24MSTOP            */
    __IM uint32_t RESERVED4[5];
    __IOM uint32_t SUBSCRIBE_AUXPLLSTART;            /*!< (@ 0x000000C0) Subscribe configuration for task AUXPLLSTART          */
    __IOM uint32_t SUBSCRIBE_AUXPLLSTOP;             /*!< (@ 0x000000C4) Subscribe configuration for task AUXPLLSTOP           */
    __IM uint32_t RESERVED5[14];
    __IOM uint32_t EVENTS_XOSTARTED;                 /*!< (@ 0x00000100) Crystal oscillator has started                        */
    __IOM uint32_t EVENTS_PLLSTARTED;                /*!< (@ 0x00000104) PLL started                                           */
    __IOM uint32_t EVENTS_LFCLKSTARTED;              /*!< (@ 0x00000108) LFCLK source started                                  */
    __IM uint32_t RESERVED6[4];
    __IOM uint32_t EVENTS_XO24MSTARTED;              /*!< (@ 0x0000011C) XO24M started                                         */
    __IOM uint32_t EVENTS_AUXPLLSTARTED;             /*!< (@ 0x00000120) AUXPLL source started                                 */
    __IM uint32_t RESERVED7[23];
    __IOM uint32_t PUBLISH_XOSTARTED;                /*!< (@ 0x00000180) Publish configuration for event XOSTARTED             */
    __IOM uint32_t PUBLISH_PLLSTARTED;               /*!< (@ 0x00000184) Publish configuration for event PLLSTARTED            */
    __IOM uint32_t PUBLISH_LFCLKSTARTED;             /*!< (@ 0x00000188) Publish configuration for event LFCLKSTARTED          */
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t PUBLISH_XO24MSTARTED;             /*!< (@ 0x0000019C) Publish configuration for event XO24MSTARTED          */
    __IOM uint32_t PUBLISH_AUXPLLSTARTED;            /*!< (@ 0x000001A0) Publish configuration for event AUXPLLSTARTED         */
    __IM uint32_t RESERVED9[87];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED10[60];
    __IOM NRF_CLOCK_XO_Type XO;                      /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED11[4];
    __IOM NRF_CLOCK_PLL_Type PLL;                    /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED12[4];
    __IOM NRF_CLOCK_LFCLK_Type LFCLK;                /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED13[3];
    __IOM NRF_CLOCK_PLL24M_Type PLL24M;              /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED14[4];
    __IOM NRF_CLOCK_AUXPLL_Type AUXPLL;              /*!< (@ 0x00000480) (unspecified)                                         */
  } NRF_CLOCK_Type;                                  /*!< Size = 1168 (0x490)                                                  */

/* CLOCK_TASKS_XOSTART: Start crystal oscillator (HFXO) */
  #define CLOCK_TASKS_XOSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XOSTART register.                            */

