NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MODE3 @Bit 3 : Coexistence allowed configuration for mode [3] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Pos (3UL) /*!< Position of MODE3 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT0. */

/* Field group CLIENT1 : (unspecified) */
/* MODE0 @Bit 4 : Coexistence allowed configuration for mode [0] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Pos (4UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 5 : Coexistence allowed configuration for mode [1] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Pos (5UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 6 : Coexistence allowed configuration for mode [2] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Pos (6UL) /*!< Position of MODE2 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE3 @Bit 7 : Coexistence allowed configuration for mode [3] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Pos (7UL) /*!< Position of MODE3 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT1. */

/* Field group CLIENT2 : (unspecified) */
/* MODE0 @Bit 8 : Coexistence allowed configuration for mode [0] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Pos (8UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 9 : Coexistence allowed configuration for mode [1] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Pos (9UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 10 : Coexistence allowed configuration for mode [2] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Pos (10UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

