NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MODE3 @Bit 11 : Coexistence allowed configuration for mode [3] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Pos (11UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT2. */

/* Field group CLIENT3 : (unspecified) */
/* MODE0 @Bit 12 : Coexistence allowed configuration for mode [0] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Pos (12UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 13 : Coexistence allowed configuration for mode [1] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Pos (13UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 14 : Coexistence allowed configuration for mode [2] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Pos (14UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE3 @Bit 15 : Coexistence allowed configuration for mode [3] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Pos (15UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT3. */

/* Field group CLIENT4 : (unspecified) */
/* MODE0 @Bit 16 : Coexistence allowed configuration for mode [0] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Pos (16UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 17 : Coexistence allowed configuration for mode [1] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Pos (17UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 18 : Coexistence allowed configuration for mode [2] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Pos (18UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE3 @Bit 19 : Coexistence allowed configuration for mode [3] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Pos (19UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT4. */

/* Field group CLIENT5 : (unspecified) */
/* MODE0 @Bit 20 : Coexistence allowed configuration for mode [0] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Pos (20UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

