NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* ====================================================== Struct COEXC ======================================================= */
/**
  * @brief Coexistence controller
  */
  typedef struct {                                   /*!< COEXC Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM NRF_COEXC_CCMALLOW_Type CCMALLOW[8];       /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED1[64];
    __IOM uint32_t CCCONF[8];                        /*!< (@ 0x00000600) Configuration of coexistence client [n]               */
    __IM uint32_t RESERVED2[8];
    __IOM uint32_t TURNAROUND[8];                    /*!< (@ 0x00000640) Turnaround time for the coexistence client [n]        */
    __IM uint32_t RESERVED3[40];
    __IM uint32_t GRANTED;                           /*!< (@ 0x00000700) Granted status of the shared resource                 */
    __IOM NRF_COEXC_PSEL_Type PSEL;                  /*!< (@ 0x00000704) (unspecified)                                         */
  } NRF_COEXC_Type;                                  /*!< Size = 1808 (0x710)                                                  */

/* COEXC_CCCONF: Configuration of coexistence client [n] */
  #define COEXC_CCCONF_MaxCount (8UL)                /*!< Max size of CCCONF[8] array.                                         */
  #define COEXC_CCCONF_MaxIndex (7UL)                /*!< Max index of CCCONF[8] array.                                        */
  #define COEXC_CCCONF_MinIndex (0UL)                /*!< Min index of CCCONF[8] array.                                        */
  #define COEXC_CCCONF_ResetValue (0x00080000UL)     /*!< Reset value of CCCONF[8] register.                                   */

/* MODE @Bits 0..2 : Coexistence mode of the client [n] */
  #define COEXC_CCCONF_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define COEXC_CCCONF_MODE_Msk (0x7UL << COEXC_CCCONF_MODE_Pos) /*!< Bit mask of MODE field.                                  */

/* PRIORITY @Bits 16..23 : Priority of the coexistence client [n] */
  #define COEXC_CCCONF_PRIORITY_Pos (16UL)           /*!< Position of PRIORITY field.                                          */
  #define COEXC_CCCONF_PRIORITY_Msk (0xFFUL << COEXC_CCCONF_PRIORITY_Pos) /*!< Bit mask of PRIORITY field.                     */


/* COEXC_TURNAROUND: Turnaround time for the coexistence client [n] */
  #define COEXC_TURNAROUND_MaxCount (8UL)            /*!< Max size of TURNAROUND[8] array.                                     */
  #define COEXC_TURNAROUND_MaxIndex (7UL)            /*!< Max index of TURNAROUND[8] array.                                    */
  #define COEXC_TURNAROUND_MinIndex (0UL)            /*!< Min index of TURNAROUND[8] array.                                    */
  #define COEXC_TURNAROUND_ResetValue (0x00000280UL) /*!< Reset value of TURNAROUND[8] register.                               */

/* CLOCKCYCLES @Bits 0..11 : Number of clock cycles */
  #define COEXC_TURNAROUND_CLOCKCYCLES_Pos (0UL)     /*!< Position of CLOCKCYCLES field.                                       */
  #define COEXC_TURNAROUND_CLOCKCYCLES_Msk (0xFFFUL << COEXC_TURNAROUND_CLOCKCYCLES_Pos) /*!< Bit mask of CLOCKCYCLES field.   */
  #define COEXC_TURNAROUND_CLOCKCYCLES_Min (0x001UL) /*!< Min value of CLOCKCYCLES field.                                      */
  #define COEXC_TURNAROUND_CLOCKCYCLES_Max (0xFFFUL) /*!< Max size of CLOCKCYCLES field.                                       */


/* COEXC_GRANTED: Granted status of the shared resource */
  #define COEXC_GRANTED_ResetValue (0x00000000UL)    /*!< Reset value of GRANTED register.                                     */

/* CLIENT0 @Bit 0 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT0_Pos (0UL)            /*!< Position of CLIENT0 field.                                           */
  #define COEXC_GRANTED_CLIENT0_Msk (0x1UL << COEXC_GRANTED_CLIENT0_Pos) /*!< Bit mask of CLIENT0 field.                       */
  #define COEXC_GRANTED_CLIENT0_Min (0x0UL)          /*!< Min enumerator value of CLIENT0 field.                               */
  #define COEXC_GRANTED_CLIENT0_Max (0x1UL)          /*!< Max enumerator value of CLIENT0 field.                               */
  #define COEXC_GRANTED_CLIENT0_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [0]            */
  #define COEXC_GRANTED_CLIENT0_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [0]                */

/* CLIENT1 @Bit 1 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT1_Pos (1UL)            /*!< Position of CLIENT1 field.                                           */
  #define COEXC_GRANTED_CLIENT1_Msk (0x1UL << COEXC_GRANTED_CLIENT1_Pos) /*!< Bit mask of CLIENT1 field.                       */
  #define COEXC_GRANTED_CLIENT1_Min (0x0UL)          /*!< Min enumerator value of CLIENT1 field.                               */
  #define COEXC_GRANTED_CLIENT1_Max (0x1UL)          /*!< Max enumerator value of CLIENT1 field.                               */
  #define COEXC_GRANTED_CLIENT1_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [1]            */
  #define COEXC_GRANTED_CLIENT1_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [1]                */

/* CLIENT2 @Bit 2 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT2_Pos (2UL)            /*!< Position of CLIENT2 field.                                           */
  #define COEXC_GRANTED_CLIENT2_Msk (0x1UL << COEXC_GRANTED_CLIENT2_Pos) /*!< Bit mask of CLIENT2 field.                       */
  #define COEXC_GRANTED_CLIENT2_Min (0x0UL)          /*!< Min enumerator value of CLIENT2 field.                               */
  #define COEXC_GRANTED_CLIENT2_Max (0x1UL)          /*!< Max enumerator value of CLIENT2 field.                               */
  #define COEXC_GRANTED_CLIENT2_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [2]            */
  #define COEXC_GRANTED_CLIENT2_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [2]                */

/* CLIENT3 @Bit 3 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT3_Pos (3UL)            /*!< Position of CLIENT3 field.                                           */
  #define COEXC_GRANTED_CLIENT3_Msk (0x1UL << COEXC_GRANTED_CLIENT3_Pos) /*!< Bit mask of CLIENT3 field.                       */
  #define COEXC_GRANTED_CLIENT3_Min (0x0UL)          /*!< Min enumerator value of CLIENT3 field.                               */
  #define COEXC_GRANTED_CLIENT3_Max (0x1UL)          /*!< Max enumerator value of CLIENT3 field.                               */
  #define COEXC_GRANTED_CLIENT3_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [3]            */
  #define COEXC_GRANTED_CLIENT3_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [3]                */

/* CLIENT4 @Bit 4 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT4_Pos (4UL)            /*!< Position of CLIENT4 field.                                           */
  #define COEXC_GRANTED_CLIENT4_Msk (0x1UL << COEXC_GRANTED_CLIENT4_Pos) /*!< Bit mask of CLIENT4 field.                       */
  #define COEXC_GRANTED_CLIENT4_Min (0x0UL)          /*!< Min enumerator value of CLIENT4 field.                               */
  #define COEXC_GRANTED_CLIENT4_Max (0x1UL)          /*!< Max enumerator value of CLIENT4 field.                               */
  #define COEXC_GRANTED_CLIENT4_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [4]            */
  #define COEXC_GRANTED_CLIENT4_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [4]                */

/* CLIENT5 @Bit 5 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT5_Pos (5UL)            /*!< Position of CLIENT5 field.                                           */
  #define COEXC_GRANTED_CLIENT5_Msk (0x1UL << COEXC_GRANTED_CLIENT5_Pos) /*!< Bit mask of CLIENT5 field.                       */
  #define COEXC_GRANTED_CLIENT5_Min (0x0UL)          /*!< Min enumerator value of CLIENT5 field.                               */
  #define COEXC_GRANTED_CLIENT5_Max (0x1UL)          /*!< Max enumerator value of CLIENT5 field.                               */
  #define COEXC_GRANTED_CLIENT5_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [5]            */
  #define COEXC_GRANTED_CLIENT5_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [5]                */

