NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* TRIGGERED10 @Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
  #define EGU_INTENCLR_TRIGGERED10_Pos (10UL)        /*!< Position of TRIGGERED10 field.                                       */
  #define EGU_INTENCLR_TRIGGERED10_Msk (0x1UL << EGU_INTENCLR_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field.             */
  #define EGU_INTENCLR_TRIGGERED10_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define EGU_INTENCLR_TRIGGERED10_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define EGU_INTENCLR_TRIGGERED10_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED11 @Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
  #define EGU_INTENCLR_TRIGGERED11_Pos (11UL)        /*!< Position of TRIGGERED11 field.                                       */
  #define EGU_INTENCLR_TRIGGERED11_Msk (0x1UL << EGU_INTENCLR_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field.             */
  #define EGU_INTENCLR_TRIGGERED11_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define EGU_INTENCLR_TRIGGERED11_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define EGU_INTENCLR_TRIGGERED11_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED12 @Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
  #define EGU_INTENCLR_TRIGGERED12_Pos (12UL)        /*!< Position of TRIGGERED12 field.                                       */
  #define EGU_INTENCLR_TRIGGERED12_Msk (0x1UL << EGU_INTENCLR_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field.             */
  #define EGU_INTENCLR_TRIGGERED12_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define EGU_INTENCLR_TRIGGERED12_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define EGU_INTENCLR_TRIGGERED12_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED13 @Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
  #define EGU_INTENCLR_TRIGGERED13_Pos (13UL)        /*!< Position of TRIGGERED13 field.                                       */
  #define EGU_INTENCLR_TRIGGERED13_Msk (0x1UL << EGU_INTENCLR_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field.             */
  #define EGU_INTENCLR_TRIGGERED13_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define EGU_INTENCLR_TRIGGERED13_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define EGU_INTENCLR_TRIGGERED13_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED14 @Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
  #define EGU_INTENCLR_TRIGGERED14_Pos (14UL)        /*!< Position of TRIGGERED14 field.                                       */
  #define EGU_INTENCLR_TRIGGERED14_Msk (0x1UL << EGU_INTENCLR_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field.             */
  #define EGU_INTENCLR_TRIGGERED14_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define EGU_INTENCLR_TRIGGERED14_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define EGU_INTENCLR_TRIGGERED14_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED15 @Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
  #define EGU_INTENCLR_TRIGGERED15_Pos (15UL)        /*!< Position of TRIGGERED15 field.                                       */
  #define EGU_INTENCLR_TRIGGERED15_Msk (0x1UL << EGU_INTENCLR_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field.             */
  #define EGU_INTENCLR_TRIGGERED15_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define EGU_INTENCLR_TRIGGERED15_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define EGU_INTENCLR_TRIGGERED15_Clear (0x1UL)     /*!< Disable                                                              */
  #define EGU_INTENCLR_TRIGGERED15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define EGU_INTENCLR_TRIGGERED15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ETM                                            ================ */
/* =========================================================================================================================== */

