NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* IN2 @Bit 2 : Read pending status of interrupt for event IN[2] */
  #define GPIOTE_INTPEND1_IN2_Pos (2UL)              /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTPEND1_IN2_Msk (0x1UL << GPIOTE_INTPEND1_IN2_Pos) /*!< Bit mask of IN2 field.                               */
  #define GPIOTE_INTPEND1_IN2_Min (0x0UL)            /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTPEND1_IN2_Max (0x1UL)            /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTPEND1_IN2_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN2_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* IN3 @Bit 3 : Read pending status of interrupt for event IN[3] */
  #define GPIOTE_INTPEND1_IN3_Pos (3UL)              /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTPEND1_IN3_Msk (0x1UL << GPIOTE_INTPEND1_IN3_Pos) /*!< Bit mask of IN3 field.                               */
  #define GPIOTE_INTPEND1_IN3_Min (0x0UL)            /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTPEND1_IN3_Max (0x1UL)            /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTPEND1_IN3_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN3_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* IN4 @Bit 4 : Read pending status of interrupt for event IN[4] */
  #define GPIOTE_INTPEND1_IN4_Pos (4UL)              /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTPEND1_IN4_Msk (0x1UL << GPIOTE_INTPEND1_IN4_Pos) /*!< Bit mask of IN4 field.                               */
  #define GPIOTE_INTPEND1_IN4_Min (0x0UL)            /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTPEND1_IN4_Max (0x1UL)            /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTPEND1_IN4_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN4_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* IN5 @Bit 5 : Read pending status of interrupt for event IN[5] */
  #define GPIOTE_INTPEND1_IN5_Pos (5UL)              /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTPEND1_IN5_Msk (0x1UL << GPIOTE_INTPEND1_IN5_Pos) /*!< Bit mask of IN5 field.                               */
  #define GPIOTE_INTPEND1_IN5_Min (0x0UL)            /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTPEND1_IN5_Max (0x1UL)            /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTPEND1_IN5_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN5_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* IN6 @Bit 6 : Read pending status of interrupt for event IN[6] */
  #define GPIOTE_INTPEND1_IN6_Pos (6UL)              /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTPEND1_IN6_Msk (0x1UL << GPIOTE_INTPEND1_IN6_Pos) /*!< Bit mask of IN6 field.                               */
  #define GPIOTE_INTPEND1_IN6_Min (0x0UL)            /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTPEND1_IN6_Max (0x1UL)            /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTPEND1_IN6_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN6_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* IN7 @Bit 7 : Read pending status of interrupt for event IN[7] */
  #define GPIOTE_INTPEND1_IN7_Pos (7UL)              /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTPEND1_IN7_Msk (0x1UL << GPIOTE_INTPEND1_IN7_Pos) /*!< Bit mask of IN7 field.                               */
  #define GPIOTE_INTPEND1_IN7_Min (0x0UL)            /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTPEND1_IN7_Max (0x1UL)            /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTPEND1_IN7_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define GPIOTE_INTPEND1_IN7_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* PORT0NONSECURE @Bit 16 : Read pending status of interrupt for event PORT0NONSECURE */
  #define GPIOTE_INTPEND1_PORT0NONSECURE_Pos (16UL)  /*!< Position of PORT0NONSECURE field.                                    */
  #define GPIOTE_INTPEND1_PORT0NONSECURE_Msk (0x1UL << GPIOTE_INTPEND1_PORT0NONSECURE_Pos) /*!< Bit mask of PORT0NONSECURE
                                                                            field.*/
  #define GPIOTE_INTPEND1_PORT0NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT0NONSECURE field.                        */
  #define GPIOTE_INTPEND1_PORT0NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT0NONSECURE field.                        */
  #define GPIOTE_INTPEND1_PORT0NONSECURE_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GPIOTE_INTPEND1_PORT0NONSECURE_Pending (0x1UL) /*!< Read: Pending                                                    */

/* PORT0SECURE @Bit 17 : Read pending status of interrupt for event PORT0SECURE */
  #define GPIOTE_INTPEND1_PORT0SECURE_Pos (17UL)     /*!< Position of PORT0SECURE field.                                       */
  #define GPIOTE_INTPEND1_PORT0SECURE_Msk (0x1UL << GPIOTE_INTPEND1_PORT0SECURE_Pos) /*!< Bit mask of PORT0SECURE field.       */
  #define GPIOTE_INTPEND1_PORT0SECURE_Min (0x0UL)    /*!< Min enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTPEND1_PORT0SECURE_Max (0x1UL)    /*!< Max enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTPEND1_PORT0SECURE_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define GPIOTE_INTPEND1_PORT0SECURE_Pending (0x1UL) /*!< Read: Pending                                                       */


