NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* READY3 @Bit 19 : Write '1' to enable interrupt for event READY[3] */
  #define IPCT_INTENSET1_READY3_Pos (19UL)           /*!< Position of READY3 field.                                            */
  #define IPCT_INTENSET1_READY3_Msk (0x1UL << IPCT_INTENSET1_READY3_Pos) /*!< Bit mask of READY3 field.                        */
  #define IPCT_INTENSET1_READY3_Min (0x0UL)          /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTENSET1_READY3_Max (0x1UL)          /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTENSET1_READY3_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET1_READY3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET1_READY3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* IPCT_INTENCLR1: Disable interrupt */
  #define IPCT_INTENCLR1_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR1 register.                                   */

/* RECEIVE0 @Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
  #define IPCT_INTENCLR1_RECEIVE0_Pos (0UL)          /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTENCLR1_RECEIVE0_Msk (0x1UL << IPCT_INTENCLR1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                  */
  #define IPCT_INTENCLR1_RECEIVE0_Min (0x0UL)        /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR1_RECEIVE0_Max (0x1UL)        /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR1_RECEIVE0_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR1_RECEIVE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_RECEIVE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE1 @Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
  #define IPCT_INTENCLR1_RECEIVE1_Pos (1UL)          /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTENCLR1_RECEIVE1_Msk (0x1UL << IPCT_INTENCLR1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                  */
  #define IPCT_INTENCLR1_RECEIVE1_Min (0x0UL)        /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR1_RECEIVE1_Max (0x1UL)        /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR1_RECEIVE1_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR1_RECEIVE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_RECEIVE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE2 @Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
  #define IPCT_INTENCLR1_RECEIVE2_Pos (2UL)          /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTENCLR1_RECEIVE2_Msk (0x1UL << IPCT_INTENCLR1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                  */
  #define IPCT_INTENCLR1_RECEIVE2_Min (0x0UL)        /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR1_RECEIVE2_Max (0x1UL)        /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR1_RECEIVE2_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR1_RECEIVE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_RECEIVE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE3 @Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
  #define IPCT_INTENCLR1_RECEIVE3_Pos (3UL)          /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTENCLR1_RECEIVE3_Msk (0x1UL << IPCT_INTENCLR1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                  */
  #define IPCT_INTENCLR1_RECEIVE3_Min (0x0UL)        /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTENCLR1_RECEIVE3_Max (0x1UL)        /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTENCLR1_RECEIVE3_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR1_RECEIVE3_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_RECEIVE3_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* READY0 @Bit 16 : Write '1' to disable interrupt for event READY[0] */
  #define IPCT_INTENCLR1_READY0_Pos (16UL)           /*!< Position of READY0 field.                                            */
  #define IPCT_INTENCLR1_READY0_Msk (0x1UL << IPCT_INTENCLR1_READY0_Pos) /*!< Bit mask of READY0 field.                        */
  #define IPCT_INTENCLR1_READY0_Min (0x0UL)          /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTENCLR1_READY0_Max (0x1UL)          /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTENCLR1_READY0_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR1_READY0_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_READY0_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY1 @Bit 17 : Write '1' to disable interrupt for event READY[1] */
  #define IPCT_INTENCLR1_READY1_Pos (17UL)           /*!< Position of READY1 field.                                            */
  #define IPCT_INTENCLR1_READY1_Msk (0x1UL << IPCT_INTENCLR1_READY1_Pos) /*!< Bit mask of READY1 field.                        */
  #define IPCT_INTENCLR1_READY1_Min (0x0UL)          /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTENCLR1_READY1_Max (0x1UL)          /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTENCLR1_READY1_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR1_READY1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_READY1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

