NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* READY2 @Bit 18 : Write '1' to disable interrupt for event READY[2] */
  #define IPCT_INTENCLR1_READY2_Pos (18UL)           /*!< Position of READY2 field.                                            */
  #define IPCT_INTENCLR1_READY2_Msk (0x1UL << IPCT_INTENCLR1_READY2_Pos) /*!< Bit mask of READY2 field.                        */
  #define IPCT_INTENCLR1_READY2_Min (0x0UL)          /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTENCLR1_READY2_Max (0x1UL)          /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTENCLR1_READY2_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR1_READY2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_READY2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY3 @Bit 19 : Write '1' to disable interrupt for event READY[3] */
  #define IPCT_INTENCLR1_READY3_Pos (19UL)           /*!< Position of READY3 field.                                            */
  #define IPCT_INTENCLR1_READY3_Msk (0x1UL << IPCT_INTENCLR1_READY3_Pos) /*!< Bit mask of READY3 field.                        */
  #define IPCT_INTENCLR1_READY3_Min (0x0UL)          /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTENCLR1_READY3_Max (0x1UL)          /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTENCLR1_READY3_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR1_READY3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR1_READY3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* IPCT_INTPEND1: Pending interrupts */
  #define IPCT_INTPEND1_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND1 register.                                    */

/* RECEIVE0 @Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
  #define IPCT_INTPEND1_RECEIVE0_Pos (0UL)           /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTPEND1_RECEIVE0_Msk (0x1UL << IPCT_INTPEND1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                    */
  #define IPCT_INTPEND1_RECEIVE0_Min (0x0UL)         /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND1_RECEIVE0_Max (0x1UL)         /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND1_RECEIVE0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_RECEIVE0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE1 @Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
  #define IPCT_INTPEND1_RECEIVE1_Pos (1UL)           /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTPEND1_RECEIVE1_Msk (0x1UL << IPCT_INTPEND1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                    */
  #define IPCT_INTPEND1_RECEIVE1_Min (0x0UL)         /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND1_RECEIVE1_Max (0x1UL)         /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND1_RECEIVE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_RECEIVE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE2 @Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
  #define IPCT_INTPEND1_RECEIVE2_Pos (2UL)           /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTPEND1_RECEIVE2_Msk (0x1UL << IPCT_INTPEND1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                    */
  #define IPCT_INTPEND1_RECEIVE2_Min (0x0UL)         /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND1_RECEIVE2_Max (0x1UL)         /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND1_RECEIVE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_RECEIVE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE3 @Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
  #define IPCT_INTPEND1_RECEIVE3_Pos (3UL)           /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTPEND1_RECEIVE3_Msk (0x1UL << IPCT_INTPEND1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                    */
  #define IPCT_INTPEND1_RECEIVE3_Min (0x0UL)         /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND1_RECEIVE3_Max (0x1UL)         /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND1_RECEIVE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_RECEIVE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* READY0 @Bit 16 : Read pending status of interrupt for event READY[0] */
  #define IPCT_INTPEND1_READY0_Pos (16UL)            /*!< Position of READY0 field.                                            */
  #define IPCT_INTPEND1_READY0_Msk (0x1UL << IPCT_INTPEND1_READY0_Pos) /*!< Bit mask of READY0 field.                          */
  #define IPCT_INTPEND1_READY0_Min (0x0UL)           /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTPEND1_READY0_Max (0x1UL)           /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTPEND1_READY0_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_READY0_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY1 @Bit 17 : Read pending status of interrupt for event READY[1] */
  #define IPCT_INTPEND1_READY1_Pos (17UL)            /*!< Position of READY1 field.                                            */
  #define IPCT_INTPEND1_READY1_Msk (0x1UL << IPCT_INTPEND1_READY1_Pos) /*!< Bit mask of READY1 field.                          */
  #define IPCT_INTPEND1_READY1_Min (0x0UL)           /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTPEND1_READY1_Max (0x1UL)           /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTPEND1_READY1_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_READY1_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY2 @Bit 18 : Read pending status of interrupt for event READY[2] */
  #define IPCT_INTPEND1_READY2_Pos (18UL)            /*!< Position of READY2 field.                                            */
  #define IPCT_INTPEND1_READY2_Msk (0x1UL << IPCT_INTPEND1_READY2_Pos) /*!< Bit mask of READY2 field.                          */
  #define IPCT_INTPEND1_READY2_Min (0x0UL)           /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTPEND1_READY2_Max (0x1UL)           /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTPEND1_READY2_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_READY2_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY3 @Bit 19 : Read pending status of interrupt for event READY[3] */
  #define IPCT_INTPEND1_READY3_Pos (19UL)            /*!< Position of READY3 field.                                            */
  #define IPCT_INTPEND1_READY3_Msk (0x1UL << IPCT_INTPEND1_READY3_Pos) /*!< Bit mask of READY3 field.                          */
  #define IPCT_INTPEND1_READY3_Min (0x0UL)           /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTPEND1_READY3_Max (0x1UL)           /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTPEND1_READY3_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND1_READY3_Pending (0x1UL)       /*!< Read: Pending                                                        */


/* IPCT_INTEN2: Enable or disable interrupt */
  #define IPCT_INTEN2_ResetValue (0x00000000UL)      /*!< Reset value of INTEN2 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN2_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN2_RECEIVE0_Msk (0x1UL << IPCT_INTEN2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN2_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN2_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN2_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN2_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN2_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN2_RECEIVE1_Msk (0x1UL << IPCT_INTEN2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN2_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN2_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN2_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN2_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN2_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN2_RECEIVE2_Msk (0x1UL << IPCT_INTEN2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN2_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN2_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN2_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN2_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN2_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN2_RECEIVE3_Msk (0x1UL << IPCT_INTEN2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN2_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN2_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN2_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN2_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN2_READY0_Pos (16UL)              /*!< Position of READY0 field.                                            */
  #define IPCT_INTEN2_READY0_Msk (0x1UL << IPCT_INTEN2_READY0_Pos) /*!< Bit mask of READY0 field.                              */
  #define IPCT_INTEN2_READY0_Min (0x0UL)             /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTEN2_READY0_Max (0x1UL)             /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTEN2_READY0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN2_READY0_Enabled (0x1UL)         /*!< Enable                                                               */

