NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* ACTIVE2 @Bit 6 : Retain the active power domain[2] */
  #define LRCCONF_RETAIN_ACTIVE2_Pos (6UL)           /*!< Position of ACTIVE2 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE2_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE2_Pos) /*!< Bit mask of ACTIVE2 field.                     */
  #define LRCCONF_RETAIN_ACTIVE2_Min (0x0UL)         /*!< Min enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Max (0x1UL)         /*!< Max enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE2_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE3 @Bit 7 : Retain the active power domain[3] */
  #define LRCCONF_RETAIN_ACTIVE3_Pos (7UL)           /*!< Position of ACTIVE3 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE3_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE3_Pos) /*!< Bit mask of ACTIVE3 field.                     */
  #define LRCCONF_RETAIN_ACTIVE3_Min (0x0UL)         /*!< Min enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Max (0x1UL)         /*!< Max enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE3_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE4 @Bit 8 : Retain the active power domain[4] */
  #define LRCCONF_RETAIN_ACTIVE4_Pos (8UL)           /*!< Position of ACTIVE4 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE4_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE4_Pos) /*!< Bit mask of ACTIVE4 field.                     */
  #define LRCCONF_RETAIN_ACTIVE4_Min (0x0UL)         /*!< Min enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Max (0x1UL)         /*!< Max enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE4_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE5 @Bit 9 : Retain the active power domain[5] */
  #define LRCCONF_RETAIN_ACTIVE5_Pos (9UL)           /*!< Position of ACTIVE5 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE5_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE5_Pos) /*!< Bit mask of ACTIVE5 field.                     */
  #define LRCCONF_RETAIN_ACTIVE5_Min (0x0UL)         /*!< Min enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Max (0x1UL)         /*!< Max enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE5_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE6 @Bit 10 : Retain the active power domain[6] */
  #define LRCCONF_RETAIN_ACTIVE6_Pos (10UL)          /*!< Position of ACTIVE6 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE6_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE6_Pos) /*!< Bit mask of ACTIVE6 field.                     */
  #define LRCCONF_RETAIN_ACTIVE6_Min (0x0UL)         /*!< Min enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Max (0x1UL)         /*!< Max enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE6_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE7 @Bit 11 : Retain the active power domain[7] */
  #define LRCCONF_RETAIN_ACTIVE7_Pos (11UL)          /*!< Position of ACTIVE7 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE7_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE7_Pos) /*!< Bit mask of ACTIVE7 field.                     */
  #define LRCCONF_RETAIN_ACTIVE7_Min (0x0UL)         /*!< Min enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Max (0x1UL)         /*!< Max enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE7_Enable (0x1UL)      /*!< Retain enabled                                                       */


/* LRCCONF_AX2XWAITSTATES: AX2X bridge waitstates for the domain [n], where n is the Domain ID. */
  #define LRCCONF_AX2XWAITSTATES_MaxCount (16UL)     /*!< Max size of AX2XWAITSTATES[16] array.                                */
  #define LRCCONF_AX2XWAITSTATES_MaxIndex (15UL)     /*!< Max index of AX2XWAITSTATES[16] array.                               */
  #define LRCCONF_AX2XWAITSTATES_MinIndex (0UL)      /*!< Min index of AX2XWAITSTATES[16] array.                               */
  #define LRCCONF_AX2XWAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of AX2XWAITSTATES[16] register.                    */

/* WAITSTATES @Bits 0..2 : Number of waitstates */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos (0UL) /*!< Position of WAITSTATES field.                                       */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Msk (0x7UL << LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          MEMCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

