NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* LOCK @Bit 16 : Enables the lock for this register. */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Pos (16UL)       /*!< Position of LOCK field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_LockDisabled (0x0UL) /*!< Lock is disabled                                                 */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_LockEnabled (0x1UL) /*!< Lock is enabled                                                   */

/* UREN @Bit 20 : Enable read access to the upper part of NVR page, where the upper part size is NVR page size - 2KB */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Pos (20UL)       /*!< Position of UREN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_UREN_Pos) /*!< Bit mask of UREN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Min (0x0UL)      /*!< Min enumerator value of UREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Max (0x1UL)      /*!< Max enumerator value of UREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Disabled (0x0UL) /*!< Read is disabled.                                                    */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Enabled (0x1UL)  /*!< Read is enabled                                                      */

/* UWEN @Bit 21 : Enable write access to the upper part of NVR page, where the upper part size is NVR page size - 2KB */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Pos (21UL)       /*!< Position of UWEN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_UWEN_Pos) /*!< Bit mask of UWEN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Min (0x0UL)      /*!< Min enumerator value of UWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Max (0x1UL)      /*!< Max enumerator value of UWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Disabled (0x0UL) /*!< Write is disabled.                                                   */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Enabled (0x1UL)  /*!< Write is enabled                                                     */

/* LREN @Bit 22 : Enable read access to the lower range of the NVR page, as defined by LRSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Pos (22UL)       /*!< Position of LREN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LREN_Pos) /*!< Bit mask of LREN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Min (0x0UL)      /*!< Min enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Max (0x1UL)      /*!< Max enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Disabled (0x0UL) /*!< Read is disabled.                                                    */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Enabled (0x1UL)  /*!< Read is enabled                                                      */

/* LWEN @Bit 23 : Enable write access to the lower range of the NVR page, as defined by LWSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Pos (23UL)       /*!< Position of LWEN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LWEN_Pos) /*!< Bit mask of LWEN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Min (0x0UL)      /*!< Min enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Max (0x1UL)      /*!< Max enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Disabled (0x0UL) /*!< Write is disabled.                                                   */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Enabled (0x1UL)  /*!< Write is enabled                                                     */

/* LRSIZE @Bits 24..27 : Size of part of the lower 2KB memory in the NVR page to disable read access */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos (24UL)     /*!< Position of LRSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos) /*!< Bit mask of LRSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Min (0x0UL)    /*!< Min value of LRSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Max (0xFUL)    /*!< Max size of LRSIZE field.                                            */

/* LWSIZE @Bits 28..31 : Size of part of the lower 2KB memory in the NVR page to disable write access */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos (28UL)     /*!< Position of LWSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos) /*!< Bit mask of LWSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Min (0x0UL)    /*!< Min value of LWSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Max (0xFUL)    /*!< Max size of LWSIZE field.                                            */



/* =================================================== Struct MRAMC_REGION =================================================== */
/**
  * @brief REGION [MRAMC_REGION] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_MRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define MRAMC_REGION_MaxCount (6UL)                /*!< Size of REGION[6] array.                                             */
  #define MRAMC_REGION_MaxIndex (5UL)                /*!< Max index of REGION[6] array.                                        */
  #define MRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[6] array.                                        */

/* MRAMC_REGION_ADDRESS: Region address */
  #define MRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

