NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* EVENTS_READY @Bit 0 : Current operation is completed */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Pos (0UL)  /*!< Position of EVENTS_READY field.                                      */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Msk (0x1UL << MRAMC_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define MRAMC_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                         */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                         */
  #define MRAMC_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                               */


/* MRAMC_EVENTS_READYNEXT: Ready to accept a new write operation */
  #define MRAMC_EVENTS_READYNEXT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYNEXT register.                      */

/* EVENTS_READYNEXT @Bit 0 : Ready to accept a new write operation */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos (0UL) /*!< Position of EVENTS_READYNEXT field.                           */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Msk (0x1UL << MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos) /*!< Bit mask of
                                                                            EVENTS_READYNEXT field.*/
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYNEXT field.             */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYNEXT field.             */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Generated (0x1UL) /*!< Event generated                                       */


/* MRAMC_EVENTS_ECCERROR: ECC error detected but not corrected. */
  #define MRAMC_EVENTS_ECCERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ECCERROR register.                        */

/* EVENTS_ECCERROR @Bit 0 : ECC error detected but not corrected. */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos (0UL) /*!< Position of EVENTS_ECCERROR field.                              */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Msk (0x1UL << MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_ECCERROR field.*/
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ECCERROR field.                */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ECCERROR field.                */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Generated (0x1UL) /*!< Event generated                                         */


/* MRAMC_EVENTS_ECCERRORCORR: ECC error detected and corrected. */
  #define MRAMC_EVENTS_ECCERRORCORR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ECCERRORCORR register.                */

/* EVENTS_ECCERRORCORR @Bit 0 : ECC error detected and corrected. */
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Pos (0UL) /*!< Position of EVENTS_ECCERRORCORR field.                  */
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Msk (0x1UL << MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Pos) /*!<
                                                                            Bit mask of EVENTS_ECCERRORCORR field.*/
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ECCERRORCORR field.    */
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ECCERRORCORR field.    */
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define MRAMC_EVENTS_ECCERRORCORR_EVENTS_ECCERRORCORR_Generated (0x1UL) /*!< Event generated                                 */


/* MRAMC_EVENTS_TRIMCONFIGREQ: MRAM trim configuration request. The MRAMC is ready for the MRAM trim configuration. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIMCONFIGREQ register.              */

/* EVENTS_TRIMCONFIGREQ @Bit 0 : MRAM trim configuration request. The MRAMC is ready for the MRAM trim configuration. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Pos (0UL) /*!< Position of EVENTS_TRIMCONFIGREQ field.               */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Pos)
                                                                            /*!< Bit mask of EVENTS_TRIMCONFIGREQ field.*/
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIMCONFIGREQ field. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIMCONFIGREQ field. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Generated (0x1UL) /*!< Event generated                               */


/* MRAMC_EVENTS_ACCESSERR: MRAM access error. */
  #define MRAMC_EVENTS_ACCESSERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACCESSERR register.                      */

/* EVENTS_ACCESSERR @Bit 0 : MRAM access error. */
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Pos (0UL) /*!< Position of EVENTS_ACCESSERR field.                           */
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Msk (0x1UL << MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Pos) /*!< Bit mask of
                                                                            EVENTS_ACCESSERR field.*/
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACCESSERR field.             */
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACCESSERR field.             */
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define MRAMC_EVENTS_ACCESSERR_EVENTS_ACCESSERR_Generated (0x1UL) /*!< Event generated                                       */


/* MRAMC_INTEN: Enable or disable interrupt */
  #define MRAMC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

