NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIG_WEN_Pos (0UL)                 /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIG_WEN_Msk (0x3UL << MRAMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                     */
  #define MRAMC_CONFIG_WEN_Min (0x0UL)               /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_Max (0x2UL)               /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_DisableWrite (0x0UL)      /*!< Write is disabled                                                    */
  #define MRAMC_CONFIG_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                              */
  #define MRAMC_CONFIG_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                              */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIG_EEN_Pos (4UL)                 /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIG_EEN_Msk (0x3UL << MRAMC_CONFIG_EEN_Pos) /*!< Bit mask of EEN field.                                     */
  #define MRAMC_CONFIG_EEN_Min (0x0UL)               /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_Max (0x2UL)               /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_DisableErase (0x0UL)      /*!< Erase is disabled but read is allowed                                */
  #define MRAMC_CONFIG_EEN_EnablePageErase (0x1UL)   /*!< Erase page and read are allowed                                      */
  #define MRAMC_CONFIG_EEN_EnableWordErase (0x2UL)   /*!< Erase word and read are allowed                                      */

/* ENABLEECCBUSFAULT @Bit 9 : Enable or disable bus fault on ECC failure during read. */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Pos (9UL)   /*!< Position of ENABLEECCBUSFAULT field.                                 */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Msk (0x1UL << MRAMC_CONFIG_ENABLEECCBUSFAULT_Pos) /*!< Bit mask of ENABLEECCBUSFAULT
                                                                            field.*/
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Min (0x0UL) /*!< Min enumerator value of ENABLEECCBUSFAULT field.                     */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Max (0x1UL) /*!< Max enumerator value of ENABLEECCBUSFAULT field.                     */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Enable (0x0UL) /*!< Enable bus fault on ECC failure during MRAM read                  */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Disable (0x1UL) /*!< Disable bus fault on ECC failure during MRAM read                */


/* MRAMC_AUTOREADMODE: Automatically disables the write and erases on timeout and enters into read mode. */
  #define MRAMC_AUTOREADMODE_ResetValue (0x00000000UL) /*!< Reset value of AUTOREADMODE register.                              */

/* VALUE @Bits 0..11 : Timeout value to disable write and erase. */
  #define MRAMC_AUTOREADMODE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define MRAMC_AUTOREADMODE_VALUE_Msk (0xFFFUL << MRAMC_AUTOREADMODE_VALUE_Pos) /*!< Bit mask of VALUE field.                 */
  #define MRAMC_AUTOREADMODE_VALUE_Min (0x000UL)     /*!< Min value of VALUE field.                                            */
  #define MRAMC_AUTOREADMODE_VALUE_Max (0xFFFUL)     /*!< Max size of VALUE field.                                             */


/* MRAMC_WAITSTATES: Waitstates for MRAM read access */
  #define MRAMC_WAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATENUM @Bits 0..4 : Register to read the current number of waitstate for the MRAM access and set a new value */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Pos (0UL)    /*!< Position of WAITSTATENUM field.                                      */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Msk (0x1FUL << MRAMC_WAITSTATES_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Min (0x03UL) /*!< Min value of WAITSTATENUM field.                                     */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Max (0x1FUL) /*!< Max size of WAITSTATENUM field.                                      */

/* READFROMMRAMDINPIPELINE @Bit 9 : Register to enable or disable reading data pending to be committed to MRAM from the data
                                    input pipeline if the data at the requested read address is already present in the MRAM data
                                    input pipeline. Only applicable for direct write mode. */

  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Pos (9UL) /*!< Position of READFROMMRAMDINPIPELINE field.                   */
  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Msk (0x1UL << MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Pos) /*!< Bit mask of
                                                                            READFROMMRAMDINPIPELINE field.*/
  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Min (0x0UL) /*!< Min enumerator value of READFROMMRAMDINPIPELINE field.     */
  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Max (0x1UL) /*!< Max enumerator value of READFROMMRAMDINPIPELINE field.     */
  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Disable (0x0UL) /*!< Disable reading uncommitted data from MRAM data input
                                                                        pipeline*/
  #define MRAMC_WAITSTATES_READFROMMRAMDINPIPELINE_Enable (0x1UL) /*!< Enable reading uncommitted data from MRAM data input
                                                                       pipeline*/

/* WRITEERASEBESPOKE @Bit 10 : Select the operational mode for the bespoke request. */
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_Pos (10UL) /*!< Position of WRITEERASEBESPOKE field.                              */
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_Msk (0x1UL << MRAMC_WAITSTATES_WRITEERASEBESPOKE_Pos) /*!< Bit mask of
                                                                            WRITEERASEBESPOKE field.*/
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_Min (0x0UL) /*!< Min enumerator value of WRITEERASEBESPOKE field.                 */
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_Max (0x1UL) /*!< Max enumerator value of WRITEERASEBESPOKE field.                 */
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_ModeEntryExit (0x0UL) /*!< Send the bespoke signal when entering either write or
                                                                        erase mode, and release the request when exiting those
                                                                        modes.*/
  #define MRAMC_WAITSTATES_WRITEERASEBESPOKE_ModeEnable (0x1UL) /*!< Send the bespoke request when a write or an erase is
                                                                     enabled in.*/

