NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* LISTPART @Bit 0 : Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has been passed. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Pos (0UL) /*!< Position of LISTPART field.                             */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Msk (0x1UL << MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Pos) /*!<
                                                                            Bit mask of LISTPART field.*/
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Min (0x0UL) /*!< Min enumerator value of LISTPART field.               */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Max (0x1UL) /*!< Max enumerator value of LISTPART field.               */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_LISTPART_Generated (0x1UL) /*!< Event generated                                 */


/* MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB: Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOB register.              */

/* SELECTJOB @Bit 0 : Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Pos (0UL) /*!< Position of SELECTJOB field.                          */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Msk (0x1UL << MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Pos)
                                                                            /*!< Bit mask of SELECTJOB field.*/
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Min (0x0UL) /*!< Min enumerator value of SELECTJOB field.            */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Max (0x1UL) /*!< Max enumerator value of SELECTJOB field.            */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_SELECTJOB_SELECTJOB_Generated (0x1UL) /*!< Event generated                               */


/* MSPI_EVENTS_DMA_EVENTS_DONE_DATA: A job has been completed, i.e. the job's data has been completely transferred either to AXI
                                      or DMA bus, depending on direction. */

  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA register.                        */

/* DATA @Bit 0 : A job has been completed, i.e. the job's data has been completely transferred either to AXI or DMA bus,
                 depending on direction. */

  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Pos (0UL) /*!< Position of DATA field.                                         */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Msk (0x1UL << MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/
  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Min (0x0UL) /*!< Min enumerator value of DATA field.                           */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Max (0x1UL) /*!< Max enumerator value of DATA field.                           */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_DATA_DATA_Generated (0x1UL) /*!< Event generated                                         */


/* MSPI_EVENTS_DMA_EVENTS_DONE_JOB: A job has been fetched from the joblist. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_ResetValue (0x00000000UL) /*!< Reset value of JOB register.                          */

/* JOB @Bit 0 : A job has been fetched from the joblist. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Pos (0UL) /*!< Position of JOB field.                                            */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Msk (0x1UL << MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Pos) /*!< Bit mask of JOB
                                                                            field.*/
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Min (0x0UL) /*!< Min enumerator value of JOB field.                              */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Max (0x1UL) /*!< Max enumerator value of JOB field.                              */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_JOB_JOB_Generated (0x1UL) /*!< Event generated                                           */



/* ================================================= Struct MSPI_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [MSPI_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_MSPI_EVENTS_DMA_EVENTS_DONE_Type EVENTS_DONE; /*!< (@ 0x00000000) Peripheral events.                               */
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000014) AXI bus error received.                               */
  __IOM uint32_t  PAUSED;                            /*!< (@ 0x00000018) DMA paused with task TASKS_PAUSE.                     */
  __IOM uint32_t  RESET;                             /*!< (@ 0x0000001C) DMA reset with task TASKS_RESET.                      */
  __IOM uint32_t  DONE;                              /*!< (@ 0x00000020) DMA transfer done                                     */
  __IOM uint32_t  TXUNEXPECTEDIDLE;                  /*!< (@ 0x00000024) The MSPI core has gone into idle state at an unexpected
                                                                         time, this can happen if the TX buffer underflows, this
                                                                         event is followed by either DONE or ABORTED event.*/
  __IOM uint32_t  INTERNALBUSERROR;                  /*!< (@ 0x00000028) An error occurred during the transfer of data
                                                                         internally in the MSPI, followed by either DONE or
                                                                         ABORTED event.*/
  __IOM uint32_t  ABORTED;                           /*!< (@ 0x0000002C) The MSPI DMA has aborted due to an error given in a
                                                                         separate event, and has attempted to complete any
                                                                         ongoing transactions, and stopped. The MSPI DMA is
                                                                         ready for a new transaction.*/
} NRF_MSPI_EVENTS_DMA_Type;                          /*!< Size = 48 (0x030)                                                    */

/* MSPI_EVENTS_DMA_ERROR: AXI bus error received. */
  #define MSPI_EVENTS_DMA_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                  */

/* ERROR @Bit 0 : AXI bus error received. */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_Pos (0UL)      /*!< Position of ERROR field.                                             */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_Msk (0x1UL << MSPI_EVENTS_DMA_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.             */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_Min (0x0UL)    /*!< Min enumerator value of ERROR field.                                 */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_Max (0x1UL)    /*!< Max enumerator value of ERROR field.                                 */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define MSPI_EVENTS_DMA_ERROR_ERROR_Generated (0x1UL) /*!< Event generated                                                   */


