NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MSPI_DMA_STATUS_BUSERROR: AXI bus error status. */
  #define MSPI_DMA_STATUS_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                            */

/* BUSERROR @Bits 0..2 : AXI bus error type */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                         */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_Msk (0x7UL << MSPI_DMA_STATUS_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                           */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_Max (0x4UL) /*!< Max enumerator value of BUSERROR field.                           */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                          */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_ReadError (0x1UL) /*!< Error related to memory when reading joblist, or error
                                                                   related to memory/register when reading data.*/
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Error related to the joblist address when reading
                                                                         joblist, or error related to address when reading
                                                                         memory/register.*/
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_WriteError (0x3UL) /*!< Error related to memory/register when writing data.        */
  #define MSPI_DMA_STATUS_BUSERROR_BUSERROR_WriteDecodeError (0x4UL) /*!< Error related to the memory/register address when
                                                                          writing data.*/


/* MSPI_DMA_STATUS_FIFO: Data fifo status. */
  #define MSPI_DMA_STATUS_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO register.                                    */

/* RXFIFO @Bits 0..1 : Memory-to-Peripheral direction data fifo status */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Pos (0UL)      /*!< Position of RXFIFO field.                                            */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Msk (0x3UL << MSPI_DMA_STATUS_FIFO_RXFIFO_Pos) /*!< Bit mask of RXFIFO field.            */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Min (0x0UL)    /*!< Min enumerator value of RXFIFO field.                                */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Max (0x2UL)    /*!< Max enumerator value of RXFIFO field.                                */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Empty (0x0UL)  /*!< Fifo is empty.                                                       */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_NotEmpty (0x1UL) /*!< Fifo contains data.                                                */
  #define MSPI_DMA_STATUS_FIFO_RXFIFO_Full (0x2UL)   /*!< Fifo is full.                                                        */

/* TXFIFO @Bits 2..3 : Peripheral-to-Memory direction data fifo status */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Pos (2UL)      /*!< Position of TXFIFO field.                                            */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Msk (0x3UL << MSPI_DMA_STATUS_FIFO_TXFIFO_Pos) /*!< Bit mask of TXFIFO field.            */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Min (0x0UL)    /*!< Min enumerator value of TXFIFO field.                                */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Max (0x2UL)    /*!< Max enumerator value of TXFIFO field.                                */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Empty (0x0UL)  /*!< Fifo is empty.                                                       */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_NotEmpty (0x1UL) /*!< Fifo contains data.                                                */
  #define MSPI_DMA_STATUS_FIFO_TXFIFO_Full (0x2UL)   /*!< Fifo is full.                                                        */


/* MSPI_DMA_STATUS_ACTIVE: DMA activity state. */
  #define MSPI_DMA_STATUS_ACTIVE_ResetValue (0x00000000UL) /*!< Reset value of ACTIVE register.                                */

/* ACTIVE @Bit 0 : DMA activity state. */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Pos (0UL)    /*!< Position of ACTIVE field.                                            */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Msk (0x1UL << MSPI_DMA_STATUS_ACTIVE_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.        */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Min (0x0UL)  /*!< Min enumerator value of ACTIVE field.                                */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Max (0x1UL)  /*!< Max enumerator value of ACTIVE field.                                */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Idle (0x0UL) /*!< DMA is in idle state.                                                */
  #define MSPI_DMA_STATUS_ACTIVE_ACTIVE_Active (0x1UL) /*!< Data is being transferred.                                         */



/* ================================================= Struct MSPI_DMA_CONFIG ================================================== */
/**
  * @brief CONFIG [MSPI_DMA_CONFIG] EasyVDMA configuration registers
  */
typedef struct {
  __IOM uint32_t  BUFFERFILL;                        /*!< (@ 0x00000000) Data to be used when data is sent with BufferFill
                                                                         attribute*/
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000004) Start address of descriptor list                      */
  __IOM uint32_t  LISTPARTTHRESH;                    /*!< (@ 0x00000008) Number of jobs to process before generating event
                                                                         EVENTS_DONE.LISTPART to signal that descriptor list is
                                                                         partially completed.*/
} NRF_MSPI_DMA_CONFIG_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* MSPI_DMA_CONFIG_BUFFERFILL: Data to be used when data is sent with BufferFill attribute */
  #define MSPI_DMA_CONFIG_BUFFERFILL_ResetValue (0x00000000UL) /*!< Reset value of BUFFERFILL register.                        */

/* BUFFERFILL @Bits 0..7 : Data to be used when data is sent with BufferFill attribute */
  #define MSPI_DMA_CONFIG_BUFFERFILL_BUFFERFILL_Pos (0UL) /*!< Position of BUFFERFILL field.                                   */
  #define MSPI_DMA_CONFIG_BUFFERFILL_BUFFERFILL_Msk (0xFFUL << MSPI_DMA_CONFIG_BUFFERFILL_BUFFERFILL_Pos) /*!< Bit mask of
                                                                            BUFFERFILL field.*/


/* MSPI_DMA_CONFIG_LISTPTR: Start address of descriptor list */
  #define MSPI_DMA_CONFIG_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                              */

/* LISTPTR @Bits 0..31 : Start address of descriptor list */
  #define MSPI_DMA_CONFIG_LISTPTR_LISTPTR_Pos (0UL)  /*!< Position of LISTPTR field.                                           */
  #define MSPI_DMA_CONFIG_LISTPTR_LISTPTR_Msk (0xFFFFFFFFUL << MSPI_DMA_CONFIG_LISTPTR_LISTPTR_Pos) /*!< Bit mask of LISTPTR
                                                                            field.*/


