NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* RSVDTXFTHR @Bits 20..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTHR_Pos (20UL) /*!< Position of RSVDTXFTHR field.                             */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTHR_Msk (0xFFFUL << MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTHR_Pos) /*!< Bit
                                                                            mask of RSVDTXFTHR field.*/


/* MSPI_CONTROLLERCORE_CORE_RXFTLR: Receive FIFO Threshold Level */
  #define MSPI_CONTROLLERCORE_CORE_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                       */

/* RFT @Bits 0..3 : Receive FIFO Threshold. */
  #define MSPI_CONTROLLERCORE_CORE_RXFTLR_RFT_Pos (0UL) /*!< Position of RFT field.                                            */
  #define MSPI_CONTROLLERCORE_CORE_RXFTLR_RFT_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_RXFTLR_RFT_Pos) /*!< Bit mask of RFT
                                                                            field.*/

/* RSVDRXFTLR @Bits 4..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RXFTLR_RSVDRXFTLR_Pos (4UL) /*!< Position of RSVDRXFTLR field.                              */
  #define MSPI_CONTROLLERCORE_CORE_RXFTLR_RSVDRXFTLR_Msk (0xFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_RXFTLR_RSVDRXFTLR_Pos) /*!<
                                                                            Bit mask of RSVDRXFTLR field.*/


/* MSPI_CONTROLLERCORE_CORE_TXFLR: Transmit FIFO Level Register */
  #define MSPI_CONTROLLERCORE_CORE_TXFLR_ResetValue (0x00000000UL) /*!< Reset value of TXFLR register.                         */

/* TXTFL @Bits 0..4 : Transmit FIFO Level. */
  #define MSPI_CONTROLLERCORE_CORE_TXFLR_TXTFL_Pos (0UL) /*!< Position of TXTFL field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_TXFLR_TXTFL_Msk (0x1FUL << MSPI_CONTROLLERCORE_CORE_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL
                                                                            field.*/

/* RSVDTXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_TXFLR_RSVDTXFLR_Pos (5UL) /*!< Position of RSVDTXFLR field.                                 */
  #define MSPI_CONTROLLERCORE_CORE_TXFLR_RSVDTXFLR_Msk (0x7FFFFFFUL << MSPI_CONTROLLERCORE_CORE_TXFLR_RSVDTXFLR_Pos) /*!< Bit
                                                                            mask of RSVDTXFLR field.*/


/* MSPI_CONTROLLERCORE_CORE_RXFLR: Receive FIFO Level Register */
  #define MSPI_CONTROLLERCORE_CORE_RXFLR_ResetValue (0x00000000UL) /*!< Reset value of RXFLR register.                         */

/* RXTFL @Bits 0..4 : Receive FIFO Level. */
  #define MSPI_CONTROLLERCORE_CORE_RXFLR_RXTFL_Pos (0UL) /*!< Position of RXTFL field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_RXFLR_RXTFL_Msk (0x1FUL << MSPI_CONTROLLERCORE_CORE_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL
                                                                            field.*/

/* RSVDRXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RXFLR_RSVDRXFLR_Pos (5UL) /*!< Position of RSVDRXFLR field.                                 */
  #define MSPI_CONTROLLERCORE_CORE_RXFLR_RSVDRXFLR_Msk (0x7FFFFFFUL << MSPI_CONTROLLERCORE_CORE_RXFLR_RSVDRXFLR_Pos) /*!< Bit
                                                                            mask of RSVDRXFLR field.*/


/* MSPI_CONTROLLERCORE_CORE_SR: Status Register */
  #define MSPI_CONTROLLERCORE_CORE_SR_ResetValue (0x00000006UL) /*!< Reset value of SR register.                               */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_Pos (0UL) /*!< Position of BUSY field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_BUSY_Pos) /*!< Bit mask of BUSY field.    */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_INACTIVE (0x0UL) /*!< MSPI CORE is idle or disabled                                 */
  #define MSPI_CONTROLLERCORE_CORE_SR_BUSY_ACTIVE (0x1UL) /*!< MSPI CORE is actively transferring data                         */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_Pos (1UL) /*!< Position of TFNF field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_TFNF_Pos) /*!< Bit mask of TFNF field.    */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_Min (0x0UL) /*!< Min enumerator value of TFNF field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_Max (0x1UL) /*!< Max enumerator value of TFNF field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_FULL (0x0UL) /*!< Tx FIFO is full                                                   */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFNF_NOT_FULL (0x1UL) /*!< Tx FIFO is not Full                                           */

/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_Pos (2UL)  /*!< Position of TFE field.                                               */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_TFE_Pos) /*!< Bit mask of TFE field.       */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_Min (0x0UL) /*!< Min enumerator value of TFE field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_Max (0x1UL) /*!< Max enumerator value of TFE field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_NOT_EMPTY (0x0UL) /*!< Transmit FIFO is not empty                                    */
  #define MSPI_CONTROLLERCORE_CORE_SR_TFE_EMPTY (0x1UL) /*!< Transmit FIFO is empty                                            */

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_Pos (3UL) /*!< Position of RFNE field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_RFNE_Pos) /*!< Bit mask of RFNE field.    */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_Min (0x0UL) /*!< Min enumerator value of RFNE field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_Max (0x1UL) /*!< Max enumerator value of RFNE field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_EMPTY (0x0UL) /*!< Receive FIFO is empty                                            */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFNE_NOT_EMPTY (0x1UL) /*!< Receive FIFO is not empty                                    */

/* RFF @Bit 4 : Receive FIFO Full. */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_Pos (4UL)  /*!< Position of RFF field.                                               */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_RFF_Pos) /*!< Bit mask of RFF field.       */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_Min (0x0UL) /*!< Min enumerator value of RFF field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_Max (0x1UL) /*!< Max enumerator value of RFF field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_NOT_FULL (0x0UL) /*!< Receive FIFO is not full                                       */
  #define MSPI_CONTROLLERCORE_CORE_SR_RFF_FULL (0x1UL) /*!< Receive FIFO is full                                               */

/* RSVDSR5 @Bit 5 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR5_Pos (5UL) /*!< Position of RSVDSR5 field.                                        */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR5_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_RSVDSR5_Pos) /*!< Bit mask of RSVDSR5
                                                                            field.*/

/* DCOL @Bit 6 : Data Collision Error. */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_Pos (6UL) /*!< Position of DCOL field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SR_DCOL_Pos) /*!< Bit mask of DCOL field.    */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_Min (0x0UL) /*!< Min enumerator value of DCOL field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_Max (0x1UL) /*!< Max enumerator value of DCOL field.                                */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_NO_ERROR_CONDITION (0x0UL) /*!< No Error                                            */
  #define MSPI_CONTROLLERCORE_CORE_SR_DCOL_TX_COLLISION_ERROR (0x1UL) /*!< Transmit Data Collision Error                       */

/* RSVDSR714 @Bits 7..14 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR714_Pos (7UL) /*!< Position of RSVDSR714 field.                                    */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR714_Msk (0xFFUL << MSPI_CONTROLLERCORE_CORE_SR_RSVDSR714_Pos) /*!< Bit mask of
                                                                            RSVDSR714 field.*/

/* RSVDSR1531 @Bits 15..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR1531_Pos (15UL) /*!< Position of RSVDSR1531 field.                                 */
  #define MSPI_CONTROLLERCORE_CORE_SR_RSVDSR1531_Msk (0x1FFFFUL << MSPI_CONTROLLERCORE_CORE_SR_RSVDSR1531_Pos) /*!< Bit mask of
                                                                            RSVDSR1531 field.*/


/* MSPI_CONTROLLERCORE_CORE_IMR: Interrupt Mask Register */
  #define MSPI_CONTROLLERCORE_CORE_IMR_ResetValue (0x0000043FUL) /*!< Reset value of IMR register.                             */

