NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* RSVDISR11 @Bit 11 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_ISR_RSVDISR11_Pos (11UL) /*!< Position of RSVDISR11 field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_ISR_RSVDISR11_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_ISR_RSVDISR11_Pos) /*!< Bit mask of
                                                                            RSVDISR11 field.*/

/* RSVD1231ISR @Bits 12..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_ISR_RSVD1231ISR_Pos (12UL) /*!< Position of RSVD1231ISR field.                              */
  #define MSPI_CONTROLLERCORE_CORE_ISR_RSVD1231ISR_Msk (0xFFFFFUL << MSPI_CONTROLLERCORE_CORE_ISR_RSVD1231ISR_Pos) /*!< Bit mask
                                                                            of RSVD1231ISR field.*/


/* MSPI_CONTROLLERCORE_CORE_RISR: Raw Interrupt Status Register */
  #define MSPI_CONTROLLERCORE_CORE_RISR_ResetValue (0x00000000UL) /*!< Reset value of RISR register.                           */

/* TXEIR @Bit 0 : Transmit FIFO Empty Raw Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_Pos (0UL) /*!< Position of TXEIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_Pos) /*!< Bit mask of TXEIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_Min (0x0UL) /*!< Min enumerator value of TXEIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_Max (0x1UL) /*!< Max enumerator value of TXEIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_INACTIVE (0x0UL) /*!< ssi_txe_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXEIR_ACTIVE (0x1UL) /*!< ssi_txe_intr interrupt is active prior to masking            */

/* TXOIR @Bit 1 : Transmit FIFO Overflow Raw Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_Pos (1UL) /*!< Position of TXOIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_Pos) /*!< Bit mask of TXOIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_Min (0x0UL) /*!< Min enumerator value of TXOIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_Max (0x1UL) /*!< Max enumerator value of TXOIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_INACTIVE (0x0UL) /*!< ssi_txo_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_TXOIR_ACTIVE (0x1UL) /*!< ssi_txo_intr interrupt is active prior to masking            */

/* RXUIR @Bit 2 : Receive FIFO Underflow Raw Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_Pos (2UL) /*!< Position of RXUIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_Pos) /*!< Bit mask of RXUIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_Min (0x0UL) /*!< Min enumerator value of RXUIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_Max (0x1UL) /*!< Max enumerator value of RXUIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_INACTIVE (0x0UL) /*!< ssi_rxu_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXUIR_ACTIVE (0x1UL) /*!< ssi_rxu_intr interrupt is active prior to masking            */

/* RXOIR @Bit 3 : Receive FIFO Overflow Raw Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_Pos (3UL) /*!< Position of RXOIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_Pos) /*!< Bit mask of RXOIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_Min (0x0UL) /*!< Min enumerator value of RXOIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_Max (0x1UL) /*!< Max enumerator value of RXOIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_INACTIVE (0x0UL) /*!< ssi_rxo_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXOIR_ACTIVE (0x1UL) /*!< ssi_rxo_intr interrupt is active prior to masking            */

/* RXFIR @Bit 4 : Receive FIFO Full Raw Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_Pos (4UL) /*!< Position of RXFIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_Pos) /*!< Bit mask of RXFIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_Min (0x0UL) /*!< Min enumerator value of RXFIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_Max (0x1UL) /*!< Max enumerator value of RXFIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_INACTIVE (0x0UL) /*!< ssi_rxf_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RXFIR_ACTIVE (0x1UL) /*!< ssi_rxf_intr interrupt is active prior to masking            */

/* MSTIR @Bit 5 : Multi-Controller Contention Raw Interrupt Status. This bit field is not present if the MSPI CORE is configured
                  as a serial-target device. */

  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_Pos (5UL) /*!< Position of MSTIR field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_Pos) /*!< Bit mask of MSTIR
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_Min (0x0UL) /*!< Min enumerator value of MSTIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_Max (0x1UL) /*!< Max enumerator value of MSTIR field.                            */
  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_INACTIVE (0x0UL) /*!< ssi_mst_intr interrupt is not active prior masking         */
  #define MSPI_CONTROLLERCORE_CORE_RISR_MSTIR_ACTIVE (0x1UL) /*!< ssi_mst_intr interrupt is active prior to masking            */

/* RSVDRISR6 @Bit 6 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR6_Pos (6UL) /*!< Position of RSVDRISR6 field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR6_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR6_Pos) /*!< Bit mask of
                                                                            RSVDRISR6 field.*/

/* RSVDRISR7 @Bit 7 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR7_Pos (7UL) /*!< Position of RSVDRISR7 field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR7_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RISR_RSVDRISR7_Pos) /*!< Bit mask of
                                                                            RSVDRISR7 field.*/

