NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* RSVDICR @Bits 1..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_ICR_RSVDICR_Pos (1UL) /*!< Position of RSVDICR field.                                       */
  #define MSPI_CONTROLLERCORE_CORE_ICR_RSVDICR_Msk (0x7FFFFFFFUL << MSPI_CONTROLLERCORE_CORE_ICR_RSVDICR_Pos) /*!< Bit mask of
                                                                            RSVDICR field.*/


/* MSPI_CONTROLLERCORE_CORE_DMACR: DMA Control Register */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_ResetValue (0x00000000UL) /*!< Reset value of DMACR register.                         */

/* RDMAE @Bit 0 : Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_Pos (0UL) /*!< Position of RDMAE field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_Pos) /*!< Bit mask of RDMAE
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_Min (0x0UL) /*!< Min enumerator value of RDMAE field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_Max (0x1UL) /*!< Max enumerator value of RDMAE field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_DISABLE (0x0UL) /*!< Receive DMA disabled                                       */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RDMAE_ENABLED (0x1UL) /*!< Receive DMA enabled                                        */

/* TDMAE @Bit 1 : Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_Pos (1UL) /*!< Position of TDMAE field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_Pos) /*!< Bit mask of TDMAE
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_Min (0x0UL) /*!< Min enumerator value of TDMAE field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_Max (0x1UL) /*!< Max enumerator value of TDMAE field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_DISABLE (0x0UL) /*!< Transmit DMA disabled                                      */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_TDMAE_ENABLED (0x1UL) /*!< Transmit DMA enabled                                       */

/* RSVDDMACR2 @Bit 2 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR2_Pos (2UL) /*!< Position of RSVDDMACR2 field.                               */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR2_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR2_Pos) /*!< Bit mask
                                                                            of RSVDDMACR2 field.*/

/* RSVDDMACR34 @Bits 3..4 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR34_Pos (3UL) /*!< Position of RSVDDMACR34 field.                             */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR34_Msk (0x3UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR34_Pos) /*!< Bit mask
                                                                            of RSVDDMACR34 field.*/

/* RSVDDMACR5 @Bit 5 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR5_Pos (5UL) /*!< Position of RSVDDMACR5 field.                               */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR5_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR5_Pos) /*!< Bit mask
                                                                            of RSVDDMACR5 field.*/

/* RSVDDMACR6 @Bit 6 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR6_Pos (6UL) /*!< Position of RSVDDMACR6 field.                               */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR6_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR6_Pos) /*!< Bit mask
                                                                            of RSVDDMACR6 field.*/

/* RSVDDMACR7 @Bit 7 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR7_Pos (7UL) /*!< Position of RSVDDMACR7 field.                               */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR7_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR7_Pos) /*!< Bit mask
                                                                            of RSVDDMACR7 field.*/

/* RSVDDMACR811 @Bits 8..11 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR811_Pos (8UL) /*!< Position of RSVDDMACR811 field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR811_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR811_Pos) /*!< Bit
                                                                            mask of RSVDDMACR811 field.*/

/* RSVDDMACR1214 @Bits 12..14 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR1214_Pos (12UL) /*!< Position of RSVDDMACR1214 field.                        */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR1214_Msk (0x7UL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR1214_Pos) /*!< Bit
                                                                            mask of RSVDDMACR1214 field.*/

/* RSVDDMACR @Bits 15..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR_Pos (15UL) /*!< Position of RSVDDMACR field.                                */
  #define MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR_Msk (0x1FFFFUL << MSPI_CONTROLLERCORE_CORE_DMACR_RSVDDMACR_Pos) /*!< Bit mask
                                                                            of RSVDDMACR field.*/


/* MSPI_CONTROLLERCORE_CORE_DMATDLR: DMA Transmit Data Level */
  #define MSPI_CONTROLLERCORE_CORE_DMATDLR_ResetValue (0x00000000UL) /*!< Reset value of DMATDLR register.                     */

/* DMATDL @Bits 0..3 : Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit
                       logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of
                       valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1. */

  #define MSPI_CONTROLLERCORE_CORE_DMATDLR_DMATDL_Pos (0UL) /*!< Position of DMATDL field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_DMATDLR_DMATDL_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_DMATDLR_DMATDL_Pos) /*!< Bit mask of
                                                                            DMATDL field.*/

/* RSVDDMATDLR @Bits 4..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMATDLR_RSVDDMATDLR_Pos (4UL) /*!< Position of RSVDDMATDLR field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMATDLR_RSVDDMATDLR_Msk (0xFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_DMATDLR_RSVDDMATDLR_Pos)
                                                                            /*!< Bit mask of RSVDDMATDLR field.*/


/* MSPI_CONTROLLERCORE_CORE_DMARDLR: DMA Receive Data Level */
  #define MSPI_CONTROLLERCORE_CORE_DMARDLR_ResetValue (0x00000000UL) /*!< Reset value of DMARDLR register.                     */

/* DMARDL @Bits 0..3 : Receive Data Level. This bit field controls the level at which a DMA request is made by the receive
                       logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data
                       entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1. */

  #define MSPI_CONTROLLERCORE_CORE_DMARDLR_DMARDL_Pos (0UL) /*!< Position of DMARDL field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_DMARDLR_DMARDL_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_DMARDLR_DMARDL_Pos) /*!< Bit mask of
                                                                            DMARDL field.*/

/* RSVDDMARDLR @Bits 4..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_DMARDLR_RSVDDMARDLR_Pos (4UL) /*!< Position of RSVDDMARDLR field.                           */
  #define MSPI_CONTROLLERCORE_CORE_DMARDLR_RSVDDMARDLR_Msk (0xFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_DMARDLR_RSVDDMARDLR_Pos)
                                                                            /*!< Bit mask of RSVDDMARDLR field.*/


/* MSPI_CONTROLLERCORE_CORE_IDR: Identification Register */
  #define MSPI_CONTROLLERCORE_CORE_IDR_ResetValue (0x51535049UL) /*!< Reset value of IDR register.                             */

/* IDCODE @Bits 0..31 : Identification code. The register contains the identification code of the peripheral, which is written
                        into the register at configuration time using CoreConsultant. */

  #define MSPI_CONTROLLERCORE_CORE_IDR_IDCODE_Pos (0UL) /*!< Position of IDCODE field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_IDR_IDCODE_Msk (0xFFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_IDR_IDCODE_Pos) /*!< Bit mask of
                                                                            IDCODE field.*/


/* MSPI_CONTROLLERCORE_CORE_SSICVERSIONID: MSPI CORE component version */
  #define MSPI_CONTROLLERCORE_CORE_SSICVERSIONID_ResetValue (0x3230312AUL) /*!< Reset value of SSICVERSIONID register.         */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. Consists of ASCII value for
                                 each number in the version, followed by *. For example 31_30_33_2A represents the version
                                 1.03*. */

  #define MSPI_CONTROLLERCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.             */
  #define MSPI_CONTROLLERCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/


/* MSPI_CONTROLLERCORE_CORE_DR: MSPI CORE Data Register 0 */
  #define MSPI_CONTROLLERCORE_CORE_DR_MaxCount (36UL) /*!< Max size of DR[36] array.                                           */
  #define MSPI_CONTROLLERCORE_CORE_DR_MaxIndex (35UL) /*!< Max index of DR[36] array.                                          */
  #define MSPI_CONTROLLERCORE_CORE_DR_MinIndex (0UL) /*!< Min index of DR[36] array.                                           */
  #define MSPI_CONTROLLERCORE_CORE_DR_ResetValue (0x00000000UL) /*!< Reset value of DR[36] register.                           */

