NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* TMOD @Bits 10..11 : Transfer Mode. */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_Pos (10UL) /*!< Position of TMOD field.                                         */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_Msk (0x3UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_Pos) /*!< Bit mask of TMOD
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_Min (0x0UL) /*!< Min enumerator value of TMOD field.                            */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_Max (0x3UL) /*!< Max enumerator value of TMOD field.                            */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_TX_AND_RX (0x0UL) /*!< Transmit & Receive; Not Applicable in enhanced SPI
                                                                      operating mode or when SSIC_HAS_TX_RX_EN is set to 0*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_TX_ONLY (0x1UL) /*!< Transmit only mode; Or Write in enhanced SPI operating mode*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_RX_ONLY (0x2UL) /*!< Receive only mode; Or Read in enhanced SPI operating mode  */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_TMOD_EEPROM_READ (0x3UL) /*!< EEPROM Read mode; Not Applicable in enhanced SPI
                                                                        operating mode*/

/* SLVOE @Bit 12 : Target Output Enable. */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_Pos (12UL) /*!< Position of SLVOE field.                                       */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_Pos) /*!< Bit mask of SLVOE
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_Min (0x0UL) /*!< Min enumerator value of SLVOE field.                          */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_Max (0x1UL) /*!< Max enumerator value of SLVOE field.                          */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_ENABLED (0x0UL) /*!< Target Output is enabled                                  */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SLVOE_DISABLED (0x1UL) /*!< Target Output is disabled                                */

/* SRL @Bit 13 : Shift Register Loop. */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_Pos (13UL) /*!< Position of SRL field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_Pos) /*!< Bit mask of SRL
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_Min (0x0UL) /*!< Min enumerator value of SRL field.                              */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_Max (0x1UL) /*!< Max enumerator value of SRL field.                              */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_NORMAL_MODE (0x0UL) /*!< Normal mode operation                                   */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SRL_TESTING_MODE (0x1UL) /*!< Test Mode Operation                                    */

/* SSTE @Bit 14 : Target Select Toggle Enable. */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_Pos (14UL) /*!< Position of SSTE field.                                         */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_Pos) /*!< Bit mask of SSTE
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_Min (0x0UL) /*!< Min enumerator value of SSTE field.                            */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_Max (0x1UL) /*!< Max enumerator value of SSTE field.                            */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_TOGGLE_DISABLE (0x0UL) /*!< ss_*_n will stay low and sclk will run continuously
                                                                           for the duration of the transfer*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_SSTE_TOGGLE_EN (0x1UL) /*!< ss_*_n line will toggle between consecutive data frames,
                                                                      with the serial clock (sclk) being held to its default
                                                                      value while ss_*_n is high*/

/* RSVDCTRLR015 @Bit 15 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR015_Pos (15UL) /*!< Position of RSVDCTRLR015 field.                         */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR015_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR015_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR015 field.*/

/* CFS @Bits 16..19 : Control Frame Size. */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_Pos (16UL) /*!< Position of CFS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_Pos) /*!< Bit mask of CFS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_Min (0x0UL) /*!< Min enumerator value of CFS field.                              */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_Max (0xFUL) /*!< Max enumerator value of CFS field.                              */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_01_BIT (0x0UL) /*!< 01-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_02_BIT (0x1UL) /*!< 02-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_03_BIT (0x2UL) /*!< 03-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_04_BIT (0x3UL) /*!< 04-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_05_BIT (0x4UL) /*!< 05-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_06_BIT (0x5UL) /*!< 06-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_07_BIT (0x6UL) /*!< 07-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_08_BIT (0x7UL) /*!< 08-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_09_BIT (0x8UL) /*!< 09-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_10_BIT (0x9UL) /*!< 10-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_11_BIT (0xAUL) /*!< 11-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_12_BIT (0xBUL) /*!< 12-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_13_BIT (0xCUL) /*!< 13-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_14_BIT (0xDUL) /*!< 14-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_15_BIT (0xEUL) /*!< 15-bit Control Word                                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_CFS_SIZE_16_BIT (0xFUL) /*!< 16-bit Control Word                                     */

/* RSVDCTRLR02021 @Bits 20..21 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR02021_Pos (20UL) /*!< Position of RSVDCTRLR02021 field.                     */
  #define MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR02021_Msk (0x3UL << MSPI_PERIPHERALCORE_CORE_CTRLR0_RSVDCTRLR02021_Pos) /*!<
                                                                            Bit mask of RSVDCTRLR02021 field.*/

