NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MAXWS @Bits 5..8 : Maximum wait cycles allowed per transaction. */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_MAXWS_Pos (5UL) /*!< Position of MAXWS field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_MAXWS_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_MAXWS_Pos) /*!< Bit mask of
                                                                            MAXWS field.*/

/* RSVDSPICTRLR1 @Bits 9..15 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Pos (9UL) /*!< Position of RSVDSPICTRLR1 field.                     */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Msk (0x7FUL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR1 field.*/

/* CSMINHIGH @Bits 16..19 : Chip-Select Minimum HIGH period. */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_CSMINHIGH_Pos (16UL) /*!< Position of CSMINHIGH field.                            */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_CSMINHIGH_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_CSMINHIGH_Pos) /*!< Bit
                                                                            mask of CSMINHIGH field.*/

/* RSVDSPICTRLR12031 @Bits 20..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Pos (20UL) /*!< Position of RSVDSPICTRLR12031 field.            */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Msk (0xFFFUL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR12031 field.*/


/* MSPI_PERIPHERALCORE_CORE_SPITECR: SPI Transmit Error Interrupt Clear Register */
  #define MSPI_PERIPHERALCORE_CORE_SPITECR_ResetValue (0x00000000UL) /*!< Reset value of SPITECR register.                     */

/* SPITECR @Bit 0 : Clear SPI Transmit Error interrupt. */
  #define MSPI_PERIPHERALCORE_CORE_SPITECR_SPITECR_Pos (0UL) /*!< Position of SPITECR field.                                   */
  #define MSPI_PERIPHERALCORE_CORE_SPITECR_SPITECR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPITECR_SPITECR_Pos) /*!< Bit mask of
                                                                            SPITECR field.*/

/* RSVDSPITECR @Bits 1..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPITECR_RSVDSPITECR_Pos (1UL) /*!< Position of RSVDSPITECR field.                           */
  #define MSPI_PERIPHERALCORE_CORE_SPITECR_RSVDSPITECR_Msk (0x7FFFFFFFUL << MSPI_PERIPHERALCORE_CORE_SPITECR_RSVDSPITECR_Pos)
                                                                            /*!< Bit mask of RSVDSPITECR field.*/



/* =============================================== Struct MSPI_PERIPHERALCORE ================================================ */
/**
  * @brief PERIPHERALCORE [MSPI_PERIPHERALCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_MSPI_PERIPHERALCORE_CORE_Type CORE;      /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_MSPI_PERIPHERALCORE_Type;                      /*!< Size = 512 (0x200)                                                   */


/* ================================================ Struct MSPI_XIPCORE_CORE ================================================= */
/**
  * @brief CORE [MSPI_XIPCORE_CORE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLR0;                            /*!< (@ 0x00000000) Control Register 0                                    */
  __IOM uint32_t  CTRLR1;                            /*!< (@ 0x00000004) Control Register 1                                    */
  __IOM uint32_t  SSIENR;                            /*!< (@ 0x00000008) SSI Enable Register                                   */
  __IOM uint32_t  MWCR;                              /*!< (@ 0x0000000C) Microwire Control Register                            */
  __IOM uint32_t  SER;                               /*!< (@ 0x00000010) Target Enable Register                                */
  __IOM uint32_t  BAUDR;                             /*!< (@ 0x00000014) Baud Rate Select                                      */
  __IOM uint32_t  TXFTLR;                            /*!< (@ 0x00000018) Transmit FIFO Threshold Level                         */
  __IOM uint32_t  RXFTLR;                            /*!< (@ 0x0000001C) Receive FIFO Threshold Level                          */
  __IOM uint32_t  TXFLR;                             /*!< (@ 0x00000020) Transmit FIFO Level Register                          */
  __IOM uint32_t  RXFLR;                             /*!< (@ 0x00000024) Receive FIFO Level Register                           */
  __IOM uint32_t  SR;                                /*!< (@ 0x00000028) Status Register                                       */
  __IOM uint32_t  IMR;                               /*!< (@ 0x0000002C) Interrupt Mask Register                               */
  __IOM uint32_t  ISR;                               /*!< (@ 0x00000030) Interrupt Status Register                             */
  __IOM uint32_t  RISR;                              /*!< (@ 0x00000034) Raw Interrupt Status Register                         */
  __IOM uint32_t  TXEICR;                            /*!< (@ 0x00000038) Transmit FIFO Error Interrupt Clear Register Register */
  __IOM uint32_t  RXOICR;                            /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register        */
  __IOM uint32_t  RXUICR;                            /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register       */
  __IOM uint32_t  MSTICR;                            /*!< (@ 0x00000044) Multi-Controller Interrupt Clear Register             */
  __IOM uint32_t  ICR;                               /*!< (@ 0x00000048) Interrupt Clear Register                              */
  __IOM uint32_t  DMACR;                             /*!< (@ 0x0000004C) DMA Control Register                                  */
  __IOM uint32_t  DMATDLR;                           /*!< (@ 0x00000050) DMA Transmit Data Level                               */
  __IOM uint32_t  DMARDLR;                           /*!< (@ 0x00000054) DMA Receive Data Level                                */
  __IOM uint32_t  IDR;                               /*!< (@ 0x00000058) Identification Register                               */
  __IOM uint32_t  SSICVERSIONID;                     /*!< (@ 0x0000005C) MSPI CORE component version                           */
  __IOM uint32_t  DR[36];                            /*!< (@ 0x00000060) MSPI CORE Data Register 0                             */
  __IOM uint32_t  RXSAMPLEDELAY;                     /*!< (@ 0x000000F0) RX Sample Delay Register                              */
  __IOM uint32_t  SPICTRLR0;                         /*!< (@ 0x000000F4) SPI_CTRLR0 - SPI Control Register                     */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  XIPMODEBITS;                       /*!< (@ 0x000000FC) eXecute in Place - Mode bits                          */
  __IOM uint32_t  XIPINCRINST;                       /*!< (@ 0x00000100) XIP_INCR_INST - XIP INCR transfer opcode              */
  __IOM uint32_t  XIPWRAPINST;                       /*!< (@ 0x00000104) XIP_WRAP_INST - XIP WRAP transfer opcode              */
  __IOM uint32_t  XIPCTRL;                           /*!< (@ 0x00000108) XIP_CTRL - XIP Control Register                       */
  __IOM uint32_t  XIPSER;                            /*!< (@ 0x0000010C) XIP Target Enable Register                            */
  __IOM uint32_t  XRXOICR;                           /*!< (@ 0x00000110) XIP Receive FIFO Overflow Interrupt Clear Register    */
  __IOM uint32_t  XIPCNTTIMEOUT;                     /*!< (@ 0x00000114) XIP time out register for continuous transfers        */
  __IOM uint32_t  SPICTRLR1;                         /*!< (@ 0x00000118) SPI Control 1 register                                */
  __IM  uint32_t  RESERVED1[57];
} NRF_MSPI_XIPCORE_CORE_Type;                        /*!< Size = 512 (0x200)                                                   */

/* MSPI_XIPCORE_CORE_CTRLR0: Control Register 0 */
  #define MSPI_XIPCORE_CORE_CTRLR0_ResetValue (0x00000007UL) /*!< Reset value of CTRLR0 register.                              */

