NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MSPI_XIPCORE_CORE_MSTICR: Multi-Controller Interrupt Clear Register */
  #define MSPI_XIPCORE_CORE_MSTICR_ResetValue (0x00000000UL) /*!< Reset value of MSTICR register.                              */

/* MSTICR @Bit 0 : Clear Multi-Controller Contention Interrupt. */
  #define MSPI_XIPCORE_CORE_MSTICR_MSTICR_Pos (0UL)  /*!< Position of MSTICR field.                                            */
  #define MSPI_XIPCORE_CORE_MSTICR_MSTICR_Msk (0x1UL << MSPI_XIPCORE_CORE_MSTICR_MSTICR_Pos) /*!< Bit mask of MSTICR field.    */

/* RSVDMSTICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_MSTICR_RSVDMSTICR_Pos (1UL) /*!< Position of RSVDMSTICR field.                                     */
  #define MSPI_XIPCORE_CORE_MSTICR_RSVDMSTICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_MSTICR_RSVDMSTICR_Pos) /*!< Bit mask of
                                                                            RSVDMSTICR field.*/


/* MSPI_XIPCORE_CORE_ICR: Interrupt Clear Register */
  #define MSPI_XIPCORE_CORE_ICR_ResetValue (0x00000000UL) /*!< Reset value of ICR register.                                    */

/* ICR @Bit 0 : Clear Interrupts. */
  #define MSPI_XIPCORE_CORE_ICR_ICR_Pos (0UL)        /*!< Position of ICR field.                                               */
  #define MSPI_XIPCORE_CORE_ICR_ICR_Msk (0x1UL << MSPI_XIPCORE_CORE_ICR_ICR_Pos) /*!< Bit mask of ICR field.                   */

/* RSVDICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_ICR_RSVDICR_Pos (1UL)    /*!< Position of RSVDICR field.                                           */
  #define MSPI_XIPCORE_CORE_ICR_RSVDICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_ICR_RSVDICR_Pos) /*!< Bit mask of RSVDICR field.*/


/* MSPI_XIPCORE_CORE_DMACR: DMA Control Register */
  #define MSPI_XIPCORE_CORE_DMACR_ResetValue (0x00000000UL) /*!< Reset value of DMACR register.                                */

/* RDMAE @Bit 0 : Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_Pos (0UL)    /*!< Position of RDMAE field.                                             */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_RDMAE_Pos) /*!< Bit mask of RDMAE field.         */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_Min (0x0UL)  /*!< Min enumerator value of RDMAE field.                                 */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_Max (0x1UL)  /*!< Max enumerator value of RDMAE field.                                 */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_DISABLE (0x0UL) /*!< Receive DMA disabled                                              */
  #define MSPI_XIPCORE_CORE_DMACR_RDMAE_ENABLED (0x1UL) /*!< Receive DMA enabled                                               */

/* TDMAE @Bit 1 : Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_Pos (1UL)    /*!< Position of TDMAE field.                                             */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_TDMAE_Pos) /*!< Bit mask of TDMAE field.         */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_Min (0x0UL)  /*!< Min enumerator value of TDMAE field.                                 */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_Max (0x1UL)  /*!< Max enumerator value of TDMAE field.                                 */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_DISABLE (0x0UL) /*!< Transmit DMA disabled                                             */
  #define MSPI_XIPCORE_CORE_DMACR_TDMAE_ENABLED (0x1UL) /*!< Transmit DMA enabled                                              */

/* RSVDDMACR2 @Bit 2 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR2_Pos (2UL) /*!< Position of RSVDDMACR2 field.                                      */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR2_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR2_Pos) /*!< Bit mask of RSVDDMACR2
                                                                            field.*/

/* RSVDDMACR34 @Bits 3..4 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR34_Pos (3UL) /*!< Position of RSVDDMACR34 field.                                    */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR34_Msk (0x3UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR34_Pos) /*!< Bit mask of
                                                                            RSVDDMACR34 field.*/

/* RSVDDMACR5 @Bit 5 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR5_Pos (5UL) /*!< Position of RSVDDMACR5 field.                                      */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR5_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR5_Pos) /*!< Bit mask of RSVDDMACR5
                                                                            field.*/

/* RSVDDMACR6 @Bit 6 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR6_Pos (6UL) /*!< Position of RSVDDMACR6 field.                                      */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR6_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR6_Pos) /*!< Bit mask of RSVDDMACR6
                                                                            field.*/

/* RSVDDMACR7 @Bit 7 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR7_Pos (7UL) /*!< Position of RSVDDMACR7 field.                                      */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR7_Msk (0x1UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR7_Pos) /*!< Bit mask of RSVDDMACR7
                                                                            field.*/

/* RSVDDMACR811 @Bits 8..11 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR811_Pos (8UL) /*!< Position of RSVDDMACR811 field.                                  */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR811_Msk (0xFUL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR811_Pos) /*!< Bit mask of
                                                                            RSVDDMACR811 field.*/

/* RSVDDMACR1214 @Bits 12..14 : (unspecified) */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR1214_Pos (12UL) /*!< Position of RSVDDMACR1214 field.                               */
  #define MSPI_XIPCORE_CORE_DMACR_RSVDDMACR1214_Msk (0x7UL << MSPI_XIPCORE_CORE_DMACR_RSVDDMACR1214_Pos) /*!< Bit mask of
                                                                            RSVDDMACR1214 field.*/

