NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* RSVDINCRINST @Bits 16..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPINCRINST_RSVDINCRINST_Pos (16UL) /*!< Position of RSVDINCRINST field.                           */
  #define MSPI_XIPCORE_CORE_XIPINCRINST_RSVDINCRINST_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPINCRINST_RSVDINCRINST_Pos) /*!< Bit
                                                                            mask of RSVDINCRINST field.*/


/* MSPI_XIPCORE_CORE_XIPWRAPINST: XIP_WRAP_INST - XIP WRAP transfer opcode */
  #define MSPI_XIPCORE_CORE_XIPWRAPINST_ResetValue (0x00000000UL) /*!< Reset value of XIPWRAPINST register.                    */

/* WRAPINST @Bits 0..15 : XIP WRAP transfer opcode. */
  #define MSPI_XIPCORE_CORE_XIPWRAPINST_WRAPINST_Pos (0UL) /*!< Position of WRAPINST field.                                    */
  #define MSPI_XIPCORE_CORE_XIPWRAPINST_WRAPINST_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPWRAPINST_WRAPINST_Pos) /*!< Bit mask of
                                                                            WRAPINST field.*/

/* RSVDWRAPINST @Bits 16..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPWRAPINST_RSVDWRAPINST_Pos (16UL) /*!< Position of RSVDWRAPINST field.                           */
  #define MSPI_XIPCORE_CORE_XIPWRAPINST_RSVDWRAPINST_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPWRAPINST_RSVDWRAPINST_Pos) /*!< Bit
                                                                            mask of RSVDWRAPINST field.*/


/* MSPI_XIPCORE_CORE_XIPCTRL: XIP_CTRL - XIP Control Register */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ResetValue (0x08000400UL) /*!< Reset value of XIPCTRL register.                            */

/* FRF @Bits 0..1 : SPI Frame Format */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_Pos (0UL)    /*!< Position of FRF field.                                               */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_Msk (0x3UL << MSPI_XIPCORE_CORE_XIPCTRL_FRF_Pos) /*!< Bit mask of FRF field.           */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_Min (0x0UL)  /*!< Min enumerator value of FRF field.                                   */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_Max (0x3UL)  /*!< Max enumerator value of FRF field.                                   */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_SPI_STANDARD (0x0UL) /*!< Standard SPI Format                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_SPI_DUAL (0x1UL) /*!< Dual SPI Format                                                  */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_SPI_QUAD (0x2UL) /*!< Quad SPI Format                                                  */
  #define MSPI_XIPCORE_CORE_XIPCTRL_FRF_SPI_OCTAL (0x3UL) /*!< Octal SPI Format                                                */

/* TRANSTYPE @Bits 2..3 : Address and instruction transfer format. */
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_Pos (2UL) /*!< Position of TRANSTYPE field.                                      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_Msk (0x3UL << MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_Pos) /*!< Bit mask of TRANSTYPE
                                                                            field.*/
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.                        */
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.                        */
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_TT0 (0x0UL) /*!< Instruction and Address will be sent in Standard SPI Mode.      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_TT1 (0x1UL) /*!< Instruction will be sent in Standard SPI Mode and Address will be
                                                               sent in the mode specified by XIP_CTRL.SPI_FRF.*/
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_TT2 (0x2UL) /*!< Both Instruction and Address will be sent in the mode specified
                                                               by XIP_CTRL.SPI_FRF.*/
  #define MSPI_XIPCORE_CORE_XIPCTRL_TRANSTYPE_TT3 (0x3UL) /*!< Dual Octal mode, the address and instruction are transferred in
                                                               octal mode and data is transferred on 16 data lines.*/

/* ADDRL @Bits 4..7 : This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the
                      FIFO the transfer can begin. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_Pos (4UL)  /*!< Position of ADDRL field.                                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_Msk (0xFUL << MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_Pos) /*!< Bit mask of ADDRL field.     */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                                */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                                */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L0 (0x0UL) /*!< No Address                                                      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L4 (0x1UL) /*!< 4 bit Address length                                            */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L8 (0x2UL) /*!< 8 bit Address length                                            */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L12 (0x3UL) /*!< 12 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L16 (0x4UL) /*!< 16 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L20 (0x5UL) /*!< 20 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L24 (0x6UL) /*!< 24 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L28 (0x7UL) /*!< 28 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L32 (0x8UL) /*!< 32 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L36 (0x9UL) /*!< 36 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L40 (0xAUL) /*!< 40 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L44 (0xBUL) /*!< 44 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L48 (0xCUL) /*!< 48 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L52 (0xDUL) /*!< 52 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L56 (0xEUL) /*!< 56 bit Address length                                          */
  #define MSPI_XIPCORE_CORE_XIPCTRL_ADDRL_ADDR_L60 (0xFUL) /*!< 60 bit Address length                                          */

