NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MSPI_EVENTS_OVERFLOW: The MSPI peripheral has received the specified number of bytes. Any data received after this event will
                          be discarded if a new RX buffer has not been configured. This event is exclusive to the 'peripheral'
                          configuration */

  #define MSPI_EVENTS_OVERFLOW_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_OVERFLOW register.                         */

/* EVENTS_OVERFLOW @Bit 0 : The MSPI peripheral has received the specified number of bytes. Any data received after this event
                            will be discarded if a new RX buffer has not been configured. This event is exclusive to the
                            'peripheral' configuration */

  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Pos (0UL) /*!< Position of EVENTS_OVERFLOW field.                               */
  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Msk (0x1UL << MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Pos) /*!< Bit mask of
                                                                            EVENTS_OVERFLOW field.*/
  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Min (0x0UL) /*!< Min enumerator value of EVENTS_OVERFLOW field.                 */
  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Max (0x1UL) /*!< Max enumerator value of EVENTS_OVERFLOW field.                 */
  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define MSPI_EVENTS_OVERFLOW_EVENTS_OVERFLOW_Generated (0x1UL) /*!< Event generated                                          */


/* MSPI_EVENTS_ACQUIRED: The semaphore has been acquired by the CPU This event is exclusive to the 'peripheral' configuration */
  #define MSPI_EVENTS_ACQUIRED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQUIRED register.                         */

/* EVENTS_ACQUIRED @Bit 0 : The semaphore has been acquired by the CPU This event is exclusive to the 'peripheral' configuration
                            */

  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos (0UL) /*!< Position of EVENTS_ACQUIRED field.                               */
  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Msk (0x1UL << MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos) /*!< Bit mask of
                                                                            EVENTS_ACQUIRED field.*/
  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQUIRED field.                 */
  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQUIRED field.                 */
  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define MSPI_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Generated (0x1UL) /*!< Event generated                                          */


/* MSPI_SHORTS: Shortcuts between local events and tasks */
  #define MSPI_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* DMA_DONE_START @Bit 0 : Shortcut between event DMA.DONE and task START */
  #define MSPI_SHORTS_DMA_DONE_START_Pos (0UL)       /*!< Position of DMA_DONE_START field.                                    */
  #define MSPI_SHORTS_DMA_DONE_START_Msk (0x1UL << MSPI_SHORTS_DMA_DONE_START_Pos) /*!< Bit mask of DMA_DONE_START field.      */
  #define MSPI_SHORTS_DMA_DONE_START_Min (0x0UL)     /*!< Min enumerator value of DMA_DONE_START field.                        */
  #define MSPI_SHORTS_DMA_DONE_START_Max (0x1UL)     /*!< Max enumerator value of DMA_DONE_START field.                        */
  #define MSPI_SHORTS_DMA_DONE_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define MSPI_SHORTS_DMA_DONE_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* DMA_DONE_ACQUIRESEMAPHORE @Bit 1 : Shortcut between event DMA.DONE and task ACQUIRESEMAPHORE */
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Pos (1UL) /*!< Position of DMA_DONE_ACQUIRESEMAPHORE field.                    */
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Msk (0x1UL << MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Pos) /*!< Bit mask of
                                                                            DMA_DONE_ACQUIRESEMAPHORE field.*/
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Min (0x0UL) /*!< Min enumerator value of DMA_DONE_ACQUIRESEMAPHORE field.      */
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Max (0x1UL) /*!< Max enumerator value of DMA_DONE_ACQUIRESEMAPHORE field.      */
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Disabled (0x0UL) /*!< Disable shortcut                                         */
  #define MSPI_SHORTS_DMA_DONE_ACQUIRESEMAPHORE_Enabled (0x1UL) /*!< Enable shortcut                                           */


/* MSPI_INTEN: Enable or disable interrupt */
  #define MSPI_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define MSPI_INTEN_CORE_Pos (0UL)                  /*!< Position of CORE field.                                              */
  #define MSPI_INTEN_CORE_Msk (0x1UL << MSPI_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                      */
  #define MSPI_INTEN_CORE_Min (0x0UL)                /*!< Min enumerator value of CORE field.                                  */
  #define MSPI_INTEN_CORE_Max (0x1UL)                /*!< Max enumerator value of CORE field.                                  */
  #define MSPI_INTEN_CORE_Disabled (0x0UL)           /*!< Disable                                                              */
  #define MSPI_INTEN_CORE_Enabled (0x1UL)            /*!< Enable                                                               */

/* DMADONELIST @Bit 1 : Enable or disable interrupt for event DMADONELIST */
  #define MSPI_INTEN_DMADONELIST_Pos (1UL)           /*!< Position of DMADONELIST field.                                       */
  #define MSPI_INTEN_DMADONELIST_Msk (0x1UL << MSPI_INTEN_DMADONELIST_Pos) /*!< Bit mask of DMADONELIST field.                 */
  #define MSPI_INTEN_DMADONELIST_Min (0x0UL)         /*!< Min enumerator value of DMADONELIST field.                           */
  #define MSPI_INTEN_DMADONELIST_Max (0x1UL)         /*!< Max enumerator value of DMADONELIST field.                           */
  #define MSPI_INTEN_DMADONELIST_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MSPI_INTEN_DMADONELIST_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMADONELISTPART @Bit 2 : Enable or disable interrupt for event DMADONELISTPART */
  #define MSPI_INTEN_DMADONELISTPART_Pos (2UL)       /*!< Position of DMADONELISTPART field.                                   */
  #define MSPI_INTEN_DMADONELISTPART_Msk (0x1UL << MSPI_INTEN_DMADONELISTPART_Pos) /*!< Bit mask of DMADONELISTPART field.     */
  #define MSPI_INTEN_DMADONELISTPART_Min (0x0UL)     /*!< Min enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTEN_DMADONELISTPART_Max (0x1UL)     /*!< Max enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTEN_DMADONELISTPART_Disabled (0x0UL) /*!< Disable                                                             */
  #define MSPI_INTEN_DMADONELISTPART_Enabled (0x1UL) /*!< Enable                                                               */

