NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* DMADONESELECTJOB @Bit 3 : Enable or disable interrupt for event DMADONESELECTJOB */
  #define MSPI_INTEN_DMADONESELECTJOB_Pos (3UL)      /*!< Position of DMADONESELECTJOB field.                                  */
  #define MSPI_INTEN_DMADONESELECTJOB_Msk (0x1UL << MSPI_INTEN_DMADONESELECTJOB_Pos) /*!< Bit mask of DMADONESELECTJOB field.  */
  #define MSPI_INTEN_DMADONESELECTJOB_Min (0x0UL)    /*!< Min enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTEN_DMADONESELECTJOB_Max (0x1UL)    /*!< Max enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTEN_DMADONESELECTJOB_Disabled (0x0UL) /*!< Disable                                                            */
  #define MSPI_INTEN_DMADONESELECTJOB_Enabled (0x1UL) /*!< Enable                                                              */

/* DMADONEDATA @Bit 4 : Enable or disable interrupt for event DMADONEDATA */
  #define MSPI_INTEN_DMADONEDATA_Pos (4UL)           /*!< Position of DMADONEDATA field.                                       */
  #define MSPI_INTEN_DMADONEDATA_Msk (0x1UL << MSPI_INTEN_DMADONEDATA_Pos) /*!< Bit mask of DMADONEDATA field.                 */
  #define MSPI_INTEN_DMADONEDATA_Min (0x0UL)         /*!< Min enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTEN_DMADONEDATA_Max (0x1UL)         /*!< Max enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTEN_DMADONEDATA_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MSPI_INTEN_DMADONEDATA_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMADONEJOB @Bit 5 : Enable or disable interrupt for event DMADONEJOB */
  #define MSPI_INTEN_DMADONEJOB_Pos (5UL)            /*!< Position of DMADONEJOB field.                                        */
  #define MSPI_INTEN_DMADONEJOB_Msk (0x1UL << MSPI_INTEN_DMADONEJOB_Pos) /*!< Bit mask of DMADONEJOB field.                    */
  #define MSPI_INTEN_DMADONEJOB_Min (0x0UL)          /*!< Min enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTEN_DMADONEJOB_Max (0x1UL)          /*!< Max enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTEN_DMADONEJOB_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MSPI_INTEN_DMADONEJOB_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMAERROR @Bit 6 : Enable or disable interrupt for event DMAERROR */
  #define MSPI_INTEN_DMAERROR_Pos (6UL)              /*!< Position of DMAERROR field.                                          */
  #define MSPI_INTEN_DMAERROR_Msk (0x1UL << MSPI_INTEN_DMAERROR_Pos) /*!< Bit mask of DMAERROR field.                          */
  #define MSPI_INTEN_DMAERROR_Min (0x0UL)            /*!< Min enumerator value of DMAERROR field.                              */
  #define MSPI_INTEN_DMAERROR_Max (0x1UL)            /*!< Max enumerator value of DMAERROR field.                              */
  #define MSPI_INTEN_DMAERROR_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MSPI_INTEN_DMAERROR_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMAPAUSED @Bit 7 : Enable or disable interrupt for event DMAPAUSED */
  #define MSPI_INTEN_DMAPAUSED_Pos (7UL)             /*!< Position of DMAPAUSED field.                                         */
  #define MSPI_INTEN_DMAPAUSED_Msk (0x1UL << MSPI_INTEN_DMAPAUSED_Pos) /*!< Bit mask of DMAPAUSED field.                       */
  #define MSPI_INTEN_DMAPAUSED_Min (0x0UL)           /*!< Min enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTEN_DMAPAUSED_Max (0x1UL)           /*!< Max enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTEN_DMAPAUSED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define MSPI_INTEN_DMAPAUSED_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMARESET @Bit 8 : Enable or disable interrupt for event DMARESET */
  #define MSPI_INTEN_DMARESET_Pos (8UL)              /*!< Position of DMARESET field.                                          */
  #define MSPI_INTEN_DMARESET_Msk (0x1UL << MSPI_INTEN_DMARESET_Pos) /*!< Bit mask of DMARESET field.                          */
  #define MSPI_INTEN_DMARESET_Min (0x0UL)            /*!< Min enumerator value of DMARESET field.                              */
  #define MSPI_INTEN_DMARESET_Max (0x1UL)            /*!< Max enumerator value of DMARESET field.                              */
  #define MSPI_INTEN_DMARESET_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MSPI_INTEN_DMARESET_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMADONE @Bit 9 : Enable or disable interrupt for event DMADONE */
  #define MSPI_INTEN_DMADONE_Pos (9UL)               /*!< Position of DMADONE field.                                           */
  #define MSPI_INTEN_DMADONE_Msk (0x1UL << MSPI_INTEN_DMADONE_Pos) /*!< Bit mask of DMADONE field.                             */
  #define MSPI_INTEN_DMADONE_Min (0x0UL)             /*!< Min enumerator value of DMADONE field.                               */
  #define MSPI_INTEN_DMADONE_Max (0x1UL)             /*!< Max enumerator value of DMADONE field.                               */
  #define MSPI_INTEN_DMADONE_Disabled (0x0UL)        /*!< Disable                                                              */
  #define MSPI_INTEN_DMADONE_Enabled (0x1UL)         /*!< Enable                                                               */

/* DMATXUNEXPECTEDIDLE @Bit 10 : Enable or disable interrupt for event DMATXUNEXPECTEDIDLE */
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Pos (10UL)  /*!< Position of DMATXUNEXPECTEDIDLE field.                               */
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_INTEN_DMATXUNEXPECTEDIDLE_Pos) /*!< Bit mask of DMATXUNEXPECTEDIDLE
                                                                            field.*/
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of DMATXUNEXPECTEDIDLE field.                   */
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of DMATXUNEXPECTEDIDLE field.                   */
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Disabled (0x0UL) /*!< Disable                                                         */
  #define MSPI_INTEN_DMATXUNEXPECTEDIDLE_Enabled (0x1UL) /*!< Enable                                                           */

/* DMAINTERNALBUSERROR @Bit 11 : Enable or disable interrupt for event DMAINTERNALBUSERROR */
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Pos (11UL)  /*!< Position of DMAINTERNALBUSERROR field.                               */
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Msk (0x1UL << MSPI_INTEN_DMAINTERNALBUSERROR_Pos) /*!< Bit mask of DMAINTERNALBUSERROR
                                                                            field.*/
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of DMAINTERNALBUSERROR field.                   */
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of DMAINTERNALBUSERROR field.                   */
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Disabled (0x0UL) /*!< Disable                                                         */
  #define MSPI_INTEN_DMAINTERNALBUSERROR_Enabled (0x1UL) /*!< Enable                                                           */

/* DMAABORTED @Bit 12 : Enable or disable interrupt for event DMAABORTED */
  #define MSPI_INTEN_DMAABORTED_Pos (12UL)           /*!< Position of DMAABORTED field.                                        */
  #define MSPI_INTEN_DMAABORTED_Msk (0x1UL << MSPI_INTEN_DMAABORTED_Pos) /*!< Bit mask of DMAABORTED field.                    */
  #define MSPI_INTEN_DMAABORTED_Min (0x0UL)          /*!< Min enumerator value of DMAABORTED field.                            */
  #define MSPI_INTEN_DMAABORTED_Max (0x1UL)          /*!< Max enumerator value of DMAABORTED field.                            */
  #define MSPI_INTEN_DMAABORTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MSPI_INTEN_DMAABORTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* IDLE @Bit 13 : Enable or disable interrupt for event IDLE */
  #define MSPI_INTEN_IDLE_Pos (13UL)                 /*!< Position of IDLE field.                                              */
  #define MSPI_INTEN_IDLE_Msk (0x1UL << MSPI_INTEN_IDLE_Pos) /*!< Bit mask of IDLE field.                                      */
  #define MSPI_INTEN_IDLE_Min (0x0UL)                /*!< Min enumerator value of IDLE field.                                  */
  #define MSPI_INTEN_IDLE_Max (0x1UL)                /*!< Max enumerator value of IDLE field.                                  */
  #define MSPI_INTEN_IDLE_Disabled (0x0UL)           /*!< Disable                                                              */
  #define MSPI_INTEN_IDLE_Enabled (0x1UL)            /*!< Enable                                                               */

