NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* OVERFLOW @Bit 14 : Enable or disable interrupt for event OVERFLOW */
  #define MSPI_INTEN_OVERFLOW_Pos (14UL)             /*!< Position of OVERFLOW field.                                          */
  #define MSPI_INTEN_OVERFLOW_Msk (0x1UL << MSPI_INTEN_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                          */
  #define MSPI_INTEN_OVERFLOW_Min (0x0UL)            /*!< Min enumerator value of OVERFLOW field.                              */
  #define MSPI_INTEN_OVERFLOW_Max (0x1UL)            /*!< Max enumerator value of OVERFLOW field.                              */
  #define MSPI_INTEN_OVERFLOW_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MSPI_INTEN_OVERFLOW_Enabled (0x1UL)        /*!< Enable                                                               */

/* ACQUIRED @Bit 16 : Enable or disable interrupt for event ACQUIRED */
  #define MSPI_INTEN_ACQUIRED_Pos (16UL)             /*!< Position of ACQUIRED field.                                          */
  #define MSPI_INTEN_ACQUIRED_Msk (0x1UL << MSPI_INTEN_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                          */
  #define MSPI_INTEN_ACQUIRED_Min (0x0UL)            /*!< Min enumerator value of ACQUIRED field.                              */
  #define MSPI_INTEN_ACQUIRED_Max (0x1UL)            /*!< Max enumerator value of ACQUIRED field.                              */
  #define MSPI_INTEN_ACQUIRED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MSPI_INTEN_ACQUIRED_Enabled (0x1UL)        /*!< Enable                                                               */


/* MSPI_INTENSET: Enable interrupt */
  #define MSPI_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define MSPI_INTENSET_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define MSPI_INTENSET_CORE_Msk (0x1UL << MSPI_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define MSPI_INTENSET_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define MSPI_INTENSET_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define MSPI_INTENSET_CORE_Set (0x1UL)             /*!< Enable                                                               */
  #define MSPI_INTENSET_CORE_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_CORE_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* DMADONELIST @Bit 1 : Write '1' to enable interrupt for event DMADONELIST */
  #define MSPI_INTENSET_DMADONELIST_Pos (1UL)        /*!< Position of DMADONELIST field.                                       */
  #define MSPI_INTENSET_DMADONELIST_Msk (0x1UL << MSPI_INTENSET_DMADONELIST_Pos) /*!< Bit mask of DMADONELIST field.           */
  #define MSPI_INTENSET_DMADONELIST_Min (0x0UL)      /*!< Min enumerator value of DMADONELIST field.                           */
  #define MSPI_INTENSET_DMADONELIST_Max (0x1UL)      /*!< Max enumerator value of DMADONELIST field.                           */
  #define MSPI_INTENSET_DMADONELIST_Set (0x1UL)      /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONELIST_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMADONELIST_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMADONELISTPART @Bit 2 : Write '1' to enable interrupt for event DMADONELISTPART */
  #define MSPI_INTENSET_DMADONELISTPART_Pos (2UL)    /*!< Position of DMADONELISTPART field.                                   */
  #define MSPI_INTENSET_DMADONELISTPART_Msk (0x1UL << MSPI_INTENSET_DMADONELISTPART_Pos) /*!< Bit mask of DMADONELISTPART
                                                                            field.*/
  #define MSPI_INTENSET_DMADONELISTPART_Min (0x0UL)  /*!< Min enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTENSET_DMADONELISTPART_Max (0x1UL)  /*!< Max enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTENSET_DMADONELISTPART_Set (0x1UL)  /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONELISTPART_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MSPI_INTENSET_DMADONELISTPART_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* DMADONESELECTJOB @Bit 3 : Write '1' to enable interrupt for event DMADONESELECTJOB */
  #define MSPI_INTENSET_DMADONESELECTJOB_Pos (3UL)   /*!< Position of DMADONESELECTJOB field.                                  */
  #define MSPI_INTENSET_DMADONESELECTJOB_Msk (0x1UL << MSPI_INTENSET_DMADONESELECTJOB_Pos) /*!< Bit mask of DMADONESELECTJOB
                                                                            field.*/
  #define MSPI_INTENSET_DMADONESELECTJOB_Min (0x0UL) /*!< Min enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTENSET_DMADONESELECTJOB_Max (0x1UL) /*!< Max enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTENSET_DMADONESELECTJOB_Set (0x1UL) /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONESELECTJOB_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define MSPI_INTENSET_DMADONESELECTJOB_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMADONEDATA @Bit 4 : Write '1' to enable interrupt for event DMADONEDATA */
  #define MSPI_INTENSET_DMADONEDATA_Pos (4UL)        /*!< Position of DMADONEDATA field.                                       */
  #define MSPI_INTENSET_DMADONEDATA_Msk (0x1UL << MSPI_INTENSET_DMADONEDATA_Pos) /*!< Bit mask of DMADONEDATA field.           */
  #define MSPI_INTENSET_DMADONEDATA_Min (0x0UL)      /*!< Min enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTENSET_DMADONEDATA_Max (0x1UL)      /*!< Max enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTENSET_DMADONEDATA_Set (0x1UL)      /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONEDATA_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMADONEDATA_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMADONEJOB @Bit 5 : Write '1' to enable interrupt for event DMADONEJOB */
  #define MSPI_INTENSET_DMADONEJOB_Pos (5UL)         /*!< Position of DMADONEJOB field.                                        */
  #define MSPI_INTENSET_DMADONEJOB_Msk (0x1UL << MSPI_INTENSET_DMADONEJOB_Pos) /*!< Bit mask of DMADONEJOB field.              */
  #define MSPI_INTENSET_DMADONEJOB_Min (0x0UL)       /*!< Min enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTENSET_DMADONEJOB_Max (0x1UL)       /*!< Max enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTENSET_DMADONEJOB_Set (0x1UL)       /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONEJOB_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMADONEJOB_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMAERROR @Bit 6 : Write '1' to enable interrupt for event DMAERROR */
  #define MSPI_INTENSET_DMAERROR_Pos (6UL)           /*!< Position of DMAERROR field.                                          */
  #define MSPI_INTENSET_DMAERROR_Msk (0x1UL << MSPI_INTENSET_DMAERROR_Pos) /*!< Bit mask of DMAERROR field.                    */
  #define MSPI_INTENSET_DMAERROR_Min (0x0UL)         /*!< Min enumerator value of DMAERROR field.                              */
  #define MSPI_INTENSET_DMAERROR_Max (0x1UL)         /*!< Max enumerator value of DMAERROR field.                              */
  #define MSPI_INTENSET_DMAERROR_Set (0x1UL)         /*!< Enable                                                               */
  #define MSPI_INTENSET_DMAERROR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMAERROR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMAPAUSED @Bit 7 : Write '1' to enable interrupt for event DMAPAUSED */
  #define MSPI_INTENSET_DMAPAUSED_Pos (7UL)          /*!< Position of DMAPAUSED field.                                         */
  #define MSPI_INTENSET_DMAPAUSED_Msk (0x1UL << MSPI_INTENSET_DMAPAUSED_Pos) /*!< Bit mask of DMAPAUSED field.                 */
  #define MSPI_INTENSET_DMAPAUSED_Min (0x0UL)        /*!< Min enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTENSET_DMAPAUSED_Max (0x1UL)        /*!< Max enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTENSET_DMAPAUSED_Set (0x1UL)        /*!< Enable                                                               */
  #define MSPI_INTENSET_DMAPAUSED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMAPAUSED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMARESET @Bit 8 : Write '1' to enable interrupt for event DMARESET */
  #define MSPI_INTENSET_DMARESET_Pos (8UL)           /*!< Position of DMARESET field.                                          */
  #define MSPI_INTENSET_DMARESET_Msk (0x1UL << MSPI_INTENSET_DMARESET_Pos) /*!< Bit mask of DMARESET field.                    */
  #define MSPI_INTENSET_DMARESET_Min (0x0UL)         /*!< Min enumerator value of DMARESET field.                              */
  #define MSPI_INTENSET_DMARESET_Max (0x1UL)         /*!< Max enumerator value of DMARESET field.                              */
  #define MSPI_INTENSET_DMARESET_Set (0x1UL)         /*!< Enable                                                               */
  #define MSPI_INTENSET_DMARESET_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMARESET_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMADONE @Bit 9 : Write '1' to enable interrupt for event DMADONE */
  #define MSPI_INTENSET_DMADONE_Pos (9UL)            /*!< Position of DMADONE field.                                           */
  #define MSPI_INTENSET_DMADONE_Msk (0x1UL << MSPI_INTENSET_DMADONE_Pos) /*!< Bit mask of DMADONE field.                       */
  #define MSPI_INTENSET_DMADONE_Min (0x0UL)          /*!< Min enumerator value of DMADONE field.                               */
  #define MSPI_INTENSET_DMADONE_Max (0x1UL)          /*!< Max enumerator value of DMADONE field.                               */
  #define MSPI_INTENSET_DMADONE_Set (0x1UL)          /*!< Enable                                                               */
  #define MSPI_INTENSET_DMADONE_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMADONE_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMATXUNEXPECTEDIDLE @Bit 10 : Write '1' to enable interrupt for event DMATXUNEXPECTEDIDLE */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Pos (10UL) /*!< Position of DMATXUNEXPECTEDIDLE field.                             */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Pos) /*!< Bit mask of
                                                                            DMATXUNEXPECTEDIDLE field.*/
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of DMATXUNEXPECTEDIDLE field.                */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of DMATXUNEXPECTEDIDLE field.                */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Set (0x1UL) /*!< Enable                                                            */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define MSPI_INTENSET_DMATXUNEXPECTEDIDLE_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* DMAINTERNALBUSERROR @Bit 11 : Write '1' to enable interrupt for event DMAINTERNALBUSERROR */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Pos (11UL) /*!< Position of DMAINTERNALBUSERROR field.                             */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Msk (0x1UL << MSPI_INTENSET_DMAINTERNALBUSERROR_Pos) /*!< Bit mask of
                                                                            DMAINTERNALBUSERROR field.*/
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of DMAINTERNALBUSERROR field.                */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of DMAINTERNALBUSERROR field.                */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Set (0x1UL) /*!< Enable                                                            */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define MSPI_INTENSET_DMAINTERNALBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* DMAABORTED @Bit 12 : Write '1' to enable interrupt for event DMAABORTED */
  #define MSPI_INTENSET_DMAABORTED_Pos (12UL)        /*!< Position of DMAABORTED field.                                        */
  #define MSPI_INTENSET_DMAABORTED_Msk (0x1UL << MSPI_INTENSET_DMAABORTED_Pos) /*!< Bit mask of DMAABORTED field.              */
  #define MSPI_INTENSET_DMAABORTED_Min (0x0UL)       /*!< Min enumerator value of DMAABORTED field.                            */
  #define MSPI_INTENSET_DMAABORTED_Max (0x1UL)       /*!< Max enumerator value of DMAABORTED field.                            */
  #define MSPI_INTENSET_DMAABORTED_Set (0x1UL)       /*!< Enable                                                               */
  #define MSPI_INTENSET_DMAABORTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_DMAABORTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* IDLE @Bit 13 : Write '1' to enable interrupt for event IDLE */
  #define MSPI_INTENSET_IDLE_Pos (13UL)              /*!< Position of IDLE field.                                              */
  #define MSPI_INTENSET_IDLE_Msk (0x1UL << MSPI_INTENSET_IDLE_Pos) /*!< Bit mask of IDLE field.                                */
  #define MSPI_INTENSET_IDLE_Min (0x0UL)             /*!< Min enumerator value of IDLE field.                                  */
  #define MSPI_INTENSET_IDLE_Max (0x1UL)             /*!< Max enumerator value of IDLE field.                                  */
  #define MSPI_INTENSET_IDLE_Set (0x1UL)             /*!< Enable                                                               */
  #define MSPI_INTENSET_IDLE_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_IDLE_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* OVERFLOW @Bit 14 : Write '1' to enable interrupt for event OVERFLOW */
  #define MSPI_INTENSET_OVERFLOW_Pos (14UL)          /*!< Position of OVERFLOW field.                                          */
  #define MSPI_INTENSET_OVERFLOW_Msk (0x1UL << MSPI_INTENSET_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                    */
  #define MSPI_INTENSET_OVERFLOW_Min (0x0UL)         /*!< Min enumerator value of OVERFLOW field.                              */
  #define MSPI_INTENSET_OVERFLOW_Max (0x1UL)         /*!< Max enumerator value of OVERFLOW field.                              */
  #define MSPI_INTENSET_OVERFLOW_Set (0x1UL)         /*!< Enable                                                               */
  #define MSPI_INTENSET_OVERFLOW_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_OVERFLOW_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACQUIRED @Bit 16 : Write '1' to enable interrupt for event ACQUIRED */
  #define MSPI_INTENSET_ACQUIRED_Pos (16UL)          /*!< Position of ACQUIRED field.                                          */
  #define MSPI_INTENSET_ACQUIRED_Msk (0x1UL << MSPI_INTENSET_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                    */
  #define MSPI_INTENSET_ACQUIRED_Min (0x0UL)         /*!< Min enumerator value of ACQUIRED field.                              */
  #define MSPI_INTENSET_ACQUIRED_Max (0x1UL)         /*!< Max enumerator value of ACQUIRED field.                              */
  #define MSPI_INTENSET_ACQUIRED_Set (0x1UL)         /*!< Enable                                                               */
  #define MSPI_INTENSET_ACQUIRED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENSET_ACQUIRED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MSPI_INTENCLR: Disable interrupt */
  #define MSPI_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define MSPI_INTENCLR_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define MSPI_INTENCLR_CORE_Msk (0x1UL << MSPI_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define MSPI_INTENCLR_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define MSPI_INTENCLR_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define MSPI_INTENCLR_CORE_Clear (0x1UL)           /*!< Disable                                                              */
  #define MSPI_INTENCLR_CORE_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_CORE_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

