NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* IDLE @Bit 13 : Read pending status of interrupt for event IDLE */
  #define MSPI_INTPEND_IDLE_Pos (13UL)               /*!< Position of IDLE field.                                              */
  #define MSPI_INTPEND_IDLE_Msk (0x1UL << MSPI_INTPEND_IDLE_Pos) /*!< Bit mask of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_Min (0x0UL)              /*!< Min enumerator value of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_Max (0x1UL)              /*!< Max enumerator value of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_IDLE_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* OVERFLOW @Bit 14 : Read pending status of interrupt for event OVERFLOW */
  #define MSPI_INTPEND_OVERFLOW_Pos (14UL)           /*!< Position of OVERFLOW field.                                          */
  #define MSPI_INTPEND_OVERFLOW_Msk (0x1UL << MSPI_INTPEND_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                      */
  #define MSPI_INTPEND_OVERFLOW_Min (0x0UL)          /*!< Min enumerator value of OVERFLOW field.                              */
  #define MSPI_INTPEND_OVERFLOW_Max (0x1UL)          /*!< Max enumerator value of OVERFLOW field.                              */
  #define MSPI_INTPEND_OVERFLOW_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_OVERFLOW_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACQUIRED @Bit 16 : Read pending status of interrupt for event ACQUIRED */
  #define MSPI_INTPEND_ACQUIRED_Pos (16UL)           /*!< Position of ACQUIRED field.                                          */
  #define MSPI_INTPEND_ACQUIRED_Msk (0x1UL << MSPI_INTPEND_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                      */
  #define MSPI_INTPEND_ACQUIRED_Min (0x0UL)          /*!< Min enumerator value of ACQUIRED field.                              */
  #define MSPI_INTPEND_ACQUIRED_Max (0x1UL)          /*!< Max enumerator value of ACQUIRED field.                              */
  #define MSPI_INTPEND_ACQUIRED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_ACQUIRED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* MSPI_ENABLE: Enables the MSPI */
  #define MSPI_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable the MSPI */
  #define MSPI_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define MSPI_ENABLE_ENABLE_Msk (0x1UL << MSPI_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */


/* MSPI_PINOECONTROL: Override and control the output enable signal to the GPIO pads */
  #define MSPI_PINOECONTROL_ResetValue (0x33000000UL) /*!< Reset value of PINOECONTROL register.                               */

/* MIRROR @Bits 0..3 : Enable mirroring of output enable of pin 0 for corresponding bit */
  #define MSPI_PINOECONTROL_MIRROR_Pos (0UL)         /*!< Position of MIRROR field.                                            */
  #define MSPI_PINOECONTROL_MIRROR_Msk (0xFUL << MSPI_PINOECONTROL_MIRROR_Pos) /*!< Bit mask of MIRROR field.                  */
  #define MSPI_PINOECONTROL_MIRROR_Min (0x0UL)       /*!< Min enumerator value of MIRROR field.                                */
  #define MSPI_PINOECONTROL_MIRROR_Max (0xFUL)       /*!< Max enumerator value of MIRROR field.                                */
  #define MSPI_PINOECONTROL_MIRROR_EnableIO0 (0x1UL) /*!< Enable mirroring on output enable for IO0                            */
  #define MSPI_PINOECONTROL_MIRROR_EnableIO1 (0x2UL) /*!< Enable mirroring on output enable for IO1                            */
  #define MSPI_PINOECONTROL_MIRROR_EnableIO2 (0x4UL) /*!< Enable mirroring on output enable for IO2                            */
  #define MSPI_PINOECONTROL_MIRROR_EnableIO3 (0x8UL) /*!< Enable mirroring on output enable for IO3                            */
  #define MSPI_PINOECONTROL_MIRROR_EnableAll (0xFUL) /*!< Enable mirroring on output enable for all data lines                 */
  #define MSPI_PINOECONTROL_MIRROR_Disabled (0x0UL)  /*!< Enabling mirroring on Output Enable is disabled                      */

/* FORCEON @Bits 8..11 : Force pin direction to be output */
  #define MSPI_PINOECONTROL_FORCEON_Pos (8UL)        /*!< Position of FORCEON field.                                           */
  #define MSPI_PINOECONTROL_FORCEON_Msk (0xFUL << MSPI_PINOECONTROL_FORCEON_Pos) /*!< Bit mask of FORCEON field.               */
  #define MSPI_PINOECONTROL_FORCEON_Min (0x0UL)      /*!< Min enumerator value of FORCEON field.                               */
  #define MSPI_PINOECONTROL_FORCEON_Max (0xFUL)      /*!< Max enumerator value of FORCEON field.                               */
  #define MSPI_PINOECONTROL_FORCEON_EnableIO0 (0x1UL) /*!< Forcing on enabled output for IO0                                   */
  #define MSPI_PINOECONTROL_FORCEON_EnableIO1 (0x2UL) /*!< Forcing on enabled output for IO1                                   */
  #define MSPI_PINOECONTROL_FORCEON_EnableIO2 (0x4UL) /*!< Forcing on enabled output for IO2                                   */
  #define MSPI_PINOECONTROL_FORCEON_EnableIO3 (0x8UL) /*!< Forcing on enabled output for IO3                                   */
  #define MSPI_PINOECONTROL_FORCEON_EnableAll (0xFUL) /*!< Forcing on enabled output for all data lines                        */
  #define MSPI_PINOECONTROL_FORCEON_Disabled (0x0UL) /*!< Forcing on Output Enable is disabled                                 */

