NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* ADDRESS @Bits 0..31 : Source job descriptor list address. */
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_LISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */


/* MVDMA_SOURCE_BUSERROR: Source bus error status. */
  #define MVDMA_SOURCE_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                               */

/* BUSERROR @Bits 0..1 : Bus error type */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Pos (0UL)   /*!< Position of BUSERROR field.                                          */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Msk (0x3UL << MVDMA_SOURCE_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.    */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                              */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Max (0x2UL) /*!< Max enumerator value of BUSERROR field.                              */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                             */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadError (0x1UL) /*!< Error related to memory when reading joblist, or error related
                                                                to memory/register when reading data.*/
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Error related to the joblist address when reading joblist,
                                                                      or error related to address when reading memory/register.*/


/* MVDMA_SOURCE_ADDRESS: Latest address being accessed on the Source channel.If a bus error occurs, these registers will contain
                          the address that cause the error. */

  #define MVDMA_SOURCE_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

/* ADDRESS @Bits 0..31 : Source address */
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Pos (0UL)     /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.  */


/* MVDMA_SOURCE_JOBCOUNT: Number of completed jobs in the current Source descriptor list. This resets to 0 when a new joblist is
                           started. */

  #define MVDMA_SOURCE_JOBCOUNT_ResetValue (0x00000000UL) /*!< Reset value of JOBCOUNT register.                               */

/* COUNT @Bits 0..31 : Source job count */
  #define MVDMA_SOURCE_JOBCOUNT_COUNT_Pos (0UL)      /*!< Position of COUNT field.                                             */
  #define MVDMA_SOURCE_JOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_JOBCOUNT_COUNT_Pos) /*!< Bit mask of COUNT field.      */



/* ==================================================== Struct MVDMA_SINK ==================================================== */
/**
  * @brief SINK [MVDMA_SINK] Sink channel configuration and status.
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Start address of Sink job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  BUSERROR;                          /*!< (@ 0x00000004) Sink bus error status.                                */
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed on the Sink channel. If a
                                                                         bus error occurs, these registers will contain the
                                                                         address that cause the error.*/
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in the current Sink descriptor
                                                                         list. This resets to 0 when a new joblist is started.*/
} NRF_MVDMA_SINK_Type;                               /*!< Size = 16 (0x010)                                                    */

/* MVDMA_SINK_LISTPTR: Start address of Sink job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_SINK_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                                   */

/* ADDRESS @Bits 0..31 : Sink descriptor list address. */
  #define MVDMA_SINK_LISTPTR_ADDRESS_Pos (0UL)       /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SINK_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SINK_LISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.      */


/* MVDMA_SINK_BUSERROR: Sink bus error status. */
  #define MVDMA_SINK_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                                 */

/* BUSERROR @Bits 0..2 : Bus error type */
  #define MVDMA_SINK_BUSERROR_BUSERROR_Pos (0UL)     /*!< Position of BUSERROR field.                                          */
  #define MVDMA_SINK_BUSERROR_BUSERROR_Msk (0x7UL << MVDMA_SINK_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.        */
  #define MVDMA_SINK_BUSERROR_BUSERROR_Min (0x0UL)   /*!< Min enumerator value of BUSERROR field.                              */
  #define MVDMA_SINK_BUSERROR_BUSERROR_Max (0x4UL)   /*!< Max enumerator value of BUSERROR field.                              */
  #define MVDMA_SINK_BUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                               */
  #define MVDMA_SINK_BUSERROR_BUSERROR_ReadError (0x1UL) /*!< Error related to memory when reading joblist.                    */
  #define MVDMA_SINK_BUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Error related to the joblist address when reading joblist. */
  #define MVDMA_SINK_BUSERROR_BUSERROR_WriteError (0x3UL) /*!< Error related to memory/register when writing data.             */
  #define MVDMA_SINK_BUSERROR_BUSERROR_WriteDecodeError (0x4UL) /*!< Error related to the memory/register address when writing
                                                                     data.*/


/* MVDMA_SINK_ADDRESS: Latest address being accessed on the Sink channel. If a bus error occurs, these registers will contain
                        the address that cause the error. */

  #define MVDMA_SINK_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                   */

/* ADDRESS @Bits 0..31 : Sink address */
  #define MVDMA_SINK_ADDRESS_ADDRESS_Pos (0UL)       /*!< Position of ADDRESS field.                                           */
  #define MVDMA_SINK_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SINK_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.      */


/* MVDMA_SINK_JOBCOUNT: Number of completed jobs in the current Sink descriptor list. This resets to 0 when a new joblist is
                         started. */

