NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* TASKS_RESET @Bit 0 : Reset operation. */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Pos (0UL)    /*!< Position of TASKS_RESET field.                                       */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Msk (0x1UL << MVDMA_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field.   */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Min (0x1UL)  /*!< Min enumerator value of TASKS_RESET field.                           */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Max (0x1UL)  /*!< Max enumerator value of TASKS_RESET field.                           */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Trigger (0x1UL) /*!< Trigger task                                                      */


/* MVDMA_TASKS_START: Start operation of job list n. Base address for successive TASKS_STARTs. */
  #define MVDMA_TASKS_START_MaxCount (8UL)           /*!< Max size of TASKS_START[8] array.                                    */
  #define MVDMA_TASKS_START_MaxIndex (7UL)           /*!< Max index of TASKS_START[8] array.                                   */
  #define MVDMA_TASKS_START_MinIndex (0UL)           /*!< Min index of TASKS_START[8] array.                                   */
  #define MVDMA_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START[8] register.                             */

/* TASKS_START @Bit 0 : Start operation of job list n. Base address for successive TASKS_STARTs. */
  #define MVDMA_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define MVDMA_TASKS_START_TASKS_START_Msk (0x1UL << MVDMA_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define MVDMA_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define MVDMA_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define MVDMA_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* MVDMA_SUBSCRIBE_START: Subscribe configuration for task START[n] */
  #define MVDMA_SUBSCRIBE_START_MaxCount (8UL)       /*!< Max size of SUBSCRIBE_START[8] array.                                */
  #define MVDMA_SUBSCRIBE_START_MaxIndex (7UL)       /*!< Max index of SUBSCRIBE_START[8] array.                               */
  #define MVDMA_SUBSCRIBE_START_MinIndex (0UL)       /*!< Min index of SUBSCRIBE_START[8] array.                               */
  #define MVDMA_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START[8] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task START[n] will subscribe to */
  #define MVDMA_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define MVDMA_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << MVDMA_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define MVDMA_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define MVDMA_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MVDMA_SUBSCRIBE_START_EN_Msk (0x1UL << MVDMA_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MVDMA_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define MVDMA_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* MVDMA_EVENTS_END: Event indicating that Sink data descriptor list has been completed. */
  #define MVDMA_EVENTS_END_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_END register.                                  */

/* EVENTS_END @Bit 0 : Event indicating that Sink data descriptor list has been completed. */
  #define MVDMA_EVENTS_END_EVENTS_END_Pos (0UL)      /*!< Position of EVENTS_END field.                                        */
  #define MVDMA_EVENTS_END_EVENTS_END_Msk (0x1UL << MVDMA_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field.        */
  #define MVDMA_EVENTS_END_EVENTS_END_Min (0x0UL)    /*!< Min enumerator value of EVENTS_END field.                            */
  #define MVDMA_EVENTS_END_EVENTS_END_Max (0x1UL)    /*!< Max enumerator value of EVENTS_END field.                            */
  #define MVDMA_EVENTS_END_EVENTS_END_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define MVDMA_EVENTS_END_EVENTS_END_Generated (0x1UL) /*!< Event generated                                                   */


/* MVDMA_EVENTS_STARTED: Event indicating that the source list processing has started. */
  #define MVDMA_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : Event indicating that the source list processing has started. */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << MVDMA_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* MVDMA_EVENTS_PAUSED: Event indicating that the data transfer has been paused. */
  #define MVDMA_EVENTS_PAUSED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PAUSED register.                            */

/* EVENTS_PAUSED @Bit 0 : Event indicating that the data transfer has been paused. */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos (0UL) /*!< Position of EVENTS_PAUSED field.                                    */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Msk (0x1UL << MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos) /*!< Bit mask of EVENTS_PAUSED
                                                                            field.*/
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PAUSED field.                      */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PAUSED field.                      */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Generated (0x1UL) /*!< Event generated                                             */


