NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* COMPLETED3 @Bit 11 : Write '1' to enable interrupt for event COMPLETED[3] */
  #define MVDMA_INTENSET_COMPLETED3_Pos (11UL)       /*!< Position of COMPLETED3 field.                                        */
  #define MVDMA_INTENSET_COMPLETED3_Msk (0x1UL << MVDMA_INTENSET_COMPLETED3_Pos) /*!< Bit mask of COMPLETED3 field.            */
  #define MVDMA_INTENSET_COMPLETED3_Min (0x0UL)      /*!< Min enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTENSET_COMPLETED3_Max (0x1UL)      /*!< Max enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTENSET_COMPLETED3_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED4 @Bit 12 : Write '1' to enable interrupt for event COMPLETED[4] */
  #define MVDMA_INTENSET_COMPLETED4_Pos (12UL)       /*!< Position of COMPLETED4 field.                                        */
  #define MVDMA_INTENSET_COMPLETED4_Msk (0x1UL << MVDMA_INTENSET_COMPLETED4_Pos) /*!< Bit mask of COMPLETED4 field.            */
  #define MVDMA_INTENSET_COMPLETED4_Min (0x0UL)      /*!< Min enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTENSET_COMPLETED4_Max (0x1UL)      /*!< Max enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTENSET_COMPLETED4_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED4_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED4_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED5 @Bit 13 : Write '1' to enable interrupt for event COMPLETED[5] */
  #define MVDMA_INTENSET_COMPLETED5_Pos (13UL)       /*!< Position of COMPLETED5 field.                                        */
  #define MVDMA_INTENSET_COMPLETED5_Msk (0x1UL << MVDMA_INTENSET_COMPLETED5_Pos) /*!< Bit mask of COMPLETED5 field.            */
  #define MVDMA_INTENSET_COMPLETED5_Min (0x0UL)      /*!< Min enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTENSET_COMPLETED5_Max (0x1UL)      /*!< Max enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTENSET_COMPLETED5_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED5_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED5_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED6 @Bit 14 : Write '1' to enable interrupt for event COMPLETED[6] */
  #define MVDMA_INTENSET_COMPLETED6_Pos (14UL)       /*!< Position of COMPLETED6 field.                                        */
  #define MVDMA_INTENSET_COMPLETED6_Msk (0x1UL << MVDMA_INTENSET_COMPLETED6_Pos) /*!< Bit mask of COMPLETED6 field.            */
  #define MVDMA_INTENSET_COMPLETED6_Min (0x0UL)      /*!< Min enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTENSET_COMPLETED6_Max (0x1UL)      /*!< Max enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTENSET_COMPLETED6_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED6_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED6_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED7 @Bit 15 : Write '1' to enable interrupt for event COMPLETED[7] */
  #define MVDMA_INTENSET_COMPLETED7_Pos (15UL)       /*!< Position of COMPLETED7 field.                                        */
  #define MVDMA_INTENSET_COMPLETED7_Msk (0x1UL << MVDMA_INTENSET_COMPLETED7_Pos) /*!< Bit mask of COMPLETED7 field.            */
  #define MVDMA_INTENSET_COMPLETED7_Min (0x0UL)      /*!< Min enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTENSET_COMPLETED7_Max (0x1UL)      /*!< Max enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTENSET_COMPLETED7_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED7_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED7_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* MVDMA_INTENCLR: Disable interrupt */
  #define MVDMA_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define MVDMA_INTENCLR_END_Pos (0UL)               /*!< Position of END field.                                               */
  #define MVDMA_INTENCLR_END_Msk (0x1UL << MVDMA_INTENCLR_END_Pos) /*!< Bit mask of END field.                                 */
  #define MVDMA_INTENCLR_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTENCLR_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTENCLR_END_Clear (0x1UL)           /*!< Disable                                                              */
  #define MVDMA_INTENCLR_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* STARTED @Bit 1 : Write '1' to disable interrupt for event STARTED */
  #define MVDMA_INTENCLR_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define MVDMA_INTENCLR_STARTED_Msk (0x1UL << MVDMA_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MVDMA_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MVDMA_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PAUSED @Bit 2 : Write '1' to disable interrupt for event PAUSED */
  #define MVDMA_INTENCLR_PAUSED_Pos (2UL)            /*!< Position of PAUSED field.                                            */
  #define MVDMA_INTENCLR_PAUSED_Msk (0x1UL << MVDMA_INTENCLR_PAUSED_Pos) /*!< Bit mask of PAUSED field.                        */
  #define MVDMA_INTENCLR_PAUSED_Min (0x0UL)          /*!< Min enumerator value of PAUSED field.                                */
  #define MVDMA_INTENCLR_PAUSED_Max (0x1UL)          /*!< Max enumerator value of PAUSED field.                                */
  #define MVDMA_INTENCLR_PAUSED_Clear (0x1UL)        /*!< Disable                                                              */
  #define MVDMA_INTENCLR_PAUSED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_PAUSED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

