NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define NFCT_PUBLISH_STARTED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define NFCT_PUBLISH_STARTED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_STARTED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_STARTED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_STARTED_EN_Msk (0x1UL << NFCT_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define NFCT_PUBLISH_STARTED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_STARTED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_STARTED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_STARTED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* NFCT_SHORTS: Shortcuts between local events and tasks */
  #define NFCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* FIELDDETECTED_ACTIVATE @Bit 0 : Shortcut between event FIELDDETECTED and task ACTIVATE */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos (0UL) /*!< Position of FIELDDETECTED_ACTIVATE field.                          */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Msk (0x1UL << NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos) /*!< Bit mask of
                                                                            FIELDDETECTED_ACTIVATE field.*/
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Min (0x0UL) /*!< Min enumerator value of FIELDDETECTED_ACTIVATE field.            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Max (0x1UL) /*!< Max enumerator value of FIELDDETECTED_ACTIVATE field.            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Disabled (0x0UL) /*!< Disable shortcut                                            */
  #define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Enabled (0x1UL) /*!< Enable shortcut                                              */

/* FIELDLOST_SENSE @Bit 1 : Shortcut between event FIELDLOST and task SENSE */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Pos (1UL)      /*!< Position of FIELDLOST_SENSE field.                                   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Msk (0x1UL << NFCT_SHORTS_FIELDLOST_SENSE_Pos) /*!< Bit mask of FIELDLOST_SENSE field.   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Min (0x0UL)    /*!< Min enumerator value of FIELDLOST_SENSE field.                       */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Max (0x1UL)    /*!< Max enumerator value of FIELDLOST_SENSE field.                       */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define NFCT_SHORTS_FIELDLOST_SENSE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* TXFRAMEEND_ENABLERXDATA @Bit 5 : Shortcut between event TXFRAMEEND and task ENABLERXDATA */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos (5UL) /*!< Position of TXFRAMEEND_ENABLERXDATA field.                        */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Msk (0x1UL << NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos) /*!< Bit mask of
                                                                            TXFRAMEEND_ENABLERXDATA field.*/
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Min (0x0UL) /*!< Min enumerator value of TXFRAMEEND_ENABLERXDATA field.          */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TXFRAMEEND_ENABLERXDATA field.          */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Enabled (0x1UL) /*!< Enable shortcut                                             */


/* NFCT_INTEN: Enable or disable interrupt */
  #define NFCT_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define NFCT_INTEN_READY_Pos (0UL)                 /*!< Position of READY field.                                             */
  #define NFCT_INTEN_READY_Msk (0x1UL << NFCT_INTEN_READY_Pos) /*!< Bit mask of READY field.                                   */
  #define NFCT_INTEN_READY_Min (0x0UL)               /*!< Min enumerator value of READY field.                                 */
  #define NFCT_INTEN_READY_Max (0x1UL)               /*!< Max enumerator value of READY field.                                 */
  #define NFCT_INTEN_READY_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_READY_Enabled (0x1UL)           /*!< Enable                                                               */

/* FIELDDETECTED @Bit 1 : Enable or disable interrupt for event FIELDDETECTED */
  #define NFCT_INTEN_FIELDDETECTED_Pos (1UL)         /*!< Position of FIELDDETECTED field.                                     */
  #define NFCT_INTEN_FIELDDETECTED_Msk (0x1UL << NFCT_INTEN_FIELDDETECTED_Pos) /*!< Bit mask of FIELDDETECTED field.           */
  #define NFCT_INTEN_FIELDDETECTED_Min (0x0UL)       /*!< Min enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTEN_FIELDDETECTED_Max (0x1UL)       /*!< Max enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTEN_FIELDDETECTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define NFCT_INTEN_FIELDDETECTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* FIELDLOST @Bit 2 : Enable or disable interrupt for event FIELDLOST */
  #define NFCT_INTEN_FIELDLOST_Pos (2UL)             /*!< Position of FIELDLOST field.                                         */
  #define NFCT_INTEN_FIELDLOST_Msk (0x1UL << NFCT_INTEN_FIELDLOST_Pos) /*!< Bit mask of FIELDLOST field.                       */
  #define NFCT_INTEN_FIELDLOST_Min (0x0UL)           /*!< Min enumerator value of FIELDLOST field.                             */
  #define NFCT_INTEN_FIELDLOST_Max (0x1UL)           /*!< Max enumerator value of FIELDLOST field.                             */
  #define NFCT_INTEN_FIELDLOST_Disabled (0x0UL)      /*!< Disable                                                              */
  #define NFCT_INTEN_FIELDLOST_Enabled (0x1UL)       /*!< Enable                                                               */

