NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* MODE @Bit 0 : Enables/disables auto collision resolution */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Msk (0x1UL << NFCT_AUTOCOLRESCONFIG_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Max (0x1UL)     /*!< Max enumerator value of MODE field.                                  */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Enabled (0x0UL) /*!< Auto collision resolution enabled                                    */
  #define NFCT_AUTOCOLRESCONFIG_MODE_Disabled (0x1UL) /*!< Auto collision resolution disabled                                  */


/* NFCT_SENSRES: NFC-A SENS_RES auto-response settings */
  #define NFCT_SENSRES_ResetValue (0x00000001UL)     /*!< Reset value of SENSRES register.                                     */

/* BITFRAMESDD @Bits 0..4 : Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital
                            Protocol Technical Specification */

  #define NFCT_SENSRES_BITFRAMESDD_Pos (0UL)         /*!< Position of BITFRAMESDD field.                                       */
  #define NFCT_SENSRES_BITFRAMESDD_Msk (0x1FUL << NFCT_SENSRES_BITFRAMESDD_Pos) /*!< Bit mask of BITFRAMESDD field.            */
  #define NFCT_SENSRES_BITFRAMESDD_Min (0x00UL)      /*!< Min enumerator value of BITFRAMESDD field.                           */
  #define NFCT_SENSRES_BITFRAMESDD_Max (0x10UL)      /*!< Max enumerator value of BITFRAMESDD field.                           */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00000 (0x00UL) /*!< SDD pattern 00000                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00001 (0x01UL) /*!< SDD pattern 00001                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00010 (0x02UL) /*!< SDD pattern 00010                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD00100 (0x04UL) /*!< SDD pattern 00100                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD01000 (0x08UL) /*!< SDD pattern 01000                                                    */
  #define NFCT_SENSRES_BITFRAMESDD_SDD10000 (0x10UL) /*!< SDD pattern 10000                                                    */

/* RFU5 @Bit 5 : Reserved for future use. Shall be 0. */
  #define NFCT_SENSRES_RFU5_Pos (5UL)                /*!< Position of RFU5 field.                                              */
  #define NFCT_SENSRES_RFU5_Msk (0x1UL << NFCT_SENSRES_RFU5_Pos) /*!< Bit mask of RFU5 field.                                  */

/* NFCIDSIZE @Bits 6..7 : NFCID1 size. This value is used by the auto collision resolution engine. */
  #define NFCT_SENSRES_NFCIDSIZE_Pos (6UL)           /*!< Position of NFCIDSIZE field.                                         */
  #define NFCT_SENSRES_NFCIDSIZE_Msk (0x3UL << NFCT_SENSRES_NFCIDSIZE_Pos) /*!< Bit mask of NFCIDSIZE field.                   */
  #define NFCT_SENSRES_NFCIDSIZE_Min (0x0UL)         /*!< Min enumerator value of NFCIDSIZE field.                             */
  #define NFCT_SENSRES_NFCIDSIZE_Max (0x2UL)         /*!< Max enumerator value of NFCIDSIZE field.                             */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Single (0x0UL) /*!< NFCID1 size: single (4 bytes)                                       */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Double (0x1UL) /*!< NFCID1 size: double (7 bytes)                                       */
  #define NFCT_SENSRES_NFCIDSIZE_NFCID1Triple (0x2UL) /*!< NFCID1 size: triple (10 bytes)                                      */

/* PLATFCONFIG @Bits 8..11 : Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum,
                             NFC Digital Protocol Technical Specification */

  #define NFCT_SENSRES_PLATFCONFIG_Pos (8UL)         /*!< Position of PLATFCONFIG field.                                       */
  #define NFCT_SENSRES_PLATFCONFIG_Msk (0xFUL << NFCT_SENSRES_PLATFCONFIG_Pos) /*!< Bit mask of PLATFCONFIG field.             */

/* RFU74 @Bits 12..15 : Reserved for future use. Shall be 0. */
  #define NFCT_SENSRES_RFU74_Pos (12UL)              /*!< Position of RFU74 field.                                             */
  #define NFCT_SENSRES_RFU74_Msk (0xFUL << NFCT_SENSRES_RFU74_Pos) /*!< Bit mask of RFU74 field.                               */


/* NFCT_SELRES: NFC-A SEL_RES auto-response settings */
  #define NFCT_SELRES_ResetValue (0x00000000UL)      /*!< Reset value of SELRES register.                                      */

/* RFU10 @Bits 0..1 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU10_Pos (0UL)                /*!< Position of RFU10 field.                                             */
  #define NFCT_SELRES_RFU10_Msk (0x3UL << NFCT_SELRES_RFU10_Pos) /*!< Bit mask of RFU10 field.                                 */

/* CASCADE @Bit 2 : Cascade as defined by the b3 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical
                    Specification (controlled by hardware, shall be 0) */

  #define NFCT_SELRES_CASCADE_Pos (2UL)              /*!< Position of CASCADE field.                                           */
  #define NFCT_SELRES_CASCADE_Msk (0x1UL << NFCT_SELRES_CASCADE_Pos) /*!< Bit mask of CASCADE field.                           */

/* RFU43 @Bits 3..4 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU43_Pos (3UL)                /*!< Position of RFU43 field.                                             */
  #define NFCT_SELRES_RFU43_Msk (0x3UL << NFCT_SELRES_RFU43_Pos) /*!< Bit mask of RFU43 field.                                 */

/* PROTOCOL @Bits 5..6 : Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical
                         Specification */

  #define NFCT_SELRES_PROTOCOL_Pos (5UL)             /*!< Position of PROTOCOL field.                                          */
  #define NFCT_SELRES_PROTOCOL_Msk (0x3UL << NFCT_SELRES_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field.                        */

/* RFU7 @Bit 7 : Reserved for future use. Shall be 0. */
  #define NFCT_SELRES_RFU7_Pos (7UL)                 /*!< Position of RFU7 field.                                              */
  #define NFCT_SELRES_RFU7_Msk (0x1UL << NFCT_SELRES_RFU7_Pos) /*!< Bit mask of RFU7 field.                                    */


/* NFCT_PADCONFIG: NFC pad configuration */
  #define NFCT_PADCONFIG_ResetValue (0x00000001UL)   /*!< Reset value of PADCONFIG register.                                   */

/* ENABLE @Bit 0 : Enable NFC pads */
  #define NFCT_PADCONFIG_ENABLE_Pos (0UL)            /*!< Position of ENABLE field.                                            */
  #define NFCT_PADCONFIG_ENABLE_Msk (0x1UL << NFCT_PADCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define NFCT_PADCONFIG_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Max (0x1UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Disabled (0x0UL)     /*!< NFC pads are used as GPIO pins                                       */
  #define NFCT_PADCONFIG_ENABLE_Enabled (0x1UL)      /*!< The NFC pads are configured as NFC antenna pins                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        OSCILLATORS                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

