NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* ENABLEPOWERONFORCE @Bit 6 : ENABLEPOWERONFORCE */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Pos (6UL) /*!< Position of ENABLEPOWERONFORCE field.                    */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Pos) /*!< Bit
                                                                            mask of ENABLEPOWERONFORCE field.*/

/* POWERONFORCEPRE @Bit 7 : POWERONFORCEPRE */
  #define PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Pos (7UL) /*!< Position of POWERONFORCEPRE field.                          */
  #define PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Pos) /*!< Bit mask
                                                                            of POWERONFORCEPRE field.*/

/* DISABLEWAITRESTORE @Bit 8 : Turn off waiting for arst deactivation before retention restore */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Pos (8UL) /*!< Position of DISABLEWAITRESTORE field.                    */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Pos) /*!< Bit
                                                                            mask of DISABLEWAITRESTORE field.*/
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Min (0x0UL) /*!< Min enumerator value of DISABLEWAITRESTORE field.      */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Max (0x1UL) /*!< Max enumerator value of DISABLEWAITRESTORE field.      */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Disable (0x1UL) /*!< Turn off waiting for arst deactivation before
                                                                            retention restore*/
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Enable (0x0UL) /*!< Wait for arst deactivation before retention restore */


/* PCGCMASTER_CLOCKFORCEREG: Force clock n */
  #define PCGCMASTER_CLOCKFORCEREG_MaxCount (5UL)    /*!< Max size of CLOCKFORCEREG[5] array.                                  */
  #define PCGCMASTER_CLOCKFORCEREG_MaxIndex (4UL)    /*!< Max index of CLOCKFORCEREG[5] array.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_MinIndex (0UL)    /*!< Min index of CLOCKFORCEREG[5] array.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_ResetValue (0x00000000UL) /*!< Reset value of CLOCKFORCEREG[5] register.                    */

/* ENABLE @Bit 0 : Enable clock forcing */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos (0UL)  /*!< Position of ENABLE field.                                            */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos) /*!< Bit mask of ENABLE field.    */

/* CLOCKFORCING @Bit 1 : CLOCKFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos (1UL) /*!< Position of CLOCKFORCING field.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos) /*!< Bit mask of
                                                                            CLOCKFORCING field.*/

/* CLOCKSOURCEFORCING @Bits 2..4 : CLOCKSOURCEFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos (2UL) /*!< Position of CLOCKSOURCEFORCING field.                     */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Msk (0x7UL << PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos) /*!< Bit
                                                                            mask of CLOCKSOURCEFORCING field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PDM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PDM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) This event is generated if an error occurs during the
                                                                         bus transfer.*/
} NRF_PDM_EVENTS_DMA_Type;                           /*!< Size = 4 (0x004)                                                     */

/* PDM_EVENTS_DMA_BUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                             */

/* BUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                          */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Msk (0x1UL << PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.*/
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                              */



/* ================================================= Struct PDM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PDM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Publish configuration for event DMA.BUSERROR          */
} NRF_PDM_PUBLISH_DMA_Type;                          /*!< Size = 4 (0x004)                                                     */

/* PDM_PUBLISH_DMA_BUSERROR: Publish configuration for event DMA.BUSERROR */
  #define PDM_PUBLISH_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA.BUSERROR will publish to */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Msk (0xFFUL << PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Msk (0x1UL << PDM_PUBLISH_DMA_BUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */



