NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* DISABLE @Bit 0 : High pass filter disable */
  #define PDM_FILTER_HPDISABLE_DISABLE_Pos (0UL)     /*!< Position of DISABLE field.                                           */
  #define PDM_FILTER_HPDISABLE_DISABLE_Msk (0x1UL << PDM_FILTER_HPDISABLE_DISABLE_Pos) /*!< Bit mask of DISABLE field.         */
  #define PDM_FILTER_HPDISABLE_DISABLE_Min (0x0UL)   /*!< Min enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Max (0x1UL)   /*!< Max enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Enable (0x0UL) /*!< High pass filter enabled                                            */
  #define PDM_FILTER_HPDISABLE_DISABLE_Disable (0x1UL) /*!< High pass filter disabled                                          */


/* PDM_FILTER_SOFTMUTE: Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ResetValue (0x00000000UL) /*!< Reset value of SOFTMUTE register.                                 */

/* ENABLE @Bit 0 : Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Msk (0x1UL << PDM_FILTER_SOFTMUTE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Disabled (0x0UL) /*!< Disable soft mute function                                          */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Enabled (0x1UL) /*!< Enable soft mute function                                            */


/* PDM_FILTER_SOFTCYCLES: Soft mute settings */
  #define PDM_FILTER_SOFTCYCLES_ResetValue (0x00000002UL) /*!< Reset value of SOFTCYCLES register.                             */

/* DISABLE @Bits 0..2 : Soft mute settings: amount of cycles for transition */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Pos (0UL)    /*!< Position of DISABLE field.                                           */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Msk (0x7UL << PDM_FILTER_SOFTCYCLES_DISABLE_Pos) /*!< Bit mask of DISABLE field.       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Min (0x0UL)  /*!< Min enumerator value of DISABLE field.                               */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Max (0x7UL)  /*!< Max enumerator value of DISABLE field.                               */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s2 (0x0UL)   /*!< 2 filter source clock cycles                                         */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s8 (0x1UL)   /*!< 8 filter source clock cycles                                         */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s32 (0x2UL)  /*!< 32 filter source clock cycles                                        */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s64 (0x3UL)  /*!< 64 filter source clock cycles                                        */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s128 (0x4UL) /*!< 128 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s256 (0x5UL) /*!< 256 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s512 (0x6UL) /*!< 512 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Custom (0x7UL) /*!< The number of cycles can be set using FILTER.CTRL[17:14] bits      */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_custom (0x7UL) /*!< See the Custom enumerator                                          */


/* PDM_FILTER_SAMPLEDELAY: Input Data Sampling with Number of ckFilterL (double frequency of PDM_CLK) Clock Cycle Delay.
                            Optionally,input sample point can be delayed independently on left and right channels using
                            FILTER:CTRL[20:19] bits */

  #define PDM_FILTER_SAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of SAMPLEDELAY register.                           */

/* DELAY @Bit 0 : Input Data Sampling with Number of ckFilterL (double frequency of PDM_CLK) Clock Cycle Delay */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Pos (0UL)     /*!< Position of DELAY field.                                             */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Msk (0x1UL << PDM_FILTER_SAMPLEDELAY_DELAY_Pos) /*!< Bit mask of DELAY field.           */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Min (0x0UL)   /*!< Min enumerator value of DELAY field.                                 */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Max (0x1UL)   /*!< Max enumerator value of DELAY field.                                 */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_NoDelay (0x0UL) /*!< No delay                                                           */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Delay1Ck (0x1UL) /*!< 1 Cycle                                                           */



/* ===================================================== Struct PDM_PSEL ===================================================== */
/**
  * @brief PSEL [PDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CLK;                               /*!< (@ 0x00000000) Pin number configuration for PDM CLK signal           */
  __IOM uint32_t  DIN;                               /*!< (@ 0x00000004) Pin number configuration for PDM DIN signal           */
} NRF_PDM_PSEL_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* PDM_PSEL_CLK: Pin number configuration for PDM CLK signal */
  #define PDM_PSEL_CLK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of CLK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_CLK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define PDM_PSEL_CLK_PIN_Msk (0x1FUL << PDM_PSEL_CLK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define PDM_PSEL_CLK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define PDM_PSEL_CLK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..6 : Port number */
  #define PDM_PSEL_CLK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define PDM_PSEL_CLK_PORT_Msk (0x3UL << PDM_PSEL_CLK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define PDM_PSEL_CLK_PORT_Min (0x1UL)              /*!< Min value of PORT field.                                             */
  #define PDM_PSEL_CLK_PORT_Max (0x3UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_CLK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define PDM_PSEL_CLK_CONNECT_Msk (0x1UL << PDM_PSEL_CLK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define PDM_PSEL_CLK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define PDM_PSEL_CLK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


