NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* QDEC_EVENTS_STOPPED: QDEC has been stopped */
  #define QDEC_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                           */

/* EVENTS_STOPPED @Bit 0 : QDEC has been stopped */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                  */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                    */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                    */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                            */


/* QDEC_PUBLISH_SAMPLERDY: Publish configuration for event SAMPLERDY */
  #define QDEC_PUBLISH_SAMPLERDY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SAMPLERDY register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event SAMPLERDY will publish to */
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Msk (0x1UL << QDEC_PUBLISH_SAMPLERDY_EN_Pos) /*!< Bit mask of EN field.                    */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* QDEC_PUBLISH_REPORTRDY: Publish configuration for event REPORTRDY */
  #define QDEC_PUBLISH_REPORTRDY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_REPORTRDY register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event REPORTRDY will publish to */
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_REPORTRDY_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_REPORTRDY_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define QDEC_PUBLISH_REPORTRDY_EN_Msk (0x1UL << QDEC_PUBLISH_REPORTRDY_EN_Pos) /*!< Bit mask of EN field.                    */
  #define QDEC_PUBLISH_REPORTRDY_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_REPORTRDY_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_REPORTRDY_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define QDEC_PUBLISH_REPORTRDY_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* QDEC_PUBLISH_ACCOF: Publish configuration for event ACCOF */
  #define QDEC_PUBLISH_ACCOF_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACCOF register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ACCOF will publish to */
  #define QDEC_PUBLISH_ACCOF_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define QDEC_PUBLISH_ACCOF_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_ACCOF_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define QDEC_PUBLISH_ACCOF_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define QDEC_PUBLISH_ACCOF_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_ACCOF_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define QDEC_PUBLISH_ACCOF_EN_Msk (0x1UL << QDEC_PUBLISH_ACCOF_EN_Pos) /*!< Bit mask of EN field.                            */
  #define QDEC_PUBLISH_ACCOF_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_ACCOF_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_ACCOF_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define QDEC_PUBLISH_ACCOF_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* QDEC_PUBLISH_DBLRDY: Publish configuration for event DBLRDY */
  #define QDEC_PUBLISH_DBLRDY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DBLRDY register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event DBLRDY will publish to */
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_DBLRDY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_DBLRDY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define QDEC_PUBLISH_DBLRDY_EN_Msk (0x1UL << QDEC_PUBLISH_DBLRDY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define QDEC_PUBLISH_DBLRDY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_DBLRDY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_DBLRDY_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define QDEC_PUBLISH_DBLRDY_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* QDEC_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define QDEC_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define QDEC_PUBLISH_STOPPED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define QDEC_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define QDEC_PUBLISH_STOPPED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define QDEC_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_STOPPED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define QDEC_PUBLISH_STOPPED_EN_Msk (0x1UL << QDEC_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define QDEC_PUBLISH_STOPPED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_STOPPED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define QDEC_PUBLISH_STOPPED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define QDEC_PUBLISH_STOPPED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* QDEC_SHORTS: Shortcuts between local events and tasks */
  #define QDEC_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* REPORTRDY_READCLRACC @Bit 0 : Shortcut between event REPORTRDY and task READCLRACC */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Pos (0UL) /*!< Position of REPORTRDY_READCLRACC field.                              */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_READCLRACC_Pos) /*!< Bit mask of
                                                                            REPORTRDY_READCLRACC field.*/
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Min (0x0UL) /*!< Min enumerator value of REPORTRDY_READCLRACC field.                */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Max (0x1UL) /*!< Max enumerator value of REPORTRDY_READCLRACC field.                */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* SAMPLERDY_STOP @Bit 1 : Shortcut between event SAMPLERDY and task STOP */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Pos (1UL)       /*!< Position of SAMPLERDY_STOP field.                                    */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Msk (0x1UL << QDEC_SHORTS_SAMPLERDY_STOP_Pos) /*!< Bit mask of SAMPLERDY_STOP field.      */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Min (0x0UL)     /*!< Min enumerator value of SAMPLERDY_STOP field.                        */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Max (0x1UL)     /*!< Max enumerator value of SAMPLERDY_STOP field.                        */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

