NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* RADIO_CSTONES_FREQOFFSET: Frequency offset estimate */
  #define RADIO_CSTONES_FREQOFFSET_ResetValue (0x00000000UL) /*!< Reset value of FREQOFFSET register.                          */

/* FREQOFFSET @Bits 0..13 : (unspecified) */
  #define RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Pos (0UL) /*!< Position of FREQOFFSET field.                                     */
  #define RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Msk (0x3FFFUL << RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Pos) /*!< Bit mask of
                                                                            FREQOFFSET field.*/



/* ==================================================== Struct RADIO_RTT ===================================================== */
/**
  * @brief RTT [RADIO_RTT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) RTT Config.                                           */
  __IOM uint32_t  SEGMENT01;                         /*!< (@ 0x00000004) RTT segments 0 and 1                                  */
  __IOM uint32_t  SEGMENT23;                         /*!< (@ 0x00000008) RTT segments 2 and 3                                  */
  __IOM uint32_t  SEGMENT45;                         /*!< (@ 0x0000000C) RTT segments 4 and 5                                  */
  __IOM uint32_t  SEGMENT67;                         /*!< (@ 0x00000010) RTT segments 6 and 7                                  */
} NRF_RADIO_RTT_Type;                                /*!< Size = 20 (0x014)                                                    */

/* RADIO_RTT_CONFIG: RTT Config. */
  #define RADIO_RTT_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                      */

/* EN @Bit 0 : Enable RTT functionality. Only valid for BLE 1MBPS and 2MBPS mode */
  #define RADIO_RTT_CONFIG_EN_Pos (0UL)              /*!< Position of EN field.                                                */
  #define RADIO_RTT_CONFIG_EN_Msk (0x1UL << RADIO_RTT_CONFIG_EN_Pos) /*!< Bit mask of EN field.                                */
  #define RADIO_RTT_CONFIG_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define RADIO_RTT_CONFIG_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define RADIO_RTT_CONFIG_EN_Disabled (0x0UL)       /*!< Disable RTT Block                                                    */
  #define RADIO_RTT_CONFIG_EN_Enabled (0x1UL)        /*!< Enable RTT Block                                                     */

/* ENFULLAA @Bit 1 : Enabling/Disable ping over the entire access address. */
  #define RADIO_RTT_CONFIG_ENFULLAA_Pos (1UL)        /*!< Position of ENFULLAA field.                                          */
  #define RADIO_RTT_CONFIG_ENFULLAA_Msk (0x1UL << RADIO_RTT_CONFIG_ENFULLAA_Pos) /*!< Bit mask of ENFULLAA field.              */
  #define RADIO_RTT_CONFIG_ENFULLAA_Min (0x0UL)      /*!< Min enumerator value of ENFULLAA field.                              */
  #define RADIO_RTT_CONFIG_ENFULLAA_Max (0x1UL)      /*!< Max enumerator value of ENFULLAA field.                              */
  #define RADIO_RTT_CONFIG_ENFULLAA_Disabled (0x0UL) /*!< Disable ping over the entire access address, i.e., enable only over
                                                          the first 16-bit access address*/
  #define RADIO_RTT_CONFIG_ENFULLAA_Enabled (0x1UL)  /*!< Enable ping over the entire access address                           */

/* ROLE @Bit 2 : Role as a Initiator or Reflector. */
  #define RADIO_RTT_CONFIG_ROLE_Pos (2UL)            /*!< Position of ROLE field.                                              */
  #define RADIO_RTT_CONFIG_ROLE_Msk (0x1UL << RADIO_RTT_CONFIG_ROLE_Pos) /*!< Bit mask of ROLE field.                          */
  #define RADIO_RTT_CONFIG_ROLE_Min (0x0UL)          /*!< Min enumerator value of ROLE field.                                  */
  #define RADIO_RTT_CONFIG_ROLE_Max (0x1UL)          /*!< Max enumerator value of ROLE field.                                  */
  #define RADIO_RTT_CONFIG_ROLE_Initiator (0x0UL)    /*!< Initiator                                                            */
  #define RADIO_RTT_CONFIG_ROLE_Reflector (0x1UL)    /*!< Reflector                                                            */

/* NUMSEGMENTS @Bits 3..6 : Number of 16bit payload segments available for ToA detection. Allowed values are 0, 2, 4, 6 and 8. */
  #define RADIO_RTT_CONFIG_NUMSEGMENTS_Pos (3UL)     /*!< Position of NUMSEGMENTS field.                                       */
  #define RADIO_RTT_CONFIG_NUMSEGMENTS_Msk (0xFUL << RADIO_RTT_CONFIG_NUMSEGMENTS_Pos) /*!< Bit mask of NUMSEGMENTS field.     */

/* EFSDELAY @Bits 8..16 : Early Frame Sync Delay, i.e., number of cycles to wait for access address to anchor correctly. For
                          Ble_2Mbit, the EFSDELAY value is 64 (2us) and for Ble_1Mbit, it can be 256 (8us). */

  #define RADIO_RTT_CONFIG_EFSDELAY_Pos (8UL)        /*!< Position of EFSDELAY field.                                          */
  #define RADIO_RTT_CONFIG_EFSDELAY_Msk (0x1FFUL << RADIO_RTT_CONFIG_EFSDELAY_Pos) /*!< Bit mask of EFSDELAY field.            */


/* RADIO_RTT_SEGMENT01: RTT segments 0 and 1 */
  #define RADIO_RTT_SEGMENT01_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT01 register.                                */

/* DATA @Bits 0..31 : Data Bits 31 - 0 */
  #define RADIO_RTT_SEGMENT01_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT01_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT01_DATA_Pos) /*!< Bit mask of DATA field.             */


/* RADIO_RTT_SEGMENT23: RTT segments 2 and 3 */
  #define RADIO_RTT_SEGMENT23_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT23 register.                                */

/* DATA @Bits 0..31 : Data Bits 63 - 32 */
  #define RADIO_RTT_SEGMENT23_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT23_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT23_DATA_Pos) /*!< Bit mask of DATA field.             */


