NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* CCABUSY_DISABLE @Bit 12 : Shortcut between event CCABUSY and task DISABLE */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Pos (12UL)    /*!< Position of CCABUSY_DISABLE field.                                   */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Msk (0x1UL << RADIO_SHORTS_CCABUSY_DISABLE_Pos) /*!< Bit mask of CCABUSY_DISABLE field. */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Min (0x0UL)   /*!< Min enumerator value of CCABUSY_DISABLE field.                       */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Max (0x1UL)   /*!< Max enumerator value of CCABUSY_DISABLE field.                       */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                    */

/* FRAMESTART_BCSTART @Bit 13 : Shortcut between event FRAMESTART and task BCSTART */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Pos (13UL) /*!< Position of FRAMESTART_BCSTART field.                                */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Msk (0x1UL << RADIO_SHORTS_FRAMESTART_BCSTART_Pos) /*!< Bit mask of FRAMESTART_BCSTART
                                                                            field.*/
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Min (0x0UL) /*!< Min enumerator value of FRAMESTART_BCSTART field.                   */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Max (0x1UL) /*!< Max enumerator value of FRAMESTART_BCSTART field.                   */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Disabled (0x0UL) /*!< Disable shortcut                                               */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Enabled (0x1UL) /*!< Enable shortcut                                                 */

/* READY_EDSTART @Bit 14 : Shortcut between event READY and task EDSTART */
  #define RADIO_SHORTS_READY_EDSTART_Pos (14UL)      /*!< Position of READY_EDSTART field.                                     */
  #define RADIO_SHORTS_READY_EDSTART_Msk (0x1UL << RADIO_SHORTS_READY_EDSTART_Pos) /*!< Bit mask of READY_EDSTART field.       */
  #define RADIO_SHORTS_READY_EDSTART_Min (0x0UL)     /*!< Min enumerator value of READY_EDSTART field.                         */
  #define RADIO_SHORTS_READY_EDSTART_Max (0x1UL)     /*!< Max enumerator value of READY_EDSTART field.                         */
  #define RADIO_SHORTS_READY_EDSTART_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_READY_EDSTART_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* EDEND_DISABLE @Bit 15 : Shortcut between event EDEND and task DISABLE */
  #define RADIO_SHORTS_EDEND_DISABLE_Pos (15UL)      /*!< Position of EDEND_DISABLE field.                                     */
  #define RADIO_SHORTS_EDEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_EDEND_DISABLE_Pos) /*!< Bit mask of EDEND_DISABLE field.       */
  #define RADIO_SHORTS_EDEND_DISABLE_Min (0x0UL)     /*!< Min enumerator value of EDEND_DISABLE field.                         */
  #define RADIO_SHORTS_EDEND_DISABLE_Max (0x1UL)     /*!< Max enumerator value of EDEND_DISABLE field.                         */
  #define RADIO_SHORTS_EDEND_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_EDEND_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* CCAIDLE_STOP @Bit 16 : Shortcut between event CCAIDLE and task STOP */
  #define RADIO_SHORTS_CCAIDLE_STOP_Pos (16UL)       /*!< Position of CCAIDLE_STOP field.                                      */
  #define RADIO_SHORTS_CCAIDLE_STOP_Msk (0x1UL << RADIO_SHORTS_CCAIDLE_STOP_Pos) /*!< Bit mask of CCAIDLE_STOP field.          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Min (0x0UL)      /*!< Min enumerator value of CCAIDLE_STOP field.                          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Max (0x1UL)      /*!< Max enumerator value of CCAIDLE_STOP field.                          */
  #define RADIO_SHORTS_CCAIDLE_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_CCAIDLE_STOP_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* TXREADY_START @Bit 17 : Shortcut between event TXREADY and task START */
  #define RADIO_SHORTS_TXREADY_START_Pos (17UL)      /*!< Position of TXREADY_START field.                                     */
  #define RADIO_SHORTS_TXREADY_START_Msk (0x1UL << RADIO_SHORTS_TXREADY_START_Pos) /*!< Bit mask of TXREADY_START field.       */
  #define RADIO_SHORTS_TXREADY_START_Min (0x0UL)     /*!< Min enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Max (0x1UL)     /*!< Max enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_TXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* RXREADY_START @Bit 18 : Shortcut between event RXREADY and task START */
  #define RADIO_SHORTS_RXREADY_START_Pos (18UL)      /*!< Position of RXREADY_START field.                                     */
  #define RADIO_SHORTS_RXREADY_START_Msk (0x1UL << RADIO_SHORTS_RXREADY_START_Pos) /*!< Bit mask of RXREADY_START field.       */
  #define RADIO_SHORTS_RXREADY_START_Min (0x0UL)     /*!< Min enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Max (0x1UL)     /*!< Max enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_RXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* PHYEND_DISABLE @Bit 19 : Shortcut between event PHYEND and task DISABLE */
  #define RADIO_SHORTS_PHYEND_DISABLE_Pos (19UL)     /*!< Position of PHYEND_DISABLE field.                                    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos) /*!< Bit mask of PHYEND_DISABLE field.    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Min (0x0UL)    /*!< Min enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Max (0x1UL)    /*!< Max enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define RADIO_SHORTS_PHYEND_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

