NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* EDEND @Bit 15 : Write '1' to disable interrupt for event EDEND */
  #define RADIO_INTENCLR00_EDEND_Pos (15UL)          /*!< Position of EDEND field.                                             */
  #define RADIO_INTENCLR00_EDEND_Msk (0x1UL << RADIO_INTENCLR00_EDEND_Pos) /*!< Bit mask of EDEND field.                       */
  #define RADIO_INTENCLR00_EDEND_Min (0x0UL)         /*!< Min enumerator value of EDEND field.                                 */
  #define RADIO_INTENCLR00_EDEND_Max (0x1UL)         /*!< Max enumerator value of EDEND field.                                 */
  #define RADIO_INTENCLR00_EDEND_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR00_EDEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_EDEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* EDSTOPPED @Bit 16 : Write '1' to disable interrupt for event EDSTOPPED */
  #define RADIO_INTENCLR00_EDSTOPPED_Pos (16UL)      /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTENCLR00_EDSTOPPED_Msk (0x1UL << RADIO_INTENCLR00_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.           */
  #define RADIO_INTENCLR00_EDSTOPPED_Min (0x0UL)     /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENCLR00_EDSTOPPED_Max (0x1UL)     /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENCLR00_EDSTOPPED_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR00_EDSTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR00_EDSTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CCAIDLE @Bit 17 : Write '1' to disable interrupt for event CCAIDLE */
  #define RADIO_INTENCLR00_CCAIDLE_Pos (17UL)        /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTENCLR00_CCAIDLE_Msk (0x1UL << RADIO_INTENCLR00_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                 */
  #define RADIO_INTENCLR00_CCAIDLE_Min (0x0UL)       /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENCLR00_CCAIDLE_Max (0x1UL)       /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENCLR00_CCAIDLE_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR00_CCAIDLE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_CCAIDLE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCABUSY @Bit 18 : Write '1' to disable interrupt for event CCABUSY */
  #define RADIO_INTENCLR00_CCABUSY_Pos (18UL)        /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTENCLR00_CCABUSY_Msk (0x1UL << RADIO_INTENCLR00_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                 */
  #define RADIO_INTENCLR00_CCABUSY_Min (0x0UL)       /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTENCLR00_CCABUSY_Max (0x1UL)       /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTENCLR00_CCABUSY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR00_CCABUSY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_CCABUSY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCASTOPPED @Bit 19 : Write '1' to disable interrupt for event CCASTOPPED */
  #define RADIO_INTENCLR00_CCASTOPPED_Pos (19UL)     /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTENCLR00_CCASTOPPED_Msk (0x1UL << RADIO_INTENCLR00_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.        */
  #define RADIO_INTENCLR00_CCASTOPPED_Min (0x0UL)    /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENCLR00_CCASTOPPED_Max (0x1UL)    /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENCLR00_CCASTOPPED_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR00_CCASTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR00_CCASTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* RATEBOOST @Bit 20 : Write '1' to disable interrupt for event RATEBOOST */
  #define RADIO_INTENCLR00_RATEBOOST_Pos (20UL)      /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTENCLR00_RATEBOOST_Msk (0x1UL << RADIO_INTENCLR00_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.           */
  #define RADIO_INTENCLR00_RATEBOOST_Min (0x0UL)     /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENCLR00_RATEBOOST_Max (0x1UL)     /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENCLR00_RATEBOOST_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR00_RATEBOOST_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR00_RATEBOOST_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* MHRMATCH @Bit 21 : Write '1' to disable interrupt for event MHRMATCH */
  #define RADIO_INTENCLR00_MHRMATCH_Pos (21UL)       /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTENCLR00_MHRMATCH_Msk (0x1UL << RADIO_INTENCLR00_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.              */
  #define RADIO_INTENCLR00_MHRMATCH_Min (0x0UL)      /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENCLR00_MHRMATCH_Max (0x1UL)      /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENCLR00_MHRMATCH_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR00_MHRMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_MHRMATCH_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SYNC @Bit 22 : Write '1' to disable interrupt for event SYNC */
  #define RADIO_INTENCLR00_SYNC_Pos (22UL)           /*!< Position of SYNC field.                                              */
  #define RADIO_INTENCLR00_SYNC_Msk (0x1UL << RADIO_INTENCLR00_SYNC_Pos) /*!< Bit mask of SYNC field.                          */
  #define RADIO_INTENCLR00_SYNC_Min (0x0UL)          /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTENCLR00_SYNC_Max (0x1UL)          /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTENCLR00_SYNC_Clear (0x1UL)        /*!< Disable                                                              */
  #define RADIO_INTENCLR00_SYNC_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_SYNC_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

