NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* PRIVLMAPPING @Bits 9..10 : Capabilities for Privilege mapping */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Pos (9UL)     /*!< Position of PRIVLMAPPING field.                                      */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Msk (0x3UL << SPU_PERIPH_PERM_PRIVLMAPPING_Pos) /*!< Bit mask of PRIVLMAPPING field.    */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Min (0x0UL)   /*!< Min enumerator value of PRIVLMAPPING field.                          */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Max (0x3UL)   /*!< Max enumerator value of PRIVLMAPPING field.                          */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Unprivileged (0x0UL) /*!< This peripheral is always Unprivileged                        */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Privileged (0x1UL) /*!< This peripheral is always Privileged                            */
  #define SPU_PERIPH_PERM_PRIVLMAPPING_UserSelectable (0x2UL) /*!< Privileged or Unprivileged attribute for this peripheral is
                                                                   defined by the PERIPH[n].PERM.PRIVLATTR register*/
  #define SPU_PERIPH_PERM_PRIVLMAPPING_Split (0x3UL) /*!< This peripheral implements Split Privilege                           */

/* PRIVLATTR @Bit 11 : Peripheral privilege mapping */
  #define SPU_PERIPH_PERM_PRIVLATTR_Pos (11UL)       /*!< Position of PRIVLATTR field.                                         */
  #define SPU_PERIPH_PERM_PRIVLATTR_Msk (0x1UL << SPU_PERIPH_PERM_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field.             */
  #define SPU_PERIPH_PERM_PRIVLATTR_Min (0x0UL)      /*!< Min enumerator value of PRIVLATTR field.                             */
  #define SPU_PERIPH_PERM_PRIVLATTR_Max (0x1UL)      /*!< Max enumerator value of PRIVLATTR field.                             */
  #define SPU_PERIPH_PERM_PRIVLATTR_Privileged (0x1UL) /*!< Peripheral is Privileged                                           */
  #define SPU_PERIPH_PERM_PRIVLATTR_Unprivileged (0x0UL) /*!< Peripheral is Unprivileged or Split Privilege                    */

/* DMAPRIVL @Bit 12 : Privilege attribution for peripheral DMA transfers */
  #define SPU_PERIPH_PERM_DMAPRIVL_Pos (12UL)        /*!< Position of DMAPRIVL field.                                          */
  #define SPU_PERIPH_PERM_DMAPRIVL_Msk (0x1UL << SPU_PERIPH_PERM_DMAPRIVL_Pos) /*!< Bit mask of DMAPRIVL field.                */
  #define SPU_PERIPH_PERM_DMAPRIVL_Min (0x0UL)       /*!< Min enumerator value of DMAPRIVL field.                              */
  #define SPU_PERIPH_PERM_DMAPRIVL_Max (0x1UL)       /*!< Max enumerator value of DMAPRIVL field.                              */
  #define SPU_PERIPH_PERM_DMAPRIVL_Privileged (0x1UL) /*!< DMA transfers initiated by this peripheral have the Privilege
                                                           attribute set*/
  #define SPU_PERIPH_PERM_DMAPRIVL_Unprivileged (0x0UL) /*!< DMA transfers initiated by this peripheral have the Unprivileged
                                                             attribute set*/

/* PRESENT @Bit 31 : Indicates if a peripheral is present with peripheral slave index n */
  #define SPU_PERIPH_PERM_PRESENT_Pos (31UL)         /*!< Position of PRESENT field.                                           */
  #define SPU_PERIPH_PERM_PRESENT_Msk (0x1UL << SPU_PERIPH_PERM_PRESENT_Pos) /*!< Bit mask of PRESENT field.                   */
  #define SPU_PERIPH_PERM_PRESENT_Min (0x0UL)        /*!< Min enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_Max (0x1UL)        /*!< Max enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_NotPresent (0x0UL) /*!< Peripheral is not present                                            */
  #define SPU_PERIPH_PERM_PRESENT_IsPresent (0x1UL)  /*!< Peripheral is present                                                */



/* ================================================ Struct SPU_FEATURE_DPPIC ================================================= */
/**
  * @brief DPPIC [SPU_FEATURE_DPPIC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[24];                            /*!< (@ 0x00000000) Security configuration for channel n of DPPIC         */
  __IOM uint32_t  CHG[8];                            /*!< (@ 0x00000060) Security configuration for channel group n of DPPIC   */
} NRF_SPU_FEATURE_DPPIC_Type;                        /*!< Size = 128 (0x080)                                                   */

/* SPU_FEATURE_DPPIC_CH: Security configuration for channel n of DPPIC */
  #define SPU_FEATURE_DPPIC_CH_MaxCount (24UL)       /*!< Max size of CH[24] array.                                            */
  #define SPU_FEATURE_DPPIC_CH_MaxIndex (23UL)       /*!< Max index of CH[24] array.                                           */
  #define SPU_FEATURE_DPPIC_CH_MinIndex (0UL)        /*!< Min index of CH[24] array.                                           */
  #define SPU_FEATURE_DPPIC_CH_ResetValue (0x00100010UL) /*!< Reset value of CH[24] register.                                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Pos (11UL)  /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field.   */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                 */
  #define SPU_FEATURE_DPPIC_CH_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                      */


