NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                  */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Pos) /*!< Bit mask of
                                                                            PRIVLATTR field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                     */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                     */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage              */



/* ================================================= Struct SPU_FEATURE_GPIO ================================================= */
/**
  * @brief GPIO [SPU_FEATURE_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PIN[32];                           /*!< (@ 0x00000000) Security configuration for GPIO[n] PIN[o]             */
} NRF_SPU_FEATURE_GPIO_Type;                         /*!< Size = 128 (0x080)                                                   */
  #define SPU_FEATURE_GPIO_MaxCount (5UL)            /*!< Size of GPIO[5] array.                                               */
  #define SPU_FEATURE_GPIO_MaxIndex (4UL)            /*!< Max index of GPIO[5] array.                                          */
  #define SPU_FEATURE_GPIO_MinIndex (0UL)            /*!< Min index of GPIO[5] array.                                          */

/* SPU_FEATURE_GPIO_PIN: Security configuration for GPIO[n] PIN[o] */
  #define SPU_FEATURE_GPIO_PIN_MaxCount (32UL)       /*!< Max size of PIN[32] array.                                           */
  #define SPU_FEATURE_GPIO_PIN_MaxIndex (31UL)       /*!< Max index of PIN[32] array.                                          */
  #define SPU_FEATURE_GPIO_PIN_MinIndex (0UL)        /*!< Min index of PIN[32] array.                                          */
  #define SPU_FEATURE_GPIO_PIN_ResetValue (0x00100010UL) /*!< Reset value of PIN[32] register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Pos (11UL)  /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field.   */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                 */
  #define SPU_FEATURE_GPIO_PIN_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                      */



/* ================================================= Struct SPU_FEATURE_GRTC ================================================= */
/**
  * @brief GRTC [SPU_FEATURE_GRTC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CC[24];                            /*!< (@ 0x00000000) Security configuration for CC n of GRTC               */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  PWMCONFIG;                         /*!< (@ 0x00000074) Security Configuration for PWMCONFIG of GRTC          */
  __IOM uint32_t  CLK;                               /*!< (@ 0x00000078) Security configuration for CLKOUT/CLKCFG of GRTC      */
  __IOM uint32_t  SYSCOUNTER;                        /*!< (@ 0x0000007C) Security configuration for SYSCOUNTERL/SYSCOUNTERH of
                                                                         GRTC*/
  __IOM uint32_t  INTERRUPT[16];                     /*!< (@ 0x00000080) Security configuration for interrupt n of GRTC        */
} NRF_SPU_FEATURE_GRTC_Type;                         /*!< Size = 192 (0x0C0)                                                   */

/* SPU_FEATURE_GRTC_CC: Security configuration for CC n of GRTC */
  #define SPU_FEATURE_GRTC_CC_MaxCount (24UL)        /*!< Max size of CC[24] array.                                            */
  #define SPU_FEATURE_GRTC_CC_MaxIndex (23UL)        /*!< Max index of CC[24] array.                                           */
  #define SPU_FEATURE_GRTC_CC_MinIndex (0UL)         /*!< Min index of CC[24] array.                                           */
  #define SPU_FEATURE_GRTC_CC_ResetValue (0x00100010UL) /*!< Reset value of CC[24] register.                                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Pos (4UL)      /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CC_SECATTR_Pos) /*!< Bit mask of SECATTR field.           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Min (0x0UL)    /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Max (0x1UL)    /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                         */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                 */

