NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CC_LOCK_Pos (8UL)         /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_CC_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CC_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define SPU_FEATURE_GRTC_CC_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Unlocked (0x0UL)  /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GRTC_CC_LOCK_Locked (0x1UL)    /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Pos (11UL)   /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CC_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field.     */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Min (0x0UL)  /*!< Min enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Max (0x1UL)  /*!< Max enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                  */
  #define SPU_FEATURE_GRTC_CC_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                       */


/* SPU_FEATURE_GRTC_PWMCONFIG: Security Configuration for PWMCONFIG of GRTC */
  #define SPU_FEATURE_GRTC_PWMCONFIG_ResetValue (0x00100010UL) /*!< Reset value of PWMCONFIG register.                         */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                    */
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Pos) /*!< Bit mask of
                                                                            PRIVLATTR field.*/
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                       */
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                       */
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage           */
  #define SPU_FEATURE_GRTC_PWMCONFIG_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                */


/* SPU_FEATURE_GRTC_CLK: Security configuration for CLKOUT/CLKCFG of GRTC */
  #define SPU_FEATURE_GRTC_CLK_ResetValue (0x00100010UL) /*!< Reset value of CLK register.                                     */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Pos (11UL)  /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field.   */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                             */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                 */
  #define SPU_FEATURE_GRTC_CLK_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                      */


