NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* SPU_FEATURE_GRTC_SYSCOUNTER: Security configuration for SYSCOUNTERL/SYSCOUNTERH of GRTC */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_ResetValue (0x00100010UL) /*!< Reset value of SYSCOUNTER register.                       */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                        */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                 */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                         */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos (8UL) /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos) /*!< Bit mask of LOCK field.    */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                            */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset     */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                   */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Pos) /*!< Bit mask of
                                                                            PRIVLATTR field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                      */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                      */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage               */


/* SPU_FEATURE_GRTC_INTERRUPT: Security configuration for interrupt n of GRTC */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxCount (16UL) /*!< Max size of INTERRUPT[16] array.                                     */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxIndex (15UL) /*!< Max index of INTERRUPT[16] array.                                    */
  #define SPU_FEATURE_GRTC_INTERRUPT_MinIndex (0UL)  /*!< Min index of INTERRUPT[16] array.                                    */
  #define SPU_FEATURE_GRTC_INTERRUPT_ResetValue (0x00100010UL) /*!< Reset value of INTERRUPT[16] register.                     */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                    */
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Pos) /*!< Bit mask of
                                                                            PRIVLATTR field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                       */
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                       */
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage           */
  #define SPU_FEATURE_GRTC_INTERRUPT_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                */



/* ================================================ Struct SPU_FEATURE_COEXC ================================================= */
/**
  * @brief COEXC [SPU_FEATURE_COEXC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CCCONF[8];                         /*!< (@ 0x00000000) Configuration of features for CCCONF[n] of COEXC      */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  TURNAROUND[8];                     /*!< (@ 0x00000040) Configuration of features for TURNAROUND[n] of COEXC  */
  __IM  uint32_t  RESERVED1[8];
  __IOM uint32_t  CCMALLOW;                          /*!< (@ 0x00000080) Configuration of features for CCMALLOW of COEXC       */
} NRF_SPU_FEATURE_COEXC_Type;                        /*!< Size = 132 (0x084)                                                   */

/* SPU_FEATURE_COEXC_CCCONF: Configuration of features for CCCONF[n] of COEXC */
  #define SPU_FEATURE_COEXC_CCCONF_MaxCount (8UL)    /*!< Max size of CCCONF[8] array.                                         */
  #define SPU_FEATURE_COEXC_CCCONF_MaxIndex (7UL)    /*!< Max index of CCCONF[8] array.                                        */
  #define SPU_FEATURE_COEXC_CCCONF_MinIndex (0UL)    /*!< Min index of CCCONF[8] array.                                        */
  #define SPU_FEATURE_COEXC_CCCONF_ResetValue (0x00000000UL) /*!< Reset value of CCCONF[8] register.                           */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_SECATTR_Pos) /*!< Bit mask of SECATTR field. */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                             */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                             */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                    */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                            */

