NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Pos (8UL)    /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_LOCK_Pos) /*!< Bit mask of LOCK field.          */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Min (0x0UL)  /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Max (0x1UL)  /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                               */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset        */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                      */
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR
                                                                            field.*/
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                         */
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                         */
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage             */
  #define SPU_FEATURE_COEXC_CCCONF_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                  */


/* SPU_FEATURE_COEXC_TURNAROUND: Configuration of features for TURNAROUND[n] of COEXC */
  #define SPU_FEATURE_COEXC_TURNAROUND_MaxCount (8UL) /*!< Max size of TURNAROUND[8] array.                                    */
  #define SPU_FEATURE_COEXC_TURNAROUND_MaxIndex (7UL) /*!< Max index of TURNAROUND[8] array.                                   */
  #define SPU_FEATURE_COEXC_TURNAROUND_MinIndex (0UL) /*!< Min index of TURNAROUND[8] array.                                   */
  #define SPU_FEATURE_COEXC_TURNAROUND_ResetValue (0x00000000UL) /*!< Reset value of TURNAROUND[8] register.                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                  */
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Pos) /*!< Bit mask of
                                                                            PRIVLATTR field.*/
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                     */
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                     */
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage         */
  #define SPU_FEATURE_COEXC_TURNAROUND_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage              */


/* SPU_FEATURE_COEXC_CCMALLOW: Configuration of features for CCMALLOW of COEXC */
  #define SPU_FEATURE_COEXC_CCMALLOW_ResetValue (0x00000000UL) /*!< Reset value of CCMALLOW register.                          */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

