NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* =================================================== Struct USBHSCORE_HC =================================================== */
/**
  * @brief HC [USBHSCORE_HC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHAR;                              /*!< (@ 0x00000000) Host Channel Characteristics Register 0               */
  __IOM uint32_t  SPLT;                              /*!< (@ 0x00000004) Host Channel Split Control Register 0                 */
  __IOM uint32_t  INT;                               /*!< (@ 0x00000008) Host Channel Interrupt Register 0                     */
  __IOM uint32_t  INTMSK;                            /*!< (@ 0x0000000C) Host Channel Interrupt Mask Register 0                */
  __IOM uint32_t  TSIZ;                              /*!< (@ 0x00000010) Host Channel Transfer Size Register 0                 */
  __IOM uint32_t  DMA;                               /*!< (@ 0x00000014) Host Channel DMA Address Register 0                   */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DMAB;                              /*!< (@ 0x0000001C) Host Channel DMA Buffer Address Register 0            */
} NRF_USBHSCORE_HC_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define USBHSCORE_HC_MaxCount (16UL)               /*!< Size of HC[16] array.                                                */
  #define USBHSCORE_HC_MaxIndex (15UL)               /*!< Max index of HC[16] array.                                           */
  #define USBHSCORE_HC_MinIndex (0UL)                /*!< Min index of HC[16] array.                                           */

/* USBHSCORE_HC_CHAR: Host Channel Characteristics Register 0 */
  #define USBHSCORE_HC_CHAR_ResetValue (0x00000000UL) /*!< Reset value of CHAR register.                                       */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_HC_CHAR_MPS_Pos (0UL)            /*!< Position of MPS field.                                               */
  #define USBHSCORE_HC_CHAR_MPS_Msk (0x7FFUL << USBHSCORE_HC_CHAR_MPS_Pos) /*!< Bit mask of MPS field.                         */

/* EPNUM @Bits 11..14 : Endpoint Number (EPNum) */
  #define USBHSCORE_HC_CHAR_EPNUM_Pos (11UL)         /*!< Position of EPNUM field.                                             */
  #define USBHSCORE_HC_CHAR_EPNUM_Msk (0xFUL << USBHSCORE_HC_CHAR_EPNUM_Pos) /*!< Bit mask of EPNUM field.                     */
  #define USBHSCORE_HC_CHAR_EPNUM_Min (0x0UL)        /*!< Min enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_Max (0xFUL)        /*!< Max enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT0 (0x0UL)     /*!< End point 0                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT1 (0x1UL)     /*!< End point 1                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT2 (0x2UL)     /*!< End point 2                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT3 (0x3UL)     /*!< End point 3                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT4 (0x4UL)     /*!< End point 4                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT5 (0x5UL)     /*!< End point 5                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT6 (0x6UL)     /*!< End point 6                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT7 (0x7UL)     /*!< End point 7                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT8 (0x8UL)     /*!< End point 8                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT9 (0x9UL)     /*!< End point 9                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT10 (0xAUL)    /*!< End point 10                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT11 (0xBUL)    /*!< End point 11                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT12 (0xCUL)    /*!< End point 12                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT13 (0xDUL)    /*!< End point 13                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT14 (0xEUL)    /*!< End point 14                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT15 (0xFUL)    /*!< End point 15                                                         */

/* EPDIR @Bit 15 : Endpoint Direction (EPDir) */
  #define USBHSCORE_HC_CHAR_EPDIR_Pos (15UL)         /*!< Position of EPDIR field.                                             */
  #define USBHSCORE_HC_CHAR_EPDIR_Msk (0x1UL << USBHSCORE_HC_CHAR_EPDIR_Pos) /*!< Bit mask of EPDIR field.                     */
  #define USBHSCORE_HC_CHAR_EPDIR_Min (0x0UL)        /*!< Min enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_Max (0x1UL)        /*!< Max enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_OUT (0x0UL)        /*!< OUT Direction                                                        */
  #define USBHSCORE_HC_CHAR_EPDIR_IN (0x1UL)         /*!< IN Direction                                                         */

/* LSPDDEV @Bit 17 : Low-Speed Device (LSpdDev) */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Pos (17UL)       /*!< Position of LSPDDEV field.                                           */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Msk (0x1UL << USBHSCORE_HC_CHAR_LSPDDEV_Pos) /*!< Bit mask of LSPDDEV field.               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Min (0x0UL)      /*!< Min enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Max (0x1UL)      /*!< Max enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_DISABLED (0x0UL) /*!< Not Communicating with low speed device                              */
  #define USBHSCORE_HC_CHAR_LSPDDEV_ENABLED (0x1UL)  /*!< Communicating with low speed device                                  */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_HC_CHAR_EPTYPE_Pos (18UL)        /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_HC_CHAR_EPTYPE_Msk (0x3UL << USBHSCORE_HC_CHAR_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                  */
  #define USBHSCORE_HC_CHAR_EPTYPE_Min (0x0UL)       /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_Max (0x3UL)       /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_CTRL (0x0UL)      /*!< Control                                                              */
  #define USBHSCORE_HC_CHAR_EPTYPE_ISOC (0x1UL)      /*!< Isochronous                                                          */
  #define USBHSCORE_HC_CHAR_EPTYPE_BULK (0x2UL)      /*!< Bulk                                                                 */
  #define USBHSCORE_HC_CHAR_EPTYPE_INTERR (0x3UL)    /*!< Interrupt                                                            */

/* EC @Bits 20..21 : Multi Count (MC) / Error Count (EC) */
  #define USBHSCORE_HC_CHAR_EC_Pos (20UL)            /*!< Position of EC field.                                                */
  #define USBHSCORE_HC_CHAR_EC_Msk (0x3UL << USBHSCORE_HC_CHAR_EC_Pos) /*!< Bit mask of EC field.                              */
  #define USBHSCORE_HC_CHAR_EC_Min (0x1UL)           /*!< Min enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_Max (0x3UL)           /*!< Max enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_TRANSONE (0x1UL)      /*!< 1 transaction                                                        */
  #define USBHSCORE_HC_CHAR_EC_TRANSTWO (0x2UL)      /*!< 2 transactions to be issued for this endpoint per microframe         */
  #define USBHSCORE_HC_CHAR_EC_TRANSTHREE (0x3UL)    /*!< 3 transactions to be issued for this endpoint per microframe         */

/* DEVADDR @Bits 22..28 : Device Address (DevAddr) */
  #define USBHSCORE_HC_CHAR_DEVADDR_Pos (22UL)       /*!< Position of DEVADDR field.                                           */
  #define USBHSCORE_HC_CHAR_DEVADDR_Msk (0x7FUL << USBHSCORE_HC_CHAR_DEVADDR_Pos) /*!< Bit mask of DEVADDR field.              */

/* ODDFRM @Bit 29 : Odd Frame (OddFrm) */
  #define USBHSCORE_HC_CHAR_ODDFRM_Pos (29UL)        /*!< Position of ODDFRM field.                                            */
  #define USBHSCORE_HC_CHAR_ODDFRM_Msk (0x1UL << USBHSCORE_HC_CHAR_ODDFRM_Pos) /*!< Bit mask of ODDFRM field.                  */
  #define USBHSCORE_HC_CHAR_ODDFRM_Min (0x0UL)       /*!< Min enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_Max (0x1UL)       /*!< Max enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_EFRAME (0x0UL)    /*!< Even Frame Transfer                                                  */
  #define USBHSCORE_HC_CHAR_ODDFRM_OFRAME (0x1UL)    /*!< Odd Frame Transfer                                                   */

/* CHDIS @Bit 30 : Channel Disable (ChDis) */
  #define USBHSCORE_HC_CHAR_CHDIS_Pos (30UL)         /*!< Position of CHDIS field.                                             */
  #define USBHSCORE_HC_CHAR_CHDIS_Msk (0x1UL << USBHSCORE_HC_CHAR_CHDIS_Pos) /*!< Bit mask of CHDIS field.                     */
  #define USBHSCORE_HC_CHAR_CHDIS_Min (0x0UL)        /*!< Min enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_Max (0x1UL)        /*!< Max enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_INACTIVE (0x0UL)   /*!< Transmit/Recieve normal                                              */
  #define USBHSCORE_HC_CHAR_CHDIS_ACTIVE (0x1UL)     /*!< Stop transmitting/receiving data on channel                          */

/* CHENA @Bit 31 : Channel Enable (ChEna) */
  #define USBHSCORE_HC_CHAR_CHENA_Pos (31UL)         /*!< Position of CHENA field.                                             */
  #define USBHSCORE_HC_CHAR_CHENA_Msk (0x1UL << USBHSCORE_HC_CHAR_CHENA_Pos) /*!< Bit mask of CHENA field.                     */
  #define USBHSCORE_HC_CHAR_CHENA_Min (0x0UL)        /*!< Min enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_Max (0x1UL)        /*!< Max enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_DISABLED (0x0UL)   /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure is not yet ready. If Scatter/Gather mode is disabled,
                                                          indicates that the channel is disabled.*/
  #define USBHSCORE_HC_CHAR_CHENA_ENABLED (0x1UL)    /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure and data buffer with data is set up and this channel can
                                                          access the descriptor. If Scatter/Gather mode is disabled, indicates
                                                          that the channel is enabled.*/


/* USBHSCORE_HC_SPLT: Host Channel Split Control Register 0 */
  #define USBHSCORE_HC_SPLT_ResetValue (0x00000000UL) /*!< Reset value of SPLT register.                                       */

