NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* XCSXACTERR @Bit 12 : Excessive Transaction Error (XCS_XACT_ERR) */
  #define USBHSCORE_HC_INT_XCSXACTERR_Pos (12UL)     /*!< Position of XCSXACTERR field.                                        */
  #define USBHSCORE_HC_INT_XCSXACTERR_Msk (0x1UL << USBHSCORE_HC_INT_XCSXACTERR_Pos) /*!< Bit mask of XCSXACTERR field.        */
  #define USBHSCORE_HC_INT_XCSXACTERR_Min (0x0UL)    /*!< Min enumerator value of XCSXACTERR field.                            */
  #define USBHSCORE_HC_INT_XCSXACTERR_Max (0x1UL)    /*!< Max enumerator value of XCSXACTERR field.                            */
  #define USBHSCORE_HC_INT_XCSXACTERR_INACTIVE (0x0UL) /*!< No Excessive Transaction Error                                     */
  #define USBHSCORE_HC_INT_XCSXACTERR_ACTIVE (0x1UL) /*!< Excessive Transaction Error                                          */

/* DESCLSTROLLINTR @Bit 13 : Descriptor rollover interrupt (DESC_LST_ROLLIntr) */
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_Pos (13UL) /*!< Position of DESCLSTROLLINTR field.                                  */
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_Msk (0x1UL << USBHSCORE_HC_INT_DESCLSTROLLINTR_Pos) /*!< Bit mask of DESCLSTROLLINTR
                                                                            field.*/
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_Min (0x0UL) /*!< Min enumerator value of DESCLSTROLLINTR field.                     */
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_Max (0x1UL) /*!< Max enumerator value of DESCLSTROLLINTR field.                     */
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_INACTIVE (0x0UL) /*!< No Descriptor rollover interrupt                              */
  #define USBHSCORE_HC_INT_DESCLSTROLLINTR_ACTIVE (0x1UL) /*!< Descriptor rollover interrupt                                   */


/* USBHSCORE_HC_INTMSK: Host Channel Interrupt Mask Register 0 */
  #define USBHSCORE_HC_INTMSK_ResetValue (0x00000000UL) /*!< Reset value of INTMSK register.                                   */

/* XFERCOMPLMSK @Bit 0 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos (0UL) /*!< Position of XFERCOMPLMSK field.                                      */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos) /*!< Bit mask of XFERCOMPLMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Min (0x0UL) /*!< Min enumerator value of XFERCOMPLMSK field.                        */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Max (0x1UL) /*!< Max enumerator value of XFERCOMPLMSK field.                        */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_MASK (0x0UL) /*!< Transfer Completed Mask                                           */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_NOMASK (0x1UL) /*!< No Transfer Completed Mask                                      */

/* CHHLTDMSK @Bit 1 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos (1UL)    /*!< Position of CHHLTDMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos) /*!< Bit mask of CHHLTDMSK field.     */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Min (0x0UL)  /*!< Min enumerator value of CHHLTDMSK field.                             */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Max (0x1UL)  /*!< Max enumerator value of CHHLTDMSK field.                             */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_MASK (0x0UL) /*!< Channel Halted Mask                                                  */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_NOMASK (0x1UL) /*!< No Channel Halted Mask                                             */

/* AHBERRMSK @Bit 2 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Pos (2UL)    /*!< Position of AHBERRMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_AHBERRMSK_Pos) /*!< Bit mask of AHBERRMSK field.     */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Min (0x0UL)  /*!< Min enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Max (0x1UL)  /*!< Max enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_MASK (0x0UL) /*!< AHB Error Mask                                                       */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_NOMASK (0x1UL) /*!< No AHB Error Mask                                                  */

/* STALLMSK @Bit 3 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Pos (3UL)     /*!< Position of STALLMSK field.                                          */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_STALLMSK_Pos) /*!< Bit mask of STALLMSK field.        */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Min (0x0UL)   /*!< Min enumerator value of STALLMSK field.                              */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Max (0x1UL)   /*!< Max enumerator value of STALLMSK field.                              */
  #define USBHSCORE_HC_INTMSK_STALLMSK_MASK (0x0UL)  /*!< Mask STALL Response Received Interrupt                               */
  #define USBHSCORE_HC_INTMSK_STALLMSK_NOMASK (0x1UL) /*!< No STALL Response Received Interrupt Mask                           */

/* NAKMSK @Bit 4 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Pos (4UL)       /*!< Position of NAKMSK field.                                            */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NAKMSK_Pos) /*!< Bit mask of NAKMSK field.              */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Min (0x0UL)     /*!< Min enumerator value of NAKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Max (0x1UL)     /*!< Max enumerator value of NAKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_NAKMSK_MASK (0x0UL)    /*!< Mask NAK Response Received Interrupt                                 */
  #define USBHSCORE_HC_INTMSK_NAKMSK_NOMASK (0x1UL)  /*!< No NAK Response Received Interrupt Mask                              */

/* ACKMSK @Bit 5 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Pos (5UL)       /*!< Position of ACKMSK field.                                            */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_ACKMSK_Pos) /*!< Bit mask of ACKMSK field.              */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Min (0x0UL)     /*!< Min enumerator value of ACKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Max (0x1UL)     /*!< Max enumerator value of ACKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_ACKMSK_MASK (0x0UL)    /*!< Mask ACK Response Received/Transmitted Interrupt                     */
  #define USBHSCORE_HC_INTMSK_ACKMSK_NOMASK (0x1UL)  /*!< No ACK Response Received/Transmitted Interrupt Mask                  */

/* NYETMSK @Bit 6 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Pos (6UL)      /*!< Position of NYETMSK field.                                           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NYETMSK_Pos) /*!< Bit mask of NYETMSK field.           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Min (0x0UL)    /*!< Min enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Max (0x1UL)    /*!< Max enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_MASK (0x0UL)   /*!< Mask NYET Response Received Interrupt                                */
  #define USBHSCORE_HC_INTMSK_NYETMSK_NOMASK (0x1UL) /*!< No NYET Response Received Interrupt Mask                             */

/* XACTERRMSK @Bit 7 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Pos (7UL)   /*!< Position of XACTERRMSK field.                                        */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XACTERRMSK_Pos) /*!< Bit mask of XACTERRMSK field.  */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Min (0x0UL) /*!< Min enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Max (0x1UL) /*!< Max enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_MASK (0x0UL) /*!< Mask Transaction Error                                              */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_NOMASK (0x1UL) /*!< No Transaction Error Mask                                         */

