NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* BBLERRMSK @Bit 8 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Pos (8UL)    /*!< Position of BBLERRMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_BBLERRMSK_Pos) /*!< Bit mask of BBLERRMSK field.     */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Min (0x0UL)  /*!< Min enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Max (0x1UL)  /*!< Max enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_MASK (0x0UL) /*!< Mask Babble Error                                                    */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_NOMASK (0x1UL) /*!< No Babble Error Mask                                               */

/* FRMOVRUNMSK @Bit 9 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos (9UL)  /*!< Position of FRMOVRUNMSK field.                                       */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos) /*!< Bit mask of FRMOVRUNMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Min (0x0UL) /*!< Min enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Max (0x1UL) /*!< Max enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_MASK (0x0UL) /*!< Mask Overrun Mask                                                  */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_NOMASK (0x1UL) /*!< No Frame Overrun Mask                                            */

/* DATATGLERRMSK @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos (10UL) /*!< Position of DATATGLERRMSK field.                                   */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos) /*!< Bit mask of DATATGLERRMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Min (0x0UL) /*!< Min enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Max (0x1UL) /*!< Max enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_MASK (0x0UL) /*!< Mask Data Toggle Error                                           */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_NOMASK (0x1UL) /*!< No Data Toggle Error Mask                                      */

/* BNAINTRMSK @Bit 11 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_Pos (11UL)  /*!< Position of BNAINTRMSK field.                                        */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_BNAINTRMSK_Pos) /*!< Bit mask of BNAINTRMSK field.  */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_Min (0x0UL) /*!< Min enumerator value of BNAINTRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_Max (0x1UL) /*!< Max enumerator value of BNAINTRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_MASK (0x0UL) /*!< BNA Interrupt Masked                                                */
  #define USBHSCORE_HC_INTMSK_BNAINTRMSK_NOMASK (0x1UL) /*!< BNA Interrupt not masked                                          */

/* DESCLSTROLLINTRMSK @Bit 13 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_Pos (13UL) /*!< Position of DESCLSTROLLINTRMSK field.                         */
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_Pos) /*!< Bit mask of
                                                                            DESCLSTROLLINTRMSK field.*/
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_Min (0x0UL) /*!< Min enumerator value of DESCLSTROLLINTRMSK field.            */
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_Max (0x1UL) /*!< Max enumerator value of DESCLSTROLLINTRMSK field.            */
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_MASK (0x0UL) /*!< Descriptor Rollover Interrupt Mask                          */
  #define USBHSCORE_HC_INTMSK_DESCLSTROLLINTRMSK_NOMASK (0x1UL) /*!< Descriptor Rollover Interrupt not masked                  */


/* USBHSCORE_HC_TSIZ: Host Channel Transfer Size Register 0 */
  #define USBHSCORE_HC_TSIZ_ResetValue (0x00000000UL) /*!< Reset value of TSIZ register.                                       */

/* XFERSIZE @Bits 0..18 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Pos (0UL)       /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_HC_TSIZ_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.        */

/* PKTCNT @Bits 19..28 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Pos (19UL)        /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Msk (0x3FFUL << USBHSCORE_HC_TSIZ_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.                */

/* PID @Bits 29..30 : PID (Pid) */
  #define USBHSCORE_HC_TSIZ_PID_Pos (29UL)           /*!< Position of PID field.                                               */
  #define USBHSCORE_HC_TSIZ_PID_Msk (0x3UL << USBHSCORE_HC_TSIZ_PID_Pos) /*!< Bit mask of PID field.                           */
  #define USBHSCORE_HC_TSIZ_PID_Min (0x0UL)          /*!< Min enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_Max (0x3UL)          /*!< Max enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_DATA0 (0x0UL)        /*!< DATA0                                                                */
  #define USBHSCORE_HC_TSIZ_PID_DATA2 (0x1UL)        /*!< DATA2                                                                */
  #define USBHSCORE_HC_TSIZ_PID_DATA1 (0x2UL)        /*!< DATA1                                                                */
  #define USBHSCORE_HC_TSIZ_PID_MDATA (0x3UL)        /*!< MDATA (non-control)/SETUP (control)                                  */

/* DOPNG @Bit 31 : Do Ping (DoPng) */
  #define USBHSCORE_HC_TSIZ_DOPNG_Pos (31UL)         /*!< Position of DOPNG field.                                             */
  #define USBHSCORE_HC_TSIZ_DOPNG_Msk (0x1UL << USBHSCORE_HC_TSIZ_DOPNG_Pos) /*!< Bit mask of DOPNG field.                     */
  #define USBHSCORE_HC_TSIZ_DOPNG_Min (0x0UL)        /*!< Min enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_Max (0x1UL)        /*!< Max enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_NOPING (0x0UL)     /*!< No ping protocol                                                     */
  #define USBHSCORE_HC_TSIZ_DOPNG_PING (0x1UL)       /*!< Ping protocol                                                        */


/* USBHSCORE_HC_DMA: Host Channel DMA Address Register 0 */
  #define USBHSCORE_HC_DMA_ResetValue (0x00000000UL) /*!< Reset value of DMA register.                                         */

/* DMAADDR @Bits 0..31 : In Buffer DMA Mode: */
  #define USBHSCORE_HC_DMA_DMAADDR_Pos (0UL)         /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_HC_DMA_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_HC_DMA_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.          */


/* USBHSCORE_HC_DMAB: Host Channel DMA Buffer Address Register 0 */
  #define USBHSCORE_HC_DMAB_ResetValue (0x00000000UL) /*!< Reset value of DMAB register.                                       */

