NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* DMAEN @Bit 5 : Mode: Host and device. DMA Enable (DMAEn) */
  #define USBHSCORE_GAHBCFG_DMAEN_Pos (5UL)          /*!< Position of DMAEN field.                                             */
  #define USBHSCORE_GAHBCFG_DMAEN_Msk (0x1UL << USBHSCORE_GAHBCFG_DMAEN_Pos) /*!< Bit mask of DMAEN field.                     */
  #define USBHSCORE_GAHBCFG_DMAEN_Min (0x0UL)        /*!< Min enumerator value of DMAEN field.                                 */
  #define USBHSCORE_GAHBCFG_DMAEN_Max (0x1UL)        /*!< Max enumerator value of DMAEN field.                                 */
  #define USBHSCORE_GAHBCFG_DMAEN_COMPLETERMODE (0x0UL) /*!< Core operates in Completer mode                                   */
  #define USBHSCORE_GAHBCFG_DMAEN_DMAMODE (0x1UL)    /*!< Core operates in a DMA mode                                          */

/* NPTXFEMPLVL @Bit 7 : Mode: Host and device. Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl) */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos (7UL)    /*!< Position of NPTXFEMPLVL field.                                       */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Msk (0x1UL << USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos) /*!< Bit mask of NPTXFEMPLVL field.   */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Min (0x0UL)  /*!< Min enumerator value of NPTXFEMPLVL field.                           */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Max (0x1UL)  /*!< Max enumerator value of NPTXFEMPLVL field.                           */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_HALFEMPTY (0x0UL) /*!< DIEPINTn.TxFEmp interrupt indicates that the Non-Periodic TxFIFO
                                                               is half empty or that the IN Endpoint TxFIFO is half empty.*/
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_EMPTY (0x1UL) /*!< GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is
                                                           completely empty or that the IN Endpoint TxFIFO is completely empty.*/

/* PTXFEMPLVL @Bit 8 : Mode: Host only. Periodic TxFIFO Empty Level (PTxFEmpLvl) */
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_Pos (8UL)     /*!< Position of PTXFEMPLVL field.                                        */
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_Msk (0x1UL << USBHSCORE_GAHBCFG_PTXFEMPLVL_Pos) /*!< Bit mask of PTXFEMPLVL field.      */
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_Min (0x0UL)   /*!< Min enumerator value of PTXFEMPLVL field.                            */
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_Max (0x1UL)   /*!< Max enumerator value of PTXFEMPLVL field.                            */
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_HALFEMPTY (0x0UL) /*!< GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is
                                                              half empty.*/
  #define USBHSCORE_GAHBCFG_PTXFEMPLVL_EMPTY (0x1UL) /*!< GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is
                                                          completely empty.*/

/* REMMEMSUPP @Bit 21 : Mode: Host and Device. Remote Memory Support (RemMemSupp) */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Pos (21UL)    /*!< Position of REMMEMSUPP field.                                        */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Msk (0x1UL << USBHSCORE_GAHBCFG_REMMEMSUPP_Pos) /*!< Bit mask of REMMEMSUPP field.      */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Min (0x0UL)   /*!< Min enumerator value of REMMEMSUPP field.                            */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Max (0x1UL)   /*!< Max enumerator value of REMMEMSUPP field.                            */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_DISABLED (0x0UL) /*!< Remote Memory Support Feature disabled                            */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_ENABLED (0x1UL) /*!< Remote Memory Support Feature enabled                              */

/* NOTIALLDMAWRIT @Bit 22 : Mode: Host and Device. Notify All DMA Write Transactions (NotiAllDmaWrit) */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos (22UL) /*!< Position of NOTIALLDMAWRIT field.                                   */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Msk (0x1UL << USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos) /*!< Bit mask of NOTIALLDMAWRIT
                                                                            field.*/
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Min (0x0UL) /*!< Min enumerator value of NOTIALLDMAWRIT field.                      */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Max (0x1UL) /*!< Max enumerator value of NOTIALLDMAWRIT field.                      */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_LASTTRANS (0x0UL) /*!< (unspecified)                                                */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_ALLTRANS (0x1UL) /*!< The core asserts int_dma_req for all the DMA write transactions
                                                                 on the AHB interface along with int_dma_done,
                                                                 chep_last_transact and chep_number signal informations. The
                                                                 core waits for sys_dma_done signal for all the DMA write
                                                                 transactions in order to complete the transfer of a particular
                                                                 Channel/Endpoint*/

/* AHBSINGLE @Bit 23 : Mode: Host and Device. AHB Single Support (AHBSingle) */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Pos (23UL)     /*!< Position of AHBSINGLE field.                                         */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Msk (0x1UL << USBHSCORE_GAHBCFG_AHBSINGLE_Pos) /*!< Bit mask of AHBSINGLE field.         */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Min (0x0UL)    /*!< Min enumerator value of AHBSINGLE field.                             */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Max (0x1UL)    /*!< Max enumerator value of AHBSINGLE field.                             */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_INCRBURST (0x0UL) /*!< The remaining data in the transfer is sent using INCR burst size  */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_SINGLEBURST (0x1UL) /*!< The remaining data in the transfer is sent using Single burst
                                                               size*/

/* INVDESCENDIANESS @Bit 24 : Mode: Host and Device. Invert Descriptor Endianess (InvDescEndianess) */
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_Pos (24UL) /*!< Position of INVDESCENDIANESS field.                               */
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_Msk (0x1UL << USBHSCORE_GAHBCFG_INVDESCENDIANESS_Pos) /*!< Bit mask of
                                                                            INVDESCENDIANESS field.*/
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_Min (0x0UL) /*!< Min enumerator value of INVDESCENDIANESS field.                  */
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_Max (0x1UL) /*!< Max enumerator value of INVDESCENDIANESS field.                  */
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_DISABLE (0x0UL) /*!< Descriptor Endianness is same as AHB Requester Endianness    */
  #define USBHSCORE_GAHBCFG_INVDESCENDIANESS_ENABLE (0x1UL) /*!< Descriptor Endianness is opposite to AHB Requester Endianness */

/* LOAEOPCHECKCLKSBYTE @Bits 25..26 : Mode: Host. Number of clock cycles to check for EOP SE0 for LOA logic */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_Pos (25UL) /*!< Position of LOAEOPCHECKCLKSBYTE field.                         */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_Msk (0x3UL << USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_Pos) /*!< Bit mask of
                                                                            LOAEOPCHECKCLKSBYTE field.*/
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_Min (0x1UL) /*!< Min enumerator value of LOAEOPCHECKCLKSBYTE field.            */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_Max (0x2UL) /*!< Max enumerator value of LOAEOPCHECKCLKSBYTE field.            */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_ONE (0x1UL) /*!< Check for 2 clocks of EOP SE0                                 */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSBYTE_TWO (0x2UL) /*!< Check for 3 clocks of EOP SE0                                 */

/* LOAEOPCHECKCLKSWORD @Bits 27..28 : Mode: Host. Number of clock cycles to check for EOP SE0 for LOA logic */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_Pos (27UL) /*!< Position of LOAEOPCHECKCLKSWORD field.                         */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_Msk (0x3UL << USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_Pos) /*!< Bit mask of
                                                                            LOAEOPCHECKCLKSWORD field.*/
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_Min (0x1UL) /*!< Min enumerator value of LOAEOPCHECKCLKSWORD field.            */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_Max (0x2UL) /*!< Max enumerator value of LOAEOPCHECKCLKSWORD field.            */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_ONE (0x1UL) /*!< Check for 2 clocks of EOP SE0                                 */
  #define USBHSCORE_GAHBCFG_LOAEOPCHECKCLKSWORD_TWO (0x2UL) /*!< Check for 3 clocks of EOP SE0                                 */


