NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* FRMCNTRRST @Bit 2 : Mode: Host only. Host Frame Counter Reset (FrmCntrRst) */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Pos (2UL)     /*!< Position of FRMCNTRRST field.                                        */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Msk (0x1UL << USBHSCORE_GRSTCTL_FRMCNTRRST_Pos) /*!< Bit mask of FRMCNTRRST field.      */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Min (0x0UL)   /*!< Min enumerator value of FRMCNTRRST field.                            */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Max (0x1UL)   /*!< Max enumerator value of FRMCNTRRST field.                            */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_NOTACTIVE (0x0UL) /*!< No reset                                                         */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_ACTIVE (0x1UL) /*!< Host Frame Counter Reset                                            */

/* RXFFLSH @Bit 4 : Mode: Host and Device. RxFIFO Flush (RxFFlsh) */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Pos (4UL)        /*!< Position of RXFFLSH field.                                           */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_RXFFLSH_Pos) /*!< Bit mask of RXFFLSH field.               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Min (0x0UL)      /*!< Min enumerator value of RXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Max (0x1UL)      /*!< Max enumerator value of RXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_INACTIVE (0x0UL) /*!< Does not flush the entire RxFIFO                                     */
  #define USBHSCORE_GRSTCTL_RXFFLSH_ACTIVE (0x1UL)   /*!< Flushes the entire RxFIFO                                            */

/* TXFFLSH @Bit 5 : Mode: Host and Device. TxFIFO Flush (TxFFlsh) */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Pos (5UL)        /*!< Position of TXFFLSH field.                                           */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_TXFFLSH_Pos) /*!< Bit mask of TXFFLSH field.               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Min (0x0UL)      /*!< Min enumerator value of TXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Max (0x1UL)      /*!< Max enumerator value of TXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_INACTIVE (0x0UL) /*!< No Flush                                                             */
  #define USBHSCORE_GRSTCTL_TXFFLSH_ACTIVE (0x1UL)   /*!< Selectively flushes a single or all transmit FIFOs                   */

/* TXFNUM @Bits 6..10 : Mode: Host and Device. TxFIFO Number (TxFNum) */
  #define USBHSCORE_GRSTCTL_TXFNUM_Pos (6UL)         /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_GRSTCTL_TXFNUM_Msk (0x1FUL << USBHSCORE_GRSTCTL_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.                 */
  #define USBHSCORE_GRSTCTL_TXFNUM_Min (0x00UL)      /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_GRSTCTL_TXFNUM_Max (0x10UL)      /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF0 (0x00UL)     /*!< -Periodic TxFIFO flush in host mode -Periodic TxFIFO 0 flush in device
                                                          mode when in shared FIFO operation -TXFIFO 0 flush in device mode when
                                                          in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF1 (0x01UL)     /*!< -Periodic TxFIFO flush in host mode -Periodic TxFIFO 1 flush in device
                                                          mode when in shared FIFO operation -TXFIFO 1 flush in device mode when
                                                          in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF2 (0x02UL)     /*!< -Periodic TxFIFO 2 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 2 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF3 (0x03UL)     /*!< -Periodic TxFIFO 3 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 3 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF4 (0x04UL)     /*!< -Periodic TxFIFO 4 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 4 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF5 (0x05UL)     /*!< -Periodic TxFIFO 5 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 5 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF6 (0x06UL)     /*!< -Periodic TxFIFO 6 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 6 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF7 (0x07UL)     /*!< -Periodic TxFIFO 7 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 7 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF8 (0x08UL)     /*!< -Periodic TxFIFO 8 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 8 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF9 (0x09UL)     /*!< -Periodic TxFIFO 9 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 9 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF10 (0x0AUL)    /*!< -Periodic TxFIFO 10 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 10 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF11 (0x0BUL)    /*!< -Periodic TxFIFO 11 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 11 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF12 (0x0CUL)    /*!< -Periodic TxFIFO 12 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 12 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF13 (0x0DUL)    /*!< -Periodic TxFIFO 13 flush in Device mode when in shared FIFO operation
                                                          -TXFIFO 13 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF14 (0x0EUL)    /*!< -Periodic TxFIFO 14 flush in Device mode when in shared FIFO operation
                                                          -TXFIFO 14 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF15 (0x0FUL)    /*!< -Periodic TxFIFO 15 flush in Device mode when in shared FIFO operation
                                                          - TXFIFO 15 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF16 (0x10UL)    /*!< Flush all the transmit FIFOs in device or host mode                  */

