NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* PWRDNSWTCH @Bit 5 : Power Down Switch (PwrDnSwtch) */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Pos (5UL)      /*!< Position of PWRDNSWTCH field.                                        */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNSWTCH_Pos) /*!< Bit mask of PWRDNSWTCH field.        */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Min (0x0UL)    /*!< Min enumerator value of PWRDNSWTCH field.                            */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Max (0x1UL)    /*!< Max enumerator value of PWRDNSWTCH field.                            */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_ON (0x0UL)     /*!< The controller is in ON state                                        */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_OFF (0x1UL)    /*!< The controller is in OFF state                                       */

/* DISABLEVBUS @Bit 6 : DisableVBUS */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Pos (6UL)     /*!< Position of DISABLEVBUS field.                                       */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Msk (0x1UL << USBHSCORE_GPWRDN_DISABLEVBUS_Pos) /*!< Bit mask of DISABLEVBUS field.     */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Min (0x0UL)   /*!< Min enumerator value of DISABLEVBUS field.                           */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Max (0x1UL)   /*!< Max enumerator value of DISABLEVBUS field.                           */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_DISABLED (0x0UL) /*!< Host mode:HPRT0.PrtPwr was not programmed to 0, and in Device
                                                             mode:Session Valid*/
  #define USBHSCORE_GPWRDN_DISABLEVBUS_ENABLED (0x1UL) /*!< Host mode:HPRT0.PrtPwr was programmed to 0 and in Device
                                                            mode:Session End*/

/* LNSTSCHNG @Bit 7 : Line State Change (LnStsChng) */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Pos (7UL)       /*!< Position of LNSTSCHNG field.                                         */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Msk (0x1UL << USBHSCORE_GPWRDN_LNSTSCHNG_Pos) /*!< Bit mask of LNSTSCHNG field.           */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Min (0x0UL)     /*!< Min enumerator value of LNSTSCHNG field.                             */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Max (0x1UL)     /*!< Max enumerator value of LNSTSCHNG field.                             */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_DISABLED (0x0UL) /*!< No LineState change on USB                                          */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_ENABLED (0x1UL) /*!< LineState change on USB                                              */

/* LINESTAGECHANGEMSK @Bit 8 : LineStageChangeMsk */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Pos (8UL) /*!< Position of LINESTAGECHANGEMSK field.                             */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Msk (0x1UL << USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Pos) /*!< Bit mask of
                                                                            LINESTAGECHANGEMSK field.*/
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Min (0x0UL) /*!< Min enumerator value of LINESTAGECHANGEMSK field.               */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Max (0x1UL) /*!< Max enumerator value of LINESTAGECHANGEMSK field.               */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_MASK (0x0UL) /*!< Mask for LineStateChange Interrupt                             */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_NOMASK (0x1UL) /*!< No LineStateChange Interrupt Mask                            */

/* RESETDETECTED @Bit 9 : ResetDetected */
  #define USBHSCORE_GPWRDN_RESETDETECTED_Pos (9UL)   /*!< Position of RESETDETECTED field.                                     */
  #define USBHSCORE_GPWRDN_RESETDETECTED_Msk (0x1UL << USBHSCORE_GPWRDN_RESETDETECTED_Pos) /*!< Bit mask of RESETDETECTED
                                                                            field.*/
  #define USBHSCORE_GPWRDN_RESETDETECTED_Min (0x0UL) /*!< Min enumerator value of RESETDETECTED field.                         */
  #define USBHSCORE_GPWRDN_RESETDETECTED_Max (0x1UL) /*!< Max enumerator value of RESETDETECTED field.                         */
  #define USBHSCORE_GPWRDN_RESETDETECTED_DISABLED (0x0UL) /*!< Reset not detected                                              */
  #define USBHSCORE_GPWRDN_RESETDETECTED_ENABLED (0x1UL) /*!< Reset detected                                                   */

/* RESETDETMSK @Bit 10 : ResetDetMsk */
  #define USBHSCORE_GPWRDN_RESETDETMSK_Pos (10UL)    /*!< Position of RESETDETMSK field.                                       */
  #define USBHSCORE_GPWRDN_RESETDETMSK_Msk (0x1UL << USBHSCORE_GPWRDN_RESETDETMSK_Pos) /*!< Bit mask of RESETDETMSK field.     */
  #define USBHSCORE_GPWRDN_RESETDETMSK_Min (0x0UL)   /*!< Min enumerator value of RESETDETMSK field.                           */
  #define USBHSCORE_GPWRDN_RESETDETMSK_Max (0x1UL)   /*!< Max enumerator value of RESETDETMSK field.                           */
  #define USBHSCORE_GPWRDN_RESETDETMSK_MASK (0x0UL)  /*!< Mask for ResetDetect Interrupt                                       */
  #define USBHSCORE_GPWRDN_RESETDETMSK_NOMASK (0x1UL) /*!< No ResetDetect Interrupt Mask                                       */

/* DISCONNECTDETECT @Bit 11 : DisconnectDetect */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Pos (11UL) /*!< Position of DISCONNECTDETECT field.                                */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Msk (0x1UL << USBHSCORE_GPWRDN_DISCONNECTDETECT_Pos) /*!< Bit mask of
                                                                            DISCONNECTDETECT field.*/
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Min (0x0UL) /*!< Min enumerator value of DISCONNECTDETECT field.                   */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Max (0x1UL) /*!< Max enumerator value of DISCONNECTDETECT field.                   */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_DISABLED (0x0UL) /*!< Disconnect not detected                                      */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_ENABLED (0x1UL) /*!< Disconnect detected                                           */

/* DISCONNECTDETECTMSK @Bit 12 : DisconnectDetectMsk */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Pos (12UL) /*!< Position of DISCONNECTDETECTMSK field.                          */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Pos) /*!< Bit mask of
                                                                            DISCONNECTDETECTMSK field.*/
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Min (0x0UL) /*!< Min enumerator value of DISCONNECTDETECTMSK field.             */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Max (0x1UL) /*!< Max enumerator value of DISCONNECTDETECTMSK field.             */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_MASK (0x0UL) /*!< Mask for DisconnectDetect Interrupt                           */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_NOMASK (0x1UL) /*!< No DisconnectDetect Interrupt Mask                          */

