NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* INEPINT6 @Bit 6 : IN Endpoint 6 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT6_Pos (6UL)         /*!< Position of INEPINT6 field.                                          */
  #define USBHSCORE_DAINT_INEPINT6_Msk (0x1UL << USBHSCORE_DAINT_INEPINT6_Pos) /*!< Bit mask of INEPINT6 field.                */
  #define USBHSCORE_DAINT_INEPINT6_Min (0x0UL)       /*!< Min enumerator value of INEPINT6 field.                              */
  #define USBHSCORE_DAINT_INEPINT6_Max (0x1UL)       /*!< Max enumerator value of INEPINT6 field.                              */
  #define USBHSCORE_DAINT_INEPINT6_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT6_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT7 @Bit 7 : IN Endpoint 7 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT7_Pos (7UL)         /*!< Position of INEPINT7 field.                                          */
  #define USBHSCORE_DAINT_INEPINT7_Msk (0x1UL << USBHSCORE_DAINT_INEPINT7_Pos) /*!< Bit mask of INEPINT7 field.                */
  #define USBHSCORE_DAINT_INEPINT7_Min (0x0UL)       /*!< Min enumerator value of INEPINT7 field.                              */
  #define USBHSCORE_DAINT_INEPINT7_Max (0x1UL)       /*!< Max enumerator value of INEPINT7 field.                              */
  #define USBHSCORE_DAINT_INEPINT7_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT7_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT8 @Bit 8 : IN Endpoint 8 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT8_Pos (8UL)         /*!< Position of INEPINT8 field.                                          */
  #define USBHSCORE_DAINT_INEPINT8_Msk (0x1UL << USBHSCORE_DAINT_INEPINT8_Pos) /*!< Bit mask of INEPINT8 field.                */
  #define USBHSCORE_DAINT_INEPINT8_Min (0x0UL)       /*!< Min enumerator value of INEPINT8 field.                              */
  #define USBHSCORE_DAINT_INEPINT8_Max (0x1UL)       /*!< Max enumerator value of INEPINT8 field.                              */
  #define USBHSCORE_DAINT_INEPINT8_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT8_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT9 @Bit 9 : IN Endpoint 9 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT9_Pos (9UL)         /*!< Position of INEPINT9 field.                                          */
  #define USBHSCORE_DAINT_INEPINT9_Msk (0x1UL << USBHSCORE_DAINT_INEPINT9_Pos) /*!< Bit mask of INEPINT9 field.                */
  #define USBHSCORE_DAINT_INEPINT9_Min (0x0UL)       /*!< Min enumerator value of INEPINT9 field.                              */
  #define USBHSCORE_DAINT_INEPINT9_Max (0x1UL)       /*!< Max enumerator value of INEPINT9 field.                              */
  #define USBHSCORE_DAINT_INEPINT9_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT9_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT10 @Bit 10 : IN Endpoint 10 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT10_Pos (10UL)       /*!< Position of INEPINT10 field.                                         */
  #define USBHSCORE_DAINT_INEPINT10_Msk (0x1UL << USBHSCORE_DAINT_INEPINT10_Pos) /*!< Bit mask of INEPINT10 field.             */
  #define USBHSCORE_DAINT_INEPINT10_Min (0x0UL)      /*!< Min enumerator value of INEPINT10 field.                             */
  #define USBHSCORE_DAINT_INEPINT10_Max (0x1UL)      /*!< Max enumerator value of INEPINT10 field.                             */
  #define USBHSCORE_DAINT_INEPINT10_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT10_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* INEPINT11 @Bit 11 : IN Endpoint 11 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT11_Pos (11UL)       /*!< Position of INEPINT11 field.                                         */
  #define USBHSCORE_DAINT_INEPINT11_Msk (0x1UL << USBHSCORE_DAINT_INEPINT11_Pos) /*!< Bit mask of INEPINT11 field.             */
  #define USBHSCORE_DAINT_INEPINT11_Min (0x0UL)      /*!< Min enumerator value of INEPINT11 field.                             */
  #define USBHSCORE_DAINT_INEPINT11_Max (0x1UL)      /*!< Max enumerator value of INEPINT11 field.                             */
  #define USBHSCORE_DAINT_INEPINT11_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT11_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* INEPINT12 @Bit 12 : IN Endpoint 12 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT12_Pos (12UL)       /*!< Position of INEPINT12 field.                                         */
  #define USBHSCORE_DAINT_INEPINT12_Msk (0x1UL << USBHSCORE_DAINT_INEPINT12_Pos) /*!< Bit mask of INEPINT12 field.             */
  #define USBHSCORE_DAINT_INEPINT12_Min (0x0UL)      /*!< Min enumerator value of INEPINT12 field.                             */
  #define USBHSCORE_DAINT_INEPINT12_Max (0x1UL)      /*!< Max enumerator value of INEPINT12 field.                             */
  #define USBHSCORE_DAINT_INEPINT12_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT12_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* INEPINT13 @Bit 13 : IN Endpoint 13 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT13_Pos (13UL)       /*!< Position of INEPINT13 field.                                         */
  #define USBHSCORE_DAINT_INEPINT13_Msk (0x1UL << USBHSCORE_DAINT_INEPINT13_Pos) /*!< Bit mask of INEPINT13 field.             */
  #define USBHSCORE_DAINT_INEPINT13_Min (0x0UL)      /*!< Min enumerator value of INEPINT13 field.                             */
  #define USBHSCORE_DAINT_INEPINT13_Max (0x1UL)      /*!< Max enumerator value of INEPINT13 field.                             */
  #define USBHSCORE_DAINT_INEPINT13_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT13_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

