NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* INEPMSK11 @Bit 11 : IN Endpoint 11 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Pos (11UL)    /*!< Position of INEPMSK11 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK11_Pos) /*!< Bit mask of INEPMSK11 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Min (0x0UL)   /*!< Min enumerator value of INEPMSK11 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Max (0x1UL)   /*!< Max enumerator value of INEPMSK11 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK11_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK11_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* INEPMSK12 @Bit 12 : IN Endpoint 12 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK12_Pos (12UL)    /*!< Position of INEPMSK12 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK12_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK12_Pos) /*!< Bit mask of INEPMSK12 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK12_Min (0x0UL)   /*!< Min enumerator value of INEPMSK12 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK12_Max (0x1UL)   /*!< Max enumerator value of INEPMSK12 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK12_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK12_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* INEPMSK13 @Bit 13 : IN Endpoint 13 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK13_Pos (13UL)    /*!< Position of INEPMSK13 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK13_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK13_Pos) /*!< Bit mask of INEPMSK13 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK13_Min (0x0UL)   /*!< Min enumerator value of INEPMSK13 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK13_Max (0x1UL)   /*!< Max enumerator value of INEPMSK13 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK13_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK13_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* INEPMSK14 @Bit 14 : IN Endpoint 14 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK14_Pos (14UL)    /*!< Position of INEPMSK14 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK14_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK14_Pos) /*!< Bit mask of INEPMSK14 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK14_Min (0x0UL)   /*!< Min enumerator value of INEPMSK14 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK14_Max (0x1UL)   /*!< Max enumerator value of INEPMSK14 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK14_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK14_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* INEPMSK15 @Bit 15 : IN Endpoint 15 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK15_Pos (15UL)    /*!< Position of INEPMSK15 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK15_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK15_Pos) /*!< Bit mask of INEPMSK15 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK15_Min (0x0UL)   /*!< Min enumerator value of INEPMSK15 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK15_Max (0x1UL)   /*!< Max enumerator value of INEPMSK15 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK15_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK15_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK0 @Bit 16 : OUT Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Pos (16UL)    /*!< Position of OUTEPMSK0 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK0_Pos) /*!< Bit mask of OUTEPMSK0 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK0 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK0 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_MASK (0x0UL)  /*!< Mask OUT Endpoint 0 Interrupt                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK1 @Bit 17 : OUT Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Pos (17UL)    /*!< Position of OUTEPMSK1 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK1_Pos) /*!< Bit mask of OUTEPMSK1 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK1 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK1 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK2 @Bit 18 : OUT Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Pos (18UL)    /*!< Position of OUTEPMSK2 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK2_Pos) /*!< Bit mask of OUTEPMSK2 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK2 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK2 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK3 @Bit 19 : OUT Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Pos (19UL)    /*!< Position of OUTEPMSK3 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK3_Pos) /*!< Bit mask of OUTEPMSK3 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK3 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK3 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK4 @Bit 20 : OUT Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Pos (20UL)    /*!< Position of OUTEPMSK4 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK4_Pos) /*!< Bit mask of OUTEPMSK4 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK4 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK4 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

