NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* OPMODEXCVRSELCHIRPENCORRDIS @Bit 17 : Disable the STAR fix added for correcting Opmode and XcvrSel on UTMI Interface when
                                         reset is detected in suspend state. */

  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos (17UL) /*!< Position of OPMODEXCVRSELCHIRPENCORRDIS field.      */
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos)
                                                                            /*!< Bit mask of OPMODEXCVRSELCHIRPENCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Min (0x0UL) /*!< Min enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Max (0x1UL) /*!< Max enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_ENABLE_FIX (0x0UL) /*!< Valid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_DISABLE_FIX (0x1UL) /*!< Invalid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/

/* TXVALIDDEASSERTIONCORRDIS @Bit 18 : Disable the STAR fix added for correcting Txvalid deassertion on UTMI Interface when soft
                                       disconnect is done. */

  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos (18UL) /*!< Position of TXVALIDDEASSERTIONCORRDIS field.          */
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos) /*!<
                                                                            Bit mask of TXVALIDDEASSERTIONCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Min (0x0UL) /*!< Min enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Max (0x1UL) /*!< Max enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            after receiving Txready from the PHY*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_DISABLE_FIX (0x1UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            without waiting for Txready from the PHY*/

/* HOSTNOXFERAFTERPRTDISFIXDIS @Bit 19 : Disable the STAR fix added for correcting Host behavior when port is disabled. */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos (19UL) /*!< Position of HOSTNOXFERAFTERPRTDISFIXDIS field.      */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos)
                                                                            /*!< Bit mask of HOSTNOXFERAFTERPRTDISFIXDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Min (0x0UL) /*!< Min enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Max (0x1UL) /*!< Max enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is not asserted when port is
                                                                            disabled*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_DISABLE_FIX (0x1UL) /*!< Txvalid can be asserted when port is
                                                                            disabled*/

/* LINESTATESE0FILTERFOREOPDIS @Bit 21 : Disable the STAR fix added for filtering SE0 from the linestate during EOP detection..
                                         */

  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_Pos (21UL) /*!< Position of LINESTATESE0FILTERFOREOPDIS field.      */
  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_Pos)
                                                                            /*!< Bit mask of LINESTATESE0FILTERFOREOPDIS field.*/
  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_Min (0x0UL) /*!< Min enumerator value of LINESTATESE0FILTERFOREOPDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_Max (0x1UL) /*!< Max enumerator value of LINESTATESE0FILTERFOREOPDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_ENABLE_FIX (0x0UL) /*!< Filter for linestate is enabled             */
  #define USBHSCORE_GSTARFXDIS_LINESTATESE0FILTERFOREOPDIS_DISABLE_FIX (0x1UL) /*!< Filter for linestate is not enabled        */

/* DMPULLDOWNUPDATEINOTGFORHIBANDPP @Bit 22 : Disable the STAR fix added for utmiotg_dmpulldown update in Hibernation and
                                              Partial power down modes. */

  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_Pos (22UL) /*!< Position of DMPULLDOWNUPDATEINOTGFORHIBANDPP
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_Msk (0x1UL << USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_Pos)
                                                                            /*!< Bit mask of DMPULLDOWNUPDATEINOTGFORHIBANDPP
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_Min (0x0UL) /*!< Min enumerator value of
                                                                            DMPULLDOWNUPDATEINOTGFORHIBANDPP field.*/
  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_Max (0x1UL) /*!< Max enumerator value of
                                                                            DMPULLDOWNUPDATEINOTGFORHIBANDPP field.*/
  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_ENABLE_FIX (0x0UL) /*!< utmiotg_dmpulldown logic for hiberabtion
                                                                            and partial power down is enabled*/
  #define USBHSCORE_GSTARFXDIS_DMPULLDOWNUPDATEINOTGFORHIBANDPP_DISABLE_FIX (0x1UL) /*!< utmiotg_dmpulldown logic for
                                                                            hiberabtion and partial power down is not enabled*/

/* CHIRPDETECTIONUPDTHSTDIS @Bit 23 : Disable the Chirp detection logic change in host mode. */
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_Pos (23UL) /*!< Position of CHIRPDETECTIONUPDTHSTDIS field.            */
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_Pos) /*!<
                                                                            Bit mask of CHIRPDETECTIONUPDTHSTDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_Min (0x0UL) /*!< Min enumerator value of CHIRPDETECTIONUPDTHSTDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_Max (0x1UL) /*!< Max enumerator value of CHIRPDETECTIONUPDTHSTDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_ENABLE_FIX (0x0UL) /*!< Chirp detection logic in MAC PRT module depends
                                                                            on the delayed WAIT_CHIRP state and only valid chirp
                                                                            K from device is detected*/
  #define USBHSCORE_GSTARFXDIS_CHIRPDETECTIONUPDTHSTDIS_DISABLE_FIX (0x1UL) /*!< Chirp detection logic depends on the WAIT_CHIRP
                                                                            state and controller might detect false chirp K from
                                                                            device*/

/* PROGRAMMABLESE0DURATIONTODETECTEOP @Bit 24 : Disable the STAR fix added for programmable se0 duration to detect EOP in Host
                                                mode . */

  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_Pos (24UL) /*!< Position of PROGRAMMABLESE0DURATIONTODETECTEOP
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_Msk (0x1UL << USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_Pos)
                                                                            /*!< Bit mask of PROGRAMMABLESE0DURATIONTODETECTEOP
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_Min (0x0UL) /*!< Min enumerator value of
                                                                            PROGRAMMABLESE0DURATIONTODETECTEOP field.*/
  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_Max (0x1UL) /*!< Max enumerator value of
                                                                            PROGRAMMABLESE0DURATIONTODETECTEOP field.*/
  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_ENABLE_FIX (0x0UL) /*!< Programmable se0 duration to detect
                                                                            EOP in Host mode is enabled*/
  #define USBHSCORE_GSTARFXDIS_PROGRAMMABLESE0DURATIONTODETECTEOP_DISABLE_FIX (0x1UL) /*!< Programmable se0 duration to detect
                                                                            EOP in Host mode is disabled*/

/* ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT @Bit 25 : Disable the STAR fix added for h2pd_txf_0len_pkt signal which is passing
                                                      through a level synchronizer. */

  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_Pos (25UL) /*!< Position of
                                                                            ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT field.*/
  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_Msk (0x1UL << USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_Pos)
                                                                            /*!< Bit mask of
                                                                            ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT field.*/
  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_Min (0x0UL) /*!< Min enumerator value of
                                                                            ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT field.*/
  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_Max (0x1UL) /*!< Max enumerator value of
                                                                            ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT field.*/
  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_ENABLE_FIX (0x0UL) /*!< level synchroniser for
                                                                            h2pd_txf_0len_pkt is enabled and disabled dummy
                                                                            synchronizer*/
  #define USBHSCORE_GSTARFXDIS_ENABLELEVELSYNCHRONISERFORH2PDTXF0LENPKT_DISABLE_FIX (0x1UL) /*!< level synchroniser for
                                                                            h2pd_txf_0len_pkt is disabled and connected through
                                                                            dummy synchronizer*/

