NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* ACCESSTYPE @Bit 30 : Type of access. */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Pos (30UL) /*!< Position of ACCESSTYPE field.                                       */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Msk (0x1UL << VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Pos) /*!< Bit mask of ACCESSTYPE
                                                                            field.*/
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Min (0x0UL) /*!< Min enumerator value of ACCESSTYPE field.                          */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Max (0x1UL) /*!< Max enumerator value of ACCESSTYPE field.                          */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Memory (0x0UL) /*!< Memory access.                                                  */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Peripheral (0x1UL) /*!< Peripheral register access.                                 */

/* SELECTJOBENABLE @Bit 31 : Enables generation of event EVENTS_SELECTJOBDONE. */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Pos (31UL) /*!< Position of SELECTJOBENABLE field.                             */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Msk (0x1UL << VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Pos) /*!< Bit mask of
                                                                            SELECTJOBENABLE field.*/
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBENABLE field.                */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBENABLE field.                */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Disable (0x0UL) /*!< Event is not generated.                                   */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Enable (0x1UL) /*!< Event is generated.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            VPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct VPR_DEBUGIF ==================================================== */
/**
  * @brief DEBUGIF [VPR_DEBUGIF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DATA0;                             /*!< (@ 0x00000010) Abstract Data 0. Read/write data for argument 0       */
  __IOM uint32_t  DATA1;                             /*!< (@ 0x00000014) Abstract Data 1. Read/write data for argument 1       */
  __IM  uint32_t  RESERVED1[10];
  __IOM uint32_t  DMCONTROL;                         /*!< (@ 0x00000040) Debug Module Control                                  */
  __IM  uint32_t  DMSTATUS;                          /*!< (@ 0x00000044) Debug Module Status                                   */
  __IOM uint32_t  HARTINFO;                          /*!< (@ 0x00000048) Hart Information                                      */
  __IOM uint32_t  HALTSUM1;                          /*!< (@ 0x0000004C) Halt Summary 1                                        */
  __IOM uint32_t  HAWINDOWSEL;                       /*!< (@ 0x00000050) Hart Array Window Select                              */
  __IOM uint32_t  HAWINDOW;                          /*!< (@ 0x00000054) Hart Array Window                                     */
  __IOM uint32_t  ABSTRACTCS;                        /*!< (@ 0x00000058) Abstract Control and Status                           */
  __OM  uint32_t  ABSTRACTCMD;                       /*!< (@ 0x0000005C) Abstract command                                      */
  __IOM uint32_t  ABSTRACTAUTO;                      /*!< (@ 0x00000060) Abstract Command Autoexec                             */
  __IOM uint32_t  CONFSTRPTR[4];                     /*!< (@ 0x00000064) Configuration String Pointer [n]                      */
  __IOM uint32_t  NEXTDM;                            /*!< (@ 0x00000074) Next Debug Module                                     */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  PROGBUF[16];                       /*!< (@ 0x00000080) Program Buffer [n]                                    */
  __IOM uint32_t  AUTHDATA;                          /*!< (@ 0x000000C0) Authentication Data                                   */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  HALTSUM2;                          /*!< (@ 0x000000D0) Halt Summary 2                                        */
  __IOM uint32_t  HALTSUM3;                          /*!< (@ 0x000000D4) Halt Summary 3                                        */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SBADDRESS3;                        /*!< (@ 0x000000DC) System Bus Addres 127:96                              */
  __IOM uint32_t  SBCS;                              /*!< (@ 0x000000E0) System Bus Access Control and Status                  */
  __IOM uint32_t  SBADDRESS0;                        /*!< (@ 0x000000E4) System Bus Addres 31:0                                */
  __IOM uint32_t  SBADDRESS1;                        /*!< (@ 0x000000E8) System Bus Addres 63:32                               */
  __IOM uint32_t  SBADDRESS2;                        /*!< (@ 0x000000EC) System Bus Addres 95:64                               */
  __IOM uint32_t  SBDATA0;                           /*!< (@ 0x000000F0) System Bus Data 31:0                                  */
  __IOM uint32_t  SBDATA1;                           /*!< (@ 0x000000F4) System Bus Data 63:32                                 */
  __IOM uint32_t  SBDATA2;                           /*!< (@ 0x000000F8) System Bus Data 95:64                                 */
  __IOM uint32_t  SBDATA3;                           /*!< (@ 0x000000FC) System Bus Data 127:96                                */
  __IOM uint32_t  HALTSUM0;                          /*!< (@ 0x00000100) Halt summary 0                                        */
} NRF_VPR_DEBUGIF_Type;                              /*!< Size = 260 (0x104)                                                   */

/* VPR_DEBUGIF_DATA0: Abstract Data 0. Read/write data for argument 0 */
  #define VPR_DEBUGIF_DATA0_ResetValue (0x00000000UL) /*!< Reset value of DATA0 register.                                      */

