NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN4_Pos (4UL)          /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN4_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN4_Pos) /*!< Bit mask of PIN4 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN4_Min (0x0UL)        /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN4_Max (0x1UL)        /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN4_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN4_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN5_Pos (5UL)          /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN5_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN5_Pos) /*!< Bit mask of PIN5 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN5_Min (0x0UL)        /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN5_Max (0x1UL)        /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN5_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN5_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN6_Pos (6UL)          /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN6_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN6_Pos) /*!< Bit mask of PIN6 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN6_Min (0x0UL)        /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN6_Max (0x1UL)        /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN6_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN6_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN7_Pos (7UL)          /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN7_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN7_Pos) /*!< Bit mask of PIN7 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN7_Min (0x0UL)        /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN7_Max (0x1UL)        /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN7_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN7_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN8_Pos (8UL)          /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN8_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN8_Pos) /*!< Bit mask of PIN8 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN8_Min (0x0UL)        /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN8_Max (0x1UL)        /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN8_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN8_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN9_Pos (9UL)          /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN9_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN9_Pos) /*!< Bit mask of PIN9 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN9_Min (0x0UL)        /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN9_Max (0x1UL)        /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN9_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN9_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN10_Pos (10UL)        /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN10_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN10_Pos) /*!< Bit mask of PIN10 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN10_Min (0x0UL)       /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN10_Max (0x1UL)       /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN10_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN10_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN11_Pos (11UL)        /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN11_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN11_Pos) /*!< Bit mask of PIN11 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN11_Min (0x0UL)       /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN11_Max (0x1UL)       /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN11_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN11_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN12_Pos (12UL)        /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN12_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN12_Pos) /*!< Bit mask of PIN12 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN12_Min (0x0UL)       /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN12_Max (0x1UL)       /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN12_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN12_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN13_Pos (13UL)        /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN13_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN13_Pos) /*!< Bit mask of PIN13 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN13_Min (0x0UL)       /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN13_Max (0x1UL)       /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN13_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN13_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN14_Pos (14UL)        /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN14_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN14_Pos) /*!< Bit mask of PIN14 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN14_Min (0x0UL)       /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN14_Max (0x1UL)       /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN14_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN14_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN15_Pos (15UL)        /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_DIRB_PIN15_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN15_Pos) /*!< Bit mask of PIN15 field.                   */
  #define VPRCSR_NORDIC_DIRB_PIN15_Min (0x0UL)       /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN15_Max (0x1UL)       /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIRB_PIN15_INPUT (0x0UL)     /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN15_OUTPUT (0x1UL)    /*!< Pin is set as output                                                 */


/**
  * @brief DIROUT [VPRCSR_NORDIC_DIROUT] DIR and OUT concatenation
  */
  #define VPRCSR_NORDIC_DIROUT (0x00000BC6ul)
  #define VPRCSR_NORDIC_DIROUT_ResetValue (0x00000000UL) /*!< Reset value of DIROUT register.                                  */

/* OUT @Bits 0..15 : GPIO Output */
  #define VPRCSR_NORDIC_DIROUT_OUT_Pos (0UL)         /*!< Position of OUT field.                                               */
  #define VPRCSR_NORDIC_DIROUT_OUT_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUT_OUT_Pos) /*!< Bit mask of OUT field.                  */

