NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* DIR0 @Bit 16 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR0_Pos (16UL)       /*!< Position of DIR0 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR0_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR0_Pos) /*!< Bit mask of DIR0 field.                  */

/* DIR1 @Bit 17 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR1_Pos (17UL)       /*!< Position of DIR1 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR1_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR1_Pos) /*!< Bit mask of DIR1 field.                  */

/* DIR2 @Bit 18 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR2_Pos (18UL)       /*!< Position of DIR2 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR2_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR2_Pos) /*!< Bit mask of DIR2 field.                  */

/* DIR3 @Bit 19 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR3_Pos (19UL)       /*!< Position of DIR3 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR3_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR3_Pos) /*!< Bit mask of DIR3 field.                  */

/* DIR4 @Bit 20 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR4_Pos (20UL)       /*!< Position of DIR4 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR4_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR4_Pos) /*!< Bit mask of DIR4 field.                  */

/* DIR5 @Bit 21 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR5_Pos (21UL)       /*!< Position of DIR5 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR5_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR5_Pos) /*!< Bit mask of DIR5 field.                  */

/* DIR6 @Bit 22 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR6_Pos (22UL)       /*!< Position of DIR6 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR6_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR6_Pos) /*!< Bit mask of DIR6 field.                  */

/* DIR7 @Bit 23 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR7_Pos (23UL)       /*!< Position of DIR7 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR7_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR7_Pos) /*!< Bit mask of DIR7 field.                  */

/* DIR8 @Bit 24 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR8_Pos (24UL)       /*!< Position of DIR8 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR8_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR8_Pos) /*!< Bit mask of DIR8 field.                  */

/* DIR9 @Bit 25 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR9_Pos (25UL)       /*!< Position of DIR9 field.                                              */
  #define VPRCSR_NORDIC_DIROUT_DIR9_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR9_Pos) /*!< Bit mask of DIR9 field.                  */

/* DIR10 @Bit 26 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR10_Pos (26UL)      /*!< Position of DIR10 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR10_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR10_Pos) /*!< Bit mask of DIR10 field.               */

/* DIR11 @Bit 27 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR11_Pos (27UL)      /*!< Position of DIR11 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR11_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR11_Pos) /*!< Bit mask of DIR11 field.               */

/* DIR12 @Bit 28 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR12_Pos (28UL)      /*!< Position of DIR12 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR12_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR12_Pos) /*!< Bit mask of DIR12 field.               */

/* DIR13 @Bit 29 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR13_Pos (29UL)      /*!< Position of DIR13 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR13_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR13_Pos) /*!< Bit mask of DIR13 field.               */

/* DIR14 @Bit 30 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR14_Pos (30UL)      /*!< Position of DIR14 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR14_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR14_Pos) /*!< Bit mask of DIR14 field.               */

/* DIR15 @Bit 31 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR15_Pos (31UL)      /*!< Position of DIR15 field.                                             */
  #define VPRCSR_NORDIC_DIROUT_DIR15_Msk (0x1UL << VPRCSR_NORDIC_DIROUT_DIR15_Pos) /*!< Bit mask of DIR15 field.               */


/**
  * @brief DIROUTB [VPRCSR_NORDIC_DIROUTB] Concatenation of DIRB and OUTB
  */
  #define VPRCSR_NORDIC_DIROUTB (0x00000BC7ul)
  #define VPRCSR_NORDIC_DIROUTB_ResetValue (0x00000000UL) /*!< Reset value of DIROUTB register.                                */

/* OUTB @Bits 0..15 : Buffered GPIO Output */
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Pos (0UL)       /*!< Position of OUTB field.                                              */
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUTB_OUTB_Pos) /*!< Bit mask of OUTB field.             */

/* DIRB0 @Bit 16 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB0_Pos (16UL)     /*!< Position of DIRB0 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB0_Pos) /*!< Bit mask of DIRB0 field.             */

/* DIRB1 @Bit 17 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB1_Pos (17UL)     /*!< Position of DIRB1 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB1_Pos) /*!< Bit mask of DIRB1 field.             */

/* DIRB2 @Bit 18 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB2_Pos (18UL)     /*!< Position of DIRB2 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB2_Pos) /*!< Bit mask of DIRB2 field.             */

/* DIRB3 @Bit 19 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB3_Pos (19UL)     /*!< Position of DIRB3 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB3_Pos) /*!< Bit mask of DIRB3 field.             */

/* DIRB4 @Bit 20 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB4_Pos (20UL)     /*!< Position of DIRB4 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB4_Pos) /*!< Bit mask of DIRB4 field.             */

/* DIRB5 @Bit 21 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB5_Pos (21UL)     /*!< Position of DIRB5 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB5_Pos) /*!< Bit mask of DIRB5 field.             */

