NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
/* DIR1 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Pos (17UL)    /*!< Position of DIR1 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR1_Pos) /*!< Bit mask of DIR1 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Min (0x0UL)   /*!< Min enumerator value of DIR1 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Max (0x1UL)   /*!< Max enumerator value of DIR1 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR2 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Pos (18UL)    /*!< Position of DIR2 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR2_Pos) /*!< Bit mask of DIR2 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Min (0x0UL)   /*!< Min enumerator value of DIR2 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Max (0x1UL)   /*!< Max enumerator value of DIR2 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR3 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Pos (19UL)    /*!< Position of DIR3 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR3_Pos) /*!< Bit mask of DIR3 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Min (0x0UL)   /*!< Min enumerator value of DIR3 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Max (0x1UL)   /*!< Max enumerator value of DIR3 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR4 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Pos (20UL)    /*!< Position of DIR4 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR4_Pos) /*!< Bit mask of DIR4 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Min (0x0UL)   /*!< Min enumerator value of DIR4 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Max (0x1UL)   /*!< Max enumerator value of DIR4 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR5 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Pos (21UL)    /*!< Position of DIR5 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR5_Pos) /*!< Bit mask of DIR5 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Min (0x0UL)   /*!< Min enumerator value of DIR5 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Max (0x1UL)   /*!< Max enumerator value of DIR5 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR6 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Pos (22UL)    /*!< Position of DIR6 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR6_Pos) /*!< Bit mask of DIR6 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Min (0x0UL)   /*!< Min enumerator value of DIR6 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Max (0x1UL)   /*!< Max enumerator value of DIR6 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR7 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Pos (23UL)    /*!< Position of DIR7 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR7_Pos) /*!< Bit mask of DIR7 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Min (0x0UL)   /*!< Min enumerator value of DIR7 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Max (0x1UL)   /*!< Max enumerator value of DIR7 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR8 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Pos (24UL)    /*!< Position of DIR8 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR8_Pos) /*!< Bit mask of DIR8 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Min (0x0UL)   /*!< Min enumerator value of DIR8 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Max (0x1UL)   /*!< Max enumerator value of DIR8 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR9 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Pos (25UL)    /*!< Position of DIR9 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR9_Pos) /*!< Bit mask of DIR9 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Min (0x0UL)   /*!< Min enumerator value of DIR9 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Max (0x1UL)   /*!< Max enumerator value of DIR9 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* DIR10 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Pos (26UL)   /*!< Position of DIR10 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR10_Pos) /*!< Bit mask of DIR10 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Min (0x0UL)  /*!< Min enumerator value of DIR10 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Max (0x1UL)  /*!< Max enumerator value of DIR10 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* DIR11 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Pos (27UL)   /*!< Position of DIR11 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR11_Pos) /*!< Bit mask of DIR11 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Min (0x0UL)  /*!< Min enumerator value of DIR11 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Max (0x1UL)  /*!< Max enumerator value of DIR11 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* DIR12 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Pos (28UL)   /*!< Position of DIR12 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR12_Pos) /*!< Bit mask of DIR12 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Min (0x0UL)  /*!< Min enumerator value of DIR12 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Max (0x1UL)  /*!< Max enumerator value of DIR12 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

