NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_types.h
  #define VPRCSR_NORDIC_OUTMODEB_SEL_Pos (24UL)      /*!< Position of SEL field.                                               */
  #define VPRCSR_NORDIC_OUTMODEB_SEL_Msk (0xFUL << VPRCSR_NORDIC_OUTMODEB_SEL_Pos) /*!< Bit mask of SEL field.                 */
  #define VPRCSR_NORDIC_OUTMODEB_SEL_Min (0x0UL)     /*!< Min value of SEL field.                                              */
  #define VPRCSR_NORDIC_OUTMODEB_SEL_Max (0xFUL)     /*!< Max size of SEL field.                                               */


/**
  * @brief INMODEB [VPRCSR_NORDIC_INMODEB] Buffered INMODE register
  */
  #define VPRCSR_NORDIC_INMODEB (0x00000BE5ul)
  #define VPRCSR_NORDIC_INMODEB_ResetValue (0x00000000UL) /*!< Reset value of INMODEB register.                                */

/* MODE @Bits 0..1 : Input Mode */
  #define VPRCSR_NORDIC_INMODEB_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define VPRCSR_NORDIC_INMODEB_MODE_Msk (0x3UL << VPRCSR_NORDIC_INMODEB_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define VPRCSR_NORDIC_INMODEB_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_INMODEB_MODE_Max (0x3UL)     /*!< Max enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_INMODEB_MODE_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODEB_MODE_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */
  #define VPRCSR_NORDIC_INMODEB_MODE_SHIFT (0x2UL)   /*!< Sampling and shifting on Counter1 event                              */
  #define VPRCSR_NORDIC_INMODEB_MODE_SHIFTA (0x3UL)  /*!< Sampling and shifting on Counter1 event, independent from output     */


/**
  * @brief INB [VPRCSR_NORDIC_INB] Buffered GPIO input
  */
  #define VPRCSR_NORDIC_INB (0x00000BE6ul)
  #define VPRCSR_NORDIC_INB_ResetValue (0x00000000UL) /*!< Reset value of INB register.                                        */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN0_Pos (0UL)           /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN0_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN0_Pos) /*!< Bit mask of PIN0 field.                        */
  #define VPRCSR_NORDIC_INB_PIN0_Min (0x0UL)         /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN0_Max (0x1UL)         /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN0_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN0_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN1_Pos (1UL)           /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN1_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN1_Pos) /*!< Bit mask of PIN1 field.                        */
  #define VPRCSR_NORDIC_INB_PIN1_Min (0x0UL)         /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN1_Max (0x1UL)         /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN1_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN1_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN2_Pos (2UL)           /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN2_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN2_Pos) /*!< Bit mask of PIN2 field.                        */
  #define VPRCSR_NORDIC_INB_PIN2_Min (0x0UL)         /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN2_Max (0x1UL)         /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN2_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN2_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN3_Pos (3UL)           /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN3_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN3_Pos) /*!< Bit mask of PIN3 field.                        */
  #define VPRCSR_NORDIC_INB_PIN3_Min (0x0UL)         /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN3_Max (0x1UL)         /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN3_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN3_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN4_Pos (4UL)           /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN4_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN4_Pos) /*!< Bit mask of PIN4 field.                        */
  #define VPRCSR_NORDIC_INB_PIN4_Min (0x0UL)         /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN4_Max (0x1UL)         /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN4_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN4_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN5_Pos (5UL)           /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN5_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN5_Pos) /*!< Bit mask of PIN5 field.                        */
  #define VPRCSR_NORDIC_INB_PIN5_Min (0x0UL)         /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN5_Max (0x1UL)         /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN5_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN5_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN6_Pos (6UL)           /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN6_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN6_Pos) /*!< Bit mask of PIN6 field.                        */
  #define VPRCSR_NORDIC_INB_PIN6_Min (0x0UL)         /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN6_Max (0x1UL)         /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN6_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN6_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN7_Pos (7UL)           /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN7_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN7_Pos) /*!< Bit mask of PIN7 field.                        */
  #define VPRCSR_NORDIC_INB_PIN7_Min (0x0UL)         /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN7_Max (0x1UL)         /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN7_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN7_HIGH (0x1UL)        /*!< Pin is High                                                          */

